Repository: TheShellLand/crossover-source
Catalog: po4a/po/pod/*.po
Languages: fr

source: $ po4a-gettextize -f <format> -m <master.doc> -p <translation.pot>
fr: $ po4a-gettextize -f <format> -m <maitre.doc> -p <traduction.pot>

source: E<lt>formatE<gt> is naturally the format used in the E<lt>master.docE<gt> document. As expected, the output goes into E<lt>translation.potE<gt>. Please refer to L<po4a-gettextize(1)> for more details about the existing options.
fr: Naturellement, E<lt>formatE<gt> est le format du document E<lt>maitre.docE<gt> et la sortie est placée dans E<lt>traduction.potE<gt>. Veuillez consulter L<po4a-gettextize(1)> pour plus de détails concernant les options existantes.

source: Actually translate what should be translated. For that, you have to rename the pot file for example to doc.XX.po (where XX is the ISO639 code of the language you are translating to, e.g. "fr" for French), and edit the resulting file. It is often a good idea to not name the file XX.po to avoid confusion with the translation of the program messages, but this your call. Don't forget to update the po file headers, they are important.
fr: Traduit réellement ce qui doit être traduit. Pour cela, vous devez renommer le fichier pot en doc.XX.po (où XX est le code ISO639 de la langue vers laquelle vous êtes en train de traduire, c.-à-d. S<« fr »> pour le français), puis éditer ce fichier. C'est souvent une bonne idée de ne pas nommer le fichier XX.po pour éviter de confondre ce fichier avec la traduction des messages du programme, mais vous faites comme vous voulez. N'oubliez pas de mettre à jour les en-têtes du fichier po, ils sont importants.

source: The actual translation can be done using the Emacs po mode or kbabel (KDE based) or gtranslator (GNOME based), or whichever program you prefer to use them. A good ol' vi could do the trick too, even if there is no specialized mode for this task.
fr: La traduction peut être réalisée avec Emacs et son mode po ou kbabel (basé sur KDE) ou gtranslator (basé sur GNOME) ou encore n'importe quel programme que vous préférez utiliser pour l'édition de ces fichiers. Un bon vieux vi fera l'affaire, même s'il n'y a pas de mode spécial pour ce type de tâche.

source: If you wish to learn more about this, you definitively need to refer to the gettext documentation, available in the B<gettext-doc> package.
fr: Si vous voulez en apprendre plus à ce sujet, vous voudrez probablement consulter la documentation de gettext, disponible dans le paquet B<gettext-doc>.

source: Once you're done with the translation, you want to get the translated documentation and distribute it to users along with the original one. For that, use the L<po4a-translate(1)> program like that (where XX is the language code):
fr: Une fois que la traduction est effectuée, il faut générer la documentation traduite et la distribuer avec l'original. Pour cela, utilisez L<po4a-translate(1)> de cette façon (XX représente le code de la S<langue) :>

source: $ po4a-translate -f <format> -m <master.doc> -p <doc-XX.po> -l <XX.doc>
fr: $ po4a-translate -f <format> -m <maitre.sgml> -p <doc-XX.po> -l <XX.sgml>

source: As before, E<lt>formatE<gt> is the format used in the E<lt>master.docE<gt> document. But this time, the po file provided with the -p flag is part of the input. This is your translation. The output goes into E<lt>XX.docE<gt>.
fr: Comme précédemment, E<lt>formatE<gt> est le format du document E<lt>maitre.sgmlE<gt>. Mais cette fois-ci, le fichier po fourni en paramètre de l'option -p est un fichier d'entrée. Il s'agit de votre traduction. La sortie se trouve dans le fichier E<lt>XX.sgmlE<gt>.

source: Please refer to L<po4a-translate(1)> for more details.
fr: Veuillez consulter L<po4a-translate(1)> pour plus de détails.

source: To update your translation when the original file has changed, use the L<po4a-updatepo(1)> program like that:
fr: Pour mettre à jour votre traduction lorsque l'original a changé, utilisez L<po4a-updatepo(1)> comme S<ceci :>

source: $ po4a-updatepo -f <format> -m <new_original.doc> -p <existing.XX.po>
fr: $ po4a-updatepo -f <format> -m <nouvel_original.doc> -p <courant.XX.po>

source: (Please refer to L<po4a-updatepo(1)> for more details)
fr: (Veuillez consulter L<po4a-updatepo(1)> pour plus de détails)

source: Naturally, the new paragraph in the document won't get magically translated in the C<po> file with this operation, and you'll need to update the C<po> file manually. Likewise, you may have to rework the translation for paragraphs which were modified a bit. To make sure you won't miss any of them, they are marked as "fuzzy" during the process and you have to remove this marker before the translation can be used by po4a-translate. As for the initial translation, the best is to use your favorite po editor here.
fr: Naturellement, les nouveaux paragraphes de ce document ne seront pas traduits par magie dans le fichier C<po> par cette opération, et vous devrez mettre à jour le fichier C<po> manuellement. De la même façon, vous devrez vérifier les traductions des paragraphes qui ont été légèrement modifiés. Pour vous assurer que vous n'en oubliez pas, ils sont marqués comme S<« fuzzy »> pendant cette phase, et vous devrez retirer cette marque avant d'utiliser la traduction avec po4a-translate. Comme pour la traduction originelle, vous pouvez utiliser votre éditeur de fichier po préféré.

source: Once your C<po> file is up-to-date again, without any untranslated or fuzzy string left, you can generate a translated documentation file, as explained in the previous section.
fr: Une fois que votre fichier po est de nouveau à jour, sans aucune chaîne non traduite ou marquée comme S<« fuzzy »>, vous pouvez générer un fichier de documentation traduit, comme expliqué dans la section précédente.

source: Often, you used to translate manually the document happily until a major reorganization of the original document happened. Then, after some unpleasant tries with diff or similar tools, you want to convert to po4a. But of course, you don't want to loose your existing translation in the process. Don't worry, this case is also handled by po4a tools and is called gettextization.
fr: Souvent, vous traduisez manuellement le document sans difficulté, jusqu'à ce qu'une réorganisation majeure du document d'origine apparaisse. Alors, après quelques essais infructueux en utilisant diff ou des outils similaires, vous voulez convertir la traduction à po4a. Mais bien sûr, vous ne souhaitez pas perdre votre traduction existante dans le même temps. Pas de panique, ce cas est aussi géré par les outils de po4a et est appelé gettextization.

source: The key here is to have the same structure in the translated document and in the original one so that the tools can match the content accordingly.
fr: Le point important pour ceci est d'avoir la même structure de document pour l'original et la version traduite, de façon à ce que les outils associent leur contenu correctement.

source: If you are lucky (i.e., if the structures of both documents perfectly match), it will work seamlessly and you will be set in a few seconds. Otherwise, you may understand why this process has such an ugly name, and you'd better be prepared to some grunt work here. In any case, remember that it is the price to pay to get the comfort of po4a afterward. And the good point is that you have to do so only once.
fr: Si vous avez de la chance (c.-à-d., si les structures des deux documents se correspondent parfaitement), ceci fonctionnera sans soucis, et vous n'en aurez que pour quelques secondes. Sinon, vous allez comprendre pourquoi ce processus a un nom si barbare, et vous devriez vous préparer à une tâche ingrate. Dans tous les cas, souvenez-vous que c'est le prix à payer pour bénéficier du confort que po4a vous apportera par la suite. Le point positif est que vous n'aurez à faire cela qu'une seule fois.

source: I cannot emphasis this too much. In order to ease the process, it is thus important that you find the exact version which were used to do the translation. The best situation is when you noted down the cvs revision used for the translation and you didn't modify it in the translation process, so that you can use it.
fr: Ceci ne sera jamais répété S<suffisamment :> afin de faciliter ce processus, il est très important de trouver la version exacte qui a été utilisée pour réaliser la traduction. La meilleure situation est quand vous avez noté la version CVS lors de la traduction.

source: It won't work well when you use the updated original text with the old translation. It remains possible, but is harder and really should be avoided if possible. In fact, I guess that if you fail to find the original text again, the best solution is to find someone to do the gettextization for you (but, please, not me ;).
fr: Ça ne fonctionnera pas très bien si vous utilisez le document d'origine mis à jour avec l'ancienne traduction. Ça reste possible, mais sera plus compliqué et doit être évité autant que possible. En fait, je pense que si vous n'arrivez pas à trouver le document original, la meilleure solution est de trouver quelqu'un pour faire la gettextization pour vous (mais, s'il vous plaît, pas S<moi ;)>.

source: Maybe I'm too dramatic here. Even when things go wrong, it remains ways faster than translating everything again. I was able to gettextize the existing French translation of the Perl documentation in one day, even if things B<did> went wrong. That was more than two megabytes of text, and a new translation would have lasted months or more.
fr: Je dramatise peut-être un peu trop ici. Même lorsque tout ne se passe pas bien, c'est bien plus rapide que de tout retraduire. J'ai pu réaliser une gettextization de la traduction française de Perl en un jour, même si les choses B<ne se sont pas> bien passées. Il y avait plus de deux mégaoctets de textes, et une nouvelle traduction aurait pris des mois.

source: Let me explain the basis of the procedure first and I will come back on hints to achieve it when the process goes wrong. To ease comprehension, the sgml module is taken as an example once again, but the format used doesn't really matter.
fr: Voici d'abord la procédure, puis nous reviendrons sur les astuces qui permettent d'y parvenir avec succès lorsqu'il y a un problème. Pour faciliter la compréhension, le module sgml est utilisé en exemple, mais le format est, encore une fois, sans importance.

source: Once you have the old original again, the gettextization may be as easy as:
fr: Une fois que vous avez retrouvé l'ancien document original, la gettextization peut être aussi facile que S<ceci :>

source: $ po4a-gettextize -f <format> -m <old.original> -l <old.translation> -p <doc-XX.po>
fr: $ po4a-gettextize -f <format> -m <original.anc> -l <traduction.anc> -p <doc-XX.po>

source: When you're lucky, that's it. You converted your old translation to po4a and can begin with the updating task right away. Just follow the procedure explained a few section ago to synchronize your po file with the newest original document, and update the translation accordingly.
fr: Si vous avez de la chance, c'est fini. Vous avez converti votre ancienne traduction pour po4a et pouvez commencer la phase de mise à jour qui suit. Utiliser la procédure décrite quelques sections auparavant pour synchroniser votre fichier po avec le nouveau document original, et mettez à jour votre traduction en conséquence.

source: Please note that even when things seem to work properly, there is still room for errors in this process. The point is that po4a is unable to understand the text to make sure that the translation match the original. That's why all strings are marked as "fuzzy" in the process. You should check each of them carefully before removing those markers.
fr: Veuillez noter que même si tout semble s'être bien passé, il reste une possibilité que des erreurs se soient introduites au cours du processus. En fait, po4a est incapable de vérifier que les chaînes correspondent à l'original, et il marque toutes les chaînes comme S<« fuzzy »> au cours de cette procédure. Vous devriez vérifier chacune d'elle soigneusement avant de retirer ces marques.

source: Often the document structures don't match exactly, preventing po4a-gettextize from doing its job properly. At that point, the whole game is about editing the files to get their damn structures matching.
fr: Souvent, la structure du document ne correspond pas exactement, ce qui empêche po4a-gettextize de faire son travail correctement. Pour contourner cela, vous pouvez éditer les fichiers afin de faire correspondre leur structure.

source: It may help to read the section L<Gettextization: how does it work?> below. Understanding the internal process will help you to make this work. The good point is that po4a-gettextize is rather verbose about what went wrong when it happens. First, it pinpoints where in the documents the structures' discrepancies are. You will learn the strings that don't match, their positions in the text, and the type of each of them. Moreover, the po file generated so far will be dumped to /tmp/gettextization.failed.po.
fr: La section L<S<Gettextization :> Comment ça S<marche ?>> ci-dessous pourra vous aider. La compréhension du fonctionnement interne vous aidera à réaliser cette tâche. Par chance, po4a-gettextize est relativement bavard sur ce qui s'est mal passé. Dans un premier temps, il indique où, dans les documents, se trouve la différence des structures. Vous obtiendrez les chaînes qui ne correspondent pas, leur position dans le texte, et leur type De plus, le fichier po généré ainsi sera écrit dans /tmp/gettextization.failed.po.

source: Remove all extra parts of the translations, such as the section in which you give the translator name and thank every people who contributed to the translation. Addenda, which are described in the next section, will allow you to re-add them afterward.
fr: Retirez toutes les parties propres à la traduction, telles que les sections dans lesquelles vous avez indiqué le nom du traducteur et les remerciements envers toutes les personnes qui ont contribué à la traduction. Les addenda qui sont décrits dans la section suivante vous permettront de les rajouter par la suite.

source: Do not hesitate to edit both the original and the translation. The most important thing is to get the po file. You will be able to update it afterward. That being said, editing the translation should be preferred when both are possible since it makes things easier when the gettextization is done.
fr: N'hésitez pas à éditer les deux fichiers. Le plus important est d'obtenir le fichier po. Vous pourrez le mettre à jour par la suite. Cela dit, il est tout de même préférable d'éditer la traduction quand c'est possible, puisque ça simplifiera les étapes suivantes.

source: If needed, kill some parts of the original if they happen to not be translated. When synchronizing the po with the document afterward, they will come back from themselves.
fr: Si besoin, supprimez des parties de l'original s'il se trouve qu'elles n'ont pas été traduites. Elles reviendront par la suite lorsque vous synchroniserez le po avec le document.

source: If you changed the structure a bit (to merge two paragraphs, or split another one), undo those changes. If there is issues in the original, you should inform the original author. Fixing them in your translation only fix it for a part of the community. And moreover, it's impossible when using po4a ;)
fr: Si vous avez un peu modifié la structure (pour combiner deux paragraphes ou pour en découper un autre), enlevez ces modifications. S'il y a des problèmes avec l'original, vous devriez en informer son auteur. Faire la correction dans votre traduction n'en fait bénéficier qu'une partie de la communauté. Et de plus, ce n'est pas possible lorsque po4a est utilisé.

source: Sometimes, the paragraph content does match, but their types don't. Fixing it is rather format-dependant. In pod and nroff, it often comes from the fact that one of the two contains a line beginning with a white space where the other doesn't. In those formats, such paragraph cannot be wrapped and thus become a different type. Just remove the space and you are fine. It may also be a typo in the tag name.
fr: Parfois, le contenu des paragraphes correspond, mais pas leur type. Corriger cela dépend du format. Pour les formats pod et nroff, cela provient souvent du fait qu'un des deux contient une ligne commençant par des espaces et pas l'autre. Pour ces formats, cela signifie que ce paragraphe ne doit pas être reformaté, il a donc un type différent. Retirez simplement les espaces et vous serez tranquille. Il se peut aussi qu'il s'agisse d'une petite erreur dans le nom d'une balise.

source: Likewise, two paragraphs may get merged together in pod when the separating line contains some spaces, or when there is no empty line before the =item line and the content of the item.
fr: De la même façon, deux paragraphes peuvent avoir été combinés, dans le format pod, si la ligne qui les sépare contient des espaces, ou s'il n'y a pas de ligne vide avant la ligne =item et le contenu de cet élément.

source: Sometimes, there is a desynchronization between the files, and the translation is attached to the wrong original paragraph. It is the sign that the real problem was before in the files. Check /tmp/gettextization.failed.po to see when the desynchronization begins, and fix it there.
fr: Il arrive également qu'il se produise une désynchronisation entre les fichiers, et la traduction se retrouve alors attachée au mauvais paragraphe. C'est le signe que le problème se situe avant dans le fichier. Consultez /tmp/gettextization.failed.po pour voir quand la désynchronisation s'est produite, et corrigez-la.

source: Sometimes, you get the strong feeling that po4a ate some parts of the text, either the original or the translation. /tmp/gettextization.failed.po indicates that both of them where gently matching, and then the gettextization fails because it tried to match one paragraph with the one after (or before) the right one, as if the right one disappeared. Curse po4a as I did when it first happened to me. Generously.
fr: D'autres fois, vous aurez l'impression que po4a a oublié des parties du texte original ou de la traduction. /tmp/gettextization.failed.po indique que les deux correspondent correctement, mais la gettextization échoue parce que po4a essaie de faire correspondre un paragraphe avec le paragraphe suivant (ou précédant) de celui qui devrait lui être associé, comme si celui-ci avait disparu. Vous pesterez sûrement contre po4a comme je l'ai fait quand ça m'est arrivé.

source: This unfortunate situation happens when the same paragraph is repeated over the document. In that case, no new entry is created in the po file, but a new reference is added to the existing one instead.
fr: Cette situation malheureuse se manifeste quand un même paragraphe est répété dans le document. Dans ce cas, aucune nouvelle entrée n'est créée dans le fichier po, mais une nouvelle référence est ajoutée à l'entrée existante.

source: So, when the same paragraph appears twice in the original but are not translated in the exact same way each time, you will get the feeling that a paragraph of the original disappeared. Just kill the new translation. If you prefer to kill the first translation instead when it was actually better, remove the second one from where it is and put it in place of the first one.
fr: Donc, lorsque le même paragraphe apparaît deux fois dans l'original mais n'est pas traduit exactement de la même façon chaque fois, vous aurez l'impression qu'un paragraphe de l'original a disparu. Supprimez juste la seconde traduction. Si vous préférez plutôt supprimer la première traduction parce que la nouvelle traduction est meilleure, enlevez la seconde de sa place et replacez-la à la place de la première.

source: In the contrary, if two similar but different paragraphs were translated in the exact same way, you will get the feeling that a paragraph of the translation disappeared. A solution is to add a stupid string to the original paragraph (such as "I'm different"). Don't be afraid, those things will disappear during the synchronization, and when the added text is short enough, gettext will match your translation to the existing text (marking it as fuzzy, but you don't really care since all strings are fuzzy after gettextization).
fr: De la même façon, si deux paragraphes légèrement différents ont été traduits de façon identique, vous aurez l'impression qu'un paragraphe de la traduction a disparu. Une solution consiste à ajouter une certaine chaîne dans le paragraphe du document original (S<« I'm> S<different »> par exemple). Ne vous inquiétez pas, ces modifications disparaîtront pendant la synchronisation, et quand le texte ajouté est suffisamment court, gettext associera votre traduction au texte existant de toute façon (en le marquant comme S<« fuzzy »>, ce qui n'a pas d'importance puisque toutes les chaînes sont marquées comme S<« fuzzy »> après la gettextization).

source: Hopefully, those tips will help you making your gettextization work and obtain your precious po file. You are now ready to synchronize your file and begin your translation. Please note that on large text, it may happen that the first synchronization takes a long time.
fr: Avec un peu de chance, ces astuces vous permettront de réaliser la gettextization et d'obtenir le précieux po. Vous serez alors prêt pour synchroniser votre fichier et commencer la traduction. Veuillez noter que pour les gros fichiers, la synchronisation peut prendre beaucoup de temps.

source: For example, the first po4a-updatepo of the Perl documentation's French translation (5.5 Mb po file) took about two days full on a 1Ghz G5 computer. Yes, 48 hours. But the subsequent ones only take a dozen of seconds on my old laptop. This is because the first time, most of the msgid of the po file don't match any of the pot file ones. This forces gettext to search for the closest one using a costly string proximity algorithm.
fr: Par exemple, la première exécution de po4a-updatepo pour la traduction de la documentation Perl (un fichier po de 5,5 Mo) a pris presque deux jours sur un G5 à 1GHz. Eh oui, 48 heures. Mais les mises à jour suivantes n'ont pris que quelques secondes sur un vieux portable. Ceci parce que la première fois, la plupart des msgid du po ne correspondent à aucun dans le fichier pot. Ce qui oblige gettext à rechercher la chaîne la plus proche avec un algorithme de recherche coûteux.

source: Because of the gettext approach, doing this becomes more difficult in po4a than it was when simply editing a new file along the original one. But it remains possible, thanks to the so-called B<addenda>.
fr: Du fait de l'approche de type gettext, faire ceci est plus compliqué avec po4a que ça ne l'était en éditant simplement le nouveau fichier et en lisant l'original à côté. Mais ceci reste possible en utilisant les S<« B<addenda> »>.

source: It may help the comprehension to consider addenda as a sort of patches applied to the localized document after processing. They are rather different from the usual patches (they have only one line of context, which can embed perl regular expression, and they can only add new text without removing any), but the functionalities are the same.
fr: Pour aider à leur compréhension, on peut considérer les addenda comme des sortes de rustines à appliquer sur le document traduit à la fin du processus. Ils sont assez différents des rustines usuelles (il n'y a qu'une seule ligne de contexte, qui peut contenir une expression rationnelle Perl, et ne peuvent que rajouter du texte, sans en enlever), mais la fonctionnalité qu'ils apportent est la même.
