Repository: TheShellLand/crossover-source
Catalog: po4a/po/pod/*.po
Languages: fr

source: Copyright 2006 by Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.
fr: Copyright 2006 par Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.

source: This program is free software; you may redistribute it and/or modify it under the terms of GPL (see the COPYING file).
fr: Ce programme est un logiciel S<libre ;> vous pouvez le copier et / ou le modifier sous les termes de la GPL (voir le fichier COPYING).

source: Locale::Po4a::Chooser - Manage po4a modules
fr: Locale::Po4a::Chooser - gestion des modules po4a

source: Locale::Po4a::Chooser is a module to manage po4a modules. Before, all po4a binaries used to know all po4a modules (pod, man, sgml, etc). This made the add of a new module boring, to make sure the documentation is synchronized in all modules, and that each of them can access the new module.
fr: Locale::Po4a::Chooser est un module permettant de gérer les modules po4a. Tous les outils de po4a avaient auparavant connaissance de tous les modules pour po4a (pod, man, sgml, etc.). Ceci rendait l'ajout d'un nouveau module assez embêtant, pour s'assurer que toutes les documentations étaient synchronisées dans tous les modules, et que tous ces binaires pouvaient accéder au nouveau module.

source: Now, you just have to call the Locale::Po4a::Chooser::new() function, passing the name of module as argument.
fr: Désormais, il n'y a qu'à appeler la fonction Locale::Po4a::Chooser::new() en lui passant le nom du module en paramètre.

source: You also have the Locale::Po4a::Chooser::list() function which lists the available format and exits on the value passed as argument.
fr: Vous disposez également de la fonction Locale::Po4a::Chooser::list(), qui liste les formats disponibles et quitte avec la valeur passée en paramètre.

source: SEE ALSO
fr: VOIR AUSSI

source: About po4a:
fr: À propos de S<po4a :>

source: About modules:
fr: À propos des S<modules :>

source: Copyright 2002,2003,2004,2005 by SPI, inc.
fr: Copyright 2002, 2003, 2004, 2005 par SPI, inc.

source: Locale::Po4a::Common - Common parts of the po4a scripts and utils
fr: Locale::Po4a::Common - utilitaires et parties communes des scripts po4a

source: Locale::Po4a::Common contains common parts of the po4a scripts and some useful functions used along the other modules.
fr: Locale::Po4a::Common comprend les parties communes des scripts po4a et quelques fonctions utiles pour certains modules.

source: FUNCTIONS
fr: FONCTIONS

source: Showing output messages
fr: Affichage de messages

source: Shows the current version of the script, and a short copyright message. It takes the name of the script as an argument.
fr: Affiche la version courante du script, et un court message de copyright. Il prend le nom du script comme paramètre.

source: This function displays a message the same way than sprintf() does, but wraps the result so that they look nice on the terminal.
fr: Cette fonction affiche un message de la même façon que sprintf(), mais met en plus le résultat en forme de telle sorte qu'il soit bien mis en forme sur un terminal.

source: This function works like wrap_msg(), but it takes a module name as the first argument, and leaves a space at the left of the message.
fr: Cette fonction fonctionne de la même façon que wrap_msg(), mais elle prend le nom d'un module comme premier paramètre, et ajoute un espace à la gauche du message.

source: This function works like wrap_msg(), but it takes a file:line reference as the first argument, a module name as the second one, and leaves a space at the left of the message.
fr: Cette fonction fonctionne comme wrap_msg(), mais elle prend une référence de la forme fichier:ligne comme premier paramètre, un nom de module comme second paramètre, et ajoute un espace à la gauche du message.

source: Wrappers for other modules
fr: Encapsulateur pour d'autres modules

source: When the Locale::Gettext module cannot be loaded, this module provide dummy (empty) implementation of the following functions. In that case, po4a messages won't get translated but the program will continue to work.
fr: Quand le module Locale::Gettext ne peut pas être chargé, ce module fournit une fausse implémentation (vide) pour les fonctions suivantes. Dans ce cas, les messages ne seront pas traduits, mais le programme continuera à fonctionner.

source: If Locale::gettext is present, this wrapper also calls setlocale(LC_MESSAGES, "") so callers don't depend on the POSIX module either.
fr: Si Locale::gettext est présent, cette encapsulation appellera setlocale(LC_MESSAGES, "") de telle sorte que les appelants ne dépendent pas non plus du module POSIX.

source: Copyright 2005 by SPI, inc.
fr: Copyright 2005 par SPI, inc.

source: Locale::Po4a::Debconf - Convert debconf templates from/to PO files
fr: Locale::Po4a::Debconf - convertit des questionnaires debconf depuis/vers des fichiers PO

source: Locale::Po4a::Debconf is a module to help the translation of the debconf templates into other [human] languages.
fr: Locale::Po4a::Debconf est un module permettant d'aider la traduction de questionnaires debconf dans d'autres langues.

source: Not tested.
fr: Non testé.

source: DO NOT USE THIS MODULE TO PRODUCE TEMPLATES. It's only good to extract data.
fr: N'UTILISEZ PAS CE MODULE POUR CRÉER DES QUESTIONNAIRES. Il n'est fait que pour extraire les données.

source: This module is loosely inspired from both po-debconf and debconf code. The adaptation for po4a was done by:
fr: Ce module est librement inspiré du code de po-debconf et de debconf. L'adaptation à été réalisée S<par :>

source: Copyright 2005 by SPI, inc.
fr: Copyright 2005 par SPI, inc.

source: Locale::Po4a::Dia - Convert uncompressed Dia diagrams from/to PO files
fr: Locale::Po4a::Dia - convertit les diagrammes Dia non compressés depuis/vers des fichiers PO

source: Locale::Po4a::Dia is a module to help the translation of diagrams in the uncompressed Dia format into other [human] languages.
fr: Locale::Po4a::Dia est un module permettant d'aider la traduction de diagrammes Dia non compressés dans d'autres langues.

source: You can get Dia (the graphical editor for these diagrams) from: http://www.gnome.org/projects/dia/
fr: Dia (l'éditeur graphique pour ces diagrammes) est disponible à S<l'adresse :> http://www.gnome.org/projects/dia/

source: TRANSLATING WITH PO4A::DIA
fr: TRADUIRE AVEC PO4A::DIA

source: This module only translates uncompressed Dia diagrams. You can save your uncompressed diagrams with Dia itself, unchecking the "Compress diagram files" at the "Save Diagram" dialog.
fr: Ce module ne traduit que les diagrammes Dia non compressés. Vous pouvez sauvegarder vos diagrammes au format non compressé à partir de Dia en décochant S<« Compresser> les fichiers S<enregistrés »> (ou S<« Compress> diagram S<files »>) dans la boîte de dialogue S<« Enregistrer> le S<diagramme »> (ou S<« Save> S<Diagram »>).

source: Another way is to uncompress the dia files from command line with: gunzip < original.dia > uncompressed.dia
fr: Vous pouvez aussi décompresser les fichiers dia avec la ligne de commande S<suivante :> gunzip < original.dia > non_compresse.dia

source: This module is fully functional, as it relies in the L<Locale::Po4a::Xml> module. This only defines the translatable tags (E<lt>dia:stringE<gt>), and filters the internal strings (the content of the E<lt>dia:diagramdataE<gt> tag), not interesting for translation.
fr: Ce module est complètement fonctionnel, puisqu'il repose sur le module L<Locale::Po4a::Xml>. Il ne fait que définir les balises à traduire (E<lt>dia:stringE<gt>) et filtre les chaînes internes (le contenu des balises E<lt>dia:diagramdataE<gt>), qui ne sont pas intéressantes pour la traduction.

source: Copyright (c) 2004 by Jordi Vilalta <jvprat@gmail.com>
fr: Copyright (c) 2004 par Jordi Vilalta <jvprat@gmail.com>

source: Locale::Po4a::Docbook - Convert Docbook XML documents from/to PO files
fr: Locale::Po4a::Docbook - convertit les documents XML Docbook depuis/vers des fichiers PO

source: Locale::Po4a::Docbook is a module to help the translation of DocBook XML documents into other [human] languages.
fr: Locale::Po4a::Docbook est un module permettant d'aider la traduction de documents DocBook XML dans d'autres langues.

source: Please note that this module is still under heavy development, and not distributed in official po4a release since we don't feel it to be mature enough. If you insist on trying, check the CVS out.
fr: Veuillez noter que ce module est encore en développement, et toujours pas distribué dans la livraison officielle de po4a parce que nous ne pensons pas qu'il soit suffisamment mature. Si vous insistez pour l'essayer, veuillez récupérer la version du CVS.

source: This module is fully functional, as it relies in the L<Locale::Po4a::Xml> module. This only defines the translatable tags and attributes.
fr: Ce module est complètement fonctionnel, puisqu'il repose sur le module L<Locale::Po4a::Xml>. Il ne fait que définir les balises et attributs à traduire.

source: The only known issue is that it doesn't handle entities yet, and this includes the file inclusion entities, but you can translate most of those files alone (except the typical entities files), and it's usually better to maintain them separated.
fr: Le seul problème connu est qu'il ne supporte toujours pas les entités, cela comprend l'inclusion d'entités dans des fichiers, mais vous pouvez traduire la plupart de ces fichiers séparément (à l'exception des fichiers d'entités typiques), et il est généralement mieux de les maintenir séparés.

source: Locale::Po4a::Guide - Convert Guide XML documents from/to PO files
fr: Locale::Po4a::Guide - convertit les documents XML Guide depuis/vers des fichiers PO

source: Locale::Po4a::Guide is a module to help in the translation of the Gentoo Linux documentation in the Guide XML format into other [human] languages.
fr: Locale::Po4a::Guide est un module permettant d'aider la traduction de la documentation de Gentoo Linux au format Guide XML vers d'autres langues.

source: This format is documented here: http://www.gentoo.org/doc/en/xml-guide.xml
fr: Ce format est documenté à S<l'adresse :> http://www.gentoo.org/doc/en/xml-guide.xml

source: The only known issue is that it doesn't include files with the <include href="..."> tag, but you can translate all those files alone, and it's usually better to have them separated.
fr: Le seul problème connu est qu'il n'inclut pas les fichiers inclus par une balise <include href="...">, mais vous pouvez traduire tous ces fichiers séparément, ce qui est en général préférable.

source: Locale::Po4a::Html - Convert html documents from/to PO files
fr: Locale::Po4a::Html - convertit les documents html depuis/vers des fichiers PO

source: Locale::Po4a::Html is a module to help the translation of documentation in the HTML format into other [human] languages.
fr: Locale::Po4a::Html est un module qui permet d'aider la traduction de documentation au format HTML vers d'autres langues.

source: Please note that this module is not distributed with the main po4a archive because we don't feel it mature enough for that. If you insist on using it anyway, check it from the CVS out.
fr: Veuillez noter que ce module n'est pas distribué dans la livraison officielle de po4a parce que nous ne pensons pas qu'il soit suffisamment mature. Si vous insistez pour l'essayer, veuillez récupérer la version du CVS.

source: Locale::Po4a::Ini - Convert ini files from/to PO files
fr: Locale::Po4a::Ini - convertit des fichiers ini depuis/vers des fichiers PO

source: Locale::Po4a::Ini is a module to help the translation of INI files into other [human] languages.
fr: Locale::Po4a::Ini est un module permettant d'aider la traduction de fichiers INI dans d'autres langues.

source: The module searches for lines of the following format and extracts the quoted text:
fr: Le module recherche des lignes au format suivant et extrait le text entre guillemets :

source: identificator="text than can be translated"
fr: identifiant="texte qui peut être traduit"

source: NOTE: If the text is not quoted, it will be ignored.
fr: NOTE : Si le texte n'est pas entre guillemets, il sera ignoré.

source: Copyright 2006 by BitDefender
fr: Copyright 2006 par BitDefender

source: Locale::Po4a::KernelHelp - Convert kernel configuration help from/to PO files
fr: Locale::Po4a::KernelHelp - Convertit l'aide à la configuration du noyau depuis/vers des fichiers PO

source: Locale::Po4a::KernelHelp is a module to help the translation of documentation for the Linux kernel configuration options into other [human] languages.
fr: Locale::Po4a::KernelHelp est un module permettant d'aider à la traduction de la documentation des options de configuration du noyau Linux vers d'autres langues.

source: This module is just written, and needs more tests. Most of the needed work will concern the tools used to parse this file (and configure the kernel), so that they accept to read the documentation from another (translated) file.
fr: Ce module vient juste d'être écrit et nécessite plus de tests. Le plus gros du travail concernera les outils chargés de lire ce fichier (et de configurer le noyau), afin qu'ils acceptent de lire la documentation depuis un autre fichier (traduit).

source: Copyright 2002 by SPI, inc.
fr: Copyright 2002 par SPI, inc.

source: Locale::Po4a::LaTeX - Convert LaTeX documents and derivates from/to PO files
fr: Locale::Po4a::LaTeX - convertit les documents LaTeX (ou dérivés) depuis/vers des fichiers PO

source: Locale::Po4a::LaTeX is a module to help the translation of LaTeX documents into other [human] languages. It can also be used as a base to build modules for LaTeX-based documents.
fr: Locale::Po4a::LaTeX est un module qui permet d'aider à traduire des documents LaTeX dans d'autres langues. Il peut aussi servir de base pour créer d'autres modules pour des documents basés sur le format LaTeX.

source: This module contains the definitions of common LaTeX commands and environments.
fr: Ce module contient les définitions de commandes et environnements couramment rencontrés dans des documents LaTeX.

source: See the L<Locale::Po4a::TeX(3pm)|Locale::Po4a::TeX> manpage for the list of recognized options.
fr: Consultez la page de manuel L<Locale::Po4a::TeX(3pm)|Locale::Po4a::TeX> pour la liste des options valables.

source: Copyright 2004, 2005 by Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.
fr: Copyright 2004, 2005 par Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.

source: This program is free software; you may redistribute it and/or modify it under the terms of GPL (see COPYING file).
fr: Ce programme est un logiciel S<libre ;> vous pouvez le copier et / ou le modifier sous les termes de la GPL (voir le fichier COPYING).

source: Locale::Po4a::Man - Convert manual pages from/to PO files
fr: Locale::Po4a::Man - convertit des pages de manuels depuis/vers des fichiers PO

source: Locale::Po4a::Man is a module to help the translation of documentation in the nroff format (the language of manual pages) into other [human] languages.
fr: Locale::Po4a::Man est un module qui permet d'aider la traduction de documentations écrites au format nroff (utilisé pour les pages de manuel) vers d'autres langues.

source: TRANSLATING WITH PO4A::MAN
fr: TRADUIRE AVEC PO4A::MAN

source: This module tries pretty hard to make translator's life easier. For that, the text presented to translators isn't a verbatim copy of the text found in the man page. Indeed, the cruder parts of the nroff format are hidden, so that translators can't mess up with them.
fr: Ce module essaie autant que possible de faciliter le travail des traducteurs. Dans ce but, il ne présente pas le texte tel qu'il se trouve dans la page de manuel, mais cache les parties au format nroff les plus brutes, de façon à ce que les traducteurs ne puissent pas y mettre la pagaille.

source: Text wrapping
fr: Retours à la ligne

source: Unindented paragraphs are automatically rewrapped for the translator. This can lead to some minor difference in the generated output, since the rewrapping rules used by groff aren't very clear. For example, two spaces after a parenthesis are sometimes preserved, while typographic rules only ask to preserve the two spaces after the period sign (ok, I'm not native speaker, and I'm not sure of that. If you have any other information, you're welcome).
fr: Les paragraphes non indentés sont automatiquement remis en forme pour les traducteurs. Ceci peut générer de légères différences dans le document généré parce que les règles de remise en forme utilisées par groff ne sont pas des plus claires. Par exemple, deux espaces après une parenthèse peuvent être conservés, alors que les règles typographiques ne demandent qu'à conserver deux espaces après un point (l'anglais n'étant pas ma langue natale, des informations sur ce sujet sont les bienvenues).

source: Anyway, the difference will only be about the position of the extra spaces in wrapped paragraph, and I think it's worth.
fr: De toute façon, la seule différence concernera l'emplacement d'espaces additionnels dans des paragraphes remis en forme, et je pense que ça vaut le coût.

source: Font specification
fr: Spécification de la police

source: The first change is about font change specifications. In nroff, there are several ways to specify if a given word should be written in small, bold or italics. In the text to translate, there is only one way, borrowed from the pod (perl online documentation) format:
fr: La première modification concerne les demandes de changement de police. Dans nroff, il y a plusieurs façon de spécifier qu'un mot doit être affiché avec une police plus petite, en gras ou en italique. Dans le texte à traduire, il n'y a qu'une façon, empruntée au format pod (Perl Online S<Documentation) :>

source: IE<lt>textE<gt> -- italic text
fr: IE<lt>texteE<gt> -- texte en italique

source: equivalent to \fItext\fP or ".I text"
fr: équivalent à \fItexte\fP ou S<« .I texte »>

source: BE<lt>textE<gt> -- bold text
fr: BE<lt>texteE<gt> -- texte en gras

source: equivalent to \fBtext\fP or ".B text"
fr: équivalent à \fBtexte\fP ou S<« .B texte »>

source: RE<lt>textE<gt> -- roman text
fr: RE<lt>textE<gt> -- texte roman

source: equivalent to \fRtext\fP
fr: équivalent à \fRtexte\fP

source: CWE<lt>textE<gt> -- constant width text
fr: CWE<lt>textE<gt> -- texte à chasse fixe

source: equivalent to \f(CWtext\fP or ".CW text"
fr: équivalent à \f(CWtexte\fP ou S<« .CW texte »>

source: Remark: The CW face is not available for all groff devices. It is not recommended to use it. It is provided for your convenience.
fr: S<Remarque :> La police CW n'est pas disponible pour tous les formats de sortie de groff. Il n'est pas recommandé de l'utiliser, mais elle est fournie pour vous rendre service.

source: Automatic characters transliteration
fr: Modification automatique de caractères

source: Po4a automatically transliterate some characters to ease the translation or the review of the translation. Here is the list of the transliterations:
fr: Po4a modifie automatiquement certains caractères afin de faciliter la traduction ou la revue de la traduction. Voici la liste de ces S<modifications :>

source: hyphens
fr: tirets

source: Hyphens (-) and minus signs (\-) in man pages are all transliterated as simple dashes (-) in the PO file. Then all dash are transliterated into roff minus signs (\-) when the translation is inserted into the output document.
fr: Les traits d'union (-) et les signes moins (\-) des pages de manuel sont changés en simple tiret (-) dans le fichier PO. Par la suite, tous les tirets sont changés en signes moins roff (\-) lorsque la traduction est insérée dans le document de sortie.

source: Translators can force an hyphen by using the roff glyph '\[hy]' in their translations.
fr: Les traducteurs peuvent forcer l'utilisation d'un trait d'union en utilisant le caractère roff '\[hy]' dans leurs traductions.

source: non-breaking spaces
fr: espaces insécables

source: Translators can use non-breaking spaces in their translations. These non-breaking spaces (0xA0 in latin1) will be transliterated into a roff non-breaking space ('\ ').
fr: Les traducteurs peuvent utiliser des espaces insécables dans leurs traductions. Ces espaces insécables (0xA0 en latin1) seront modifiés en un espace insécable roff ('\ ').

source: quotes transliterations
fr: modifications de guillemets

source: `` and '' are respectively tranliterated into \*(lq and \*(rq.
fr: `` et '' sont respectivement changés en \*(lq and \*(rq.

source: To avoid these transliterations, translators can insert a zero width roff character (i.e., using `\&` or '\&' respectively).
fr: Pour éviter ces modifications, les traducteurs peuvent insérer un espace roff de taille nulle (c'est-à-dire en utilisant respectivement `\&` ou '\&').

source: Putting 'E<lt>' and 'E<gt>' in translations
fr: Utiliser des S<« E<lt> »> ou des S<« E<gt> »> dans les traductions

source: Since these chars are used to delimit parts under font modification, you can't use them verbatim. Use EE<lt>ltE<gt> and EE<lt>gtE<gt> instead (as in pod, one more time).
fr: Puisque ces caractères sont utilisés pour délimiter les changements de police, vous ne pouvez pas les utiliser tels quels. Utilisez EE<lt>ltE<gt> et EE<lt>gtE<gt> à la place (comme pour le format pod, encore une fois).

source: These are this module's particular options:
fr: Voici les options particulières à ce S<module :>

source: Activate debugging for some internal mechanisms of this module. Use the source to see which parts can be debugged.
fr: Active le débogage pour certains mécanismes internes du module. Regardez les sources pour savoir ce qui peut être débogué.

source: Increase verbosity.
fr: Augmente le niveau de bavardage.

source: This option permits to change the behavior of the module when it encounter a .de, .ie or .if section. It can take the following values:
fr: Cette option permet de changer le comportement du module lorsqu'il rencontre une section .de, .ie ou .if. Elle peut prendre les valeurs S<suivantes :>

source: This is the default value. The module will fail when a .de, .ie or .if section is encountered.
fr: Il s'agit de la valeur par défaut. Ce module échouera lorsqu'il rencontrera une section .de, .ie ou .if.

source: Indicates that the .de, .ie or .if sections must be copied as is from the original to the translated document.
fr: Indique que les sections .de, .ie ou .if doivent être copiées telles quelles depuis l'original vers le document traduit.

source: Indicates that the .de, .ie or .if sections will be proposed for the translation. You should only use this option if a translatable string is contained in one of these section. Otherwise, I<verbatim> should be preferred.
fr: Indique que les sections .de, .ie ou .if doivent être proposées à la traduction. Vous ne devriez utiliser cette option que si une de ces sections contient une chaîne à traduire. Sinon, I<verbatim> doit lui être préférée.

source: This option specifies that the file was generated, and that po4a should not try to detect if the man pages was generated from another format. This permits to use po4a on generated man pages. This option does not take any argument.
fr: Cette option spécifie que le fichier a été généré, et que po4a ne doit pas chercher à détecter si la page de manuel à été généré depuis un autre format. Elle permet d'utiliser po4a sur des pages de manuel générées. Cette option ne prend aucun paramètre.

source: This option is only useful for mdoc pages.
fr: Cette option n'est utile que pour les pages au format mdoc.
