Repository: TheShellLand/crossover-source
Catalog: po4a/po/pod/*.po
Languages: fr

source: NAME
fr: NOM

source: po4a - framework to translate documentation and other materials
fr: po4a - Cadre de travail pour la traduction de documentations et autres documents

source: The po4a (po for anything) project goal is to ease translations (and more interestingly, the maintenance of translations) using gettext tools on areas where they were not expected like documentation.
fr: L'objectif du projet po4a [po for anything -- po pour tout] est de simplifier la traduction (et de façon plus intéressante, la maintenance des traductions) en utilisant les outils gettext dans des domaines pour lesquels ils n'étaient pas destinés, comme la documentation.

source: Table of content
fr: Table des matières

source: This document is organized as follow:
fr: Ce document est organisé de la manière S<suivante :>

source: 1 Why should I use po4a? What is it good for?
fr: 1 Pourquoi utiliser S<po4a ?> À quoi cela S<sert-il ?>

source: This introducing chapter explains the motivation of the project and its philosophy. You should read it first if you are in the process of evaluating po4a for your own translations.
fr: Cette section d'introduction explique les motivations du projet et sa philosophie. Vous devriez le lire si vous cherchez à évaluer po4a pour vos traductions.

source: 2 How to use po4a?
fr: 2 Comment utiliser les fonctionnalités de S<po4a ?>

source: This chapter is a sort of reference manual, trying to answer the users' questions and to give you a better understanding of the whole process. This introduces how to do things with po4a and serve as an introduction to the documentation of the specific tools.
fr: Cette section est une sorte de manuel de référence qui cherche à répondre aux questions des utilisateurs et qui vous donnera une meilleure compréhension de son fonctionnement. Il vous donnera les bases de l'utilisation de po4a et sert d'introduction à la documentation des outils spécifiques.

source: HOWTO begin a new translation?
fr: Comment commencer une nouvelle S<traduction ?>

source: HOWTO change the translation back to a documentation file?
fr: Comment convertir la traduction en un fichier de S<documentation ?>

source: HOWTO update a po4a translation?
fr: Comment mettre à jour une traduction faite avec S<po4a ?>

source: HOWTO convert a pre-existing translation to po4a?
fr: Comment convertir une traduction pré-existante à ce S<système ?>

source: HOWTO add extra text to translations (like translator's name)?
fr: Comment ajouter des choses n'étant pas des traductions (comme le nom du S<traducteur) ?>

source: HOWTO do all this in one program invocation?
fr: Comment automatiser tout S<ceci ?>

source: 3 How does it work?
fr: 3 Comment ça S<marche ?>

source: This chapter gives you a brief overview of the po4a internals, so that you may feel more confident to help us maintaining and improving it. It may also help you understanding why it does not do what you expected, and how to solve your problems.
fr: Cette section vous donne un bref aperçu des rouages internes de po4a afin que vous vous sentiez plus à même de nous aider à le maintenir et l'améliorer. Elle peut également vous permettre de comprendre pourquoi cela ne fait pas ce que vous souhaitez et corriger vos problèmes par vous-même.

source: This chapter groups the Frequently Asked Questions. In fact, most of the questions for now could be formulated that way: "Why is it designed this way, and not that one?" If you think po4a isn't the right answer to documentation translation, you should consider reading this section. If it does not answer your question, please contact us on the E<lt>po4a-devel@lists.alioth.debian.orgE<gt> mailing list. We love feedback.
fr: Cette section regroupe les questions le plus souvent posées. En fait, la plupart d'entre elles sont des questions de design du projet. Si vous pensez que po4a n'est pas la bonne réponse au problème de traduction de documentation, lisez cette section avant de nous donner votre avis sur la liste de diffusion E<lt>po4a-devel@lists.alioth.debian.orgE<gt>. Votre avis nous intéresse.

source: 5 Specific notes about modules
fr: 5 Notes spécifiques à certains modules

source: This chapter presents the specificities of each module from the translator and original author's point of view. Read this to learn the syntax you will encounter when translating stuff in this module, or the rules you should follow in your original document to make translators' life easier.
fr: Cette section présente les spécificités de chaque module du point de vue du traducteur et de l'auteur original. Lisez le pour prendre connaissance du format des traductions pour ce module et les règles à suivre dans le document original pour rendre le travail des traducteurs plus simple.

source: Actually, this section is not really part of this document. Instead, it is placed in each module's documentation. This helps ensuring that the information is up to date by keeping the documentation and the code together.
fr: Cette section ne fait pas vraiment partie de ce document, mais elle est placée dans chaque documentation des modules. Ceci permet de s'assurer que les informations sont à jour en conservant la documentation et le code ensemble.

source: 6 Known bugs and feature requests
fr: 6 Bogues connus et fonctionnalités manquantes

source: Quite a few already :(
fr: Un certain nombre S<déjà :(>

source: Why should I use po4a? What it is good for?
fr: Pourquoi utiliser S<po4a ?> Dans quel domaine est-il S<bon ?>

source: I like the idea of open-source software, making it possible for everybody to access to software and to their source code. But being French, I'm well aware that the licensing is not the only restriction to the openness of software: non-translated free software is useless for non-English speakers, and we still have some work to make it available to really everybody out there.
fr: J'aime le concept des logiciels à sources ouverts, qui permettent de donner à tous un accès au logiciel et à son code source. Mais, étant moi-même français, je suis conscient que la licence n'est pas le seul frein à l'ouverture d'un S<logiciel :> les logiciels non traduits, même s'ils sont libres, sont sans aucune utilité pour ceux qui ne comprennent pas l'anglais, et il y a encore beaucoup de travail pour les rendre accessibles à vraiment tout le monde.

source: The perception of this situation by the open-source actors did dramatically improve recently. We, as translators, won the first battle and convinced everybody of the translations' importance. But unfortunately, it was the easy part. Now, we have to do the job and actually translate all this stuff.
fr: La perception du problème par les acteurs du développement libre s'est fortement accélérée récemment. Nous, les traducteurs, avons gagné une première bataille et avons convaincu tout le monde de l'importance des traductions. Mais c'est malheureusement la partie la plus facile. Il faut maintenant réaliser tout le travail et traduire tous les documents.

source: Actually, open-source software themselves benefit of a rather decent level of translation, thanks to the wonderful gettext tool suite. It is able to extract the strings to translate from the program, present a uniform format to translators, and then use the result of their works at run time to display translated messages to the user.
fr: Les logiciels aux sources ouverts bénéficient d'un niveau de traduction relativement bon, grâce à la formidable suite d'outils gettext. Ces outils permettent d'extraire les chaînes à traduire du programme, de les présenter sous une forme standard pour les traducteurs, puis d'utiliser le résultat de leur travail lors de l'exécution pour afficher les messages traduits aux utilisateurs.

source: But the situation is rather different when it comes to documentation. Too often, the translated documentation is not visible enough (not distributed as a part of the program), only partial, or not up to date. This last situation is by far the worst possible one. Outdated translation can reveal worse than no translation at all to the users by describing old program behavior which are not in use anymore.
fr: Mais cette situation est assez différente en ce qui concerne les documentations. Trop souvent, la documentation traduite n'est pas assez visible (pas distribuée avec le programme), seulement partielle ou pas à jour. Cette dernière situation est de loin la moins bonne. Les traductions pas à jour peuvent se révéler plus embêtantes pour les utilisateurs que l'absence de traduction parce que d'anciens comportements d'un programme peuvent y être décrits, mais ne plus être en vigueur.

source: The problem to solve
fr: La problématique

source: Translating documentation is not very difficult in itself. Texts are far longer than the messages of the program and thus take longer to be achieved, but no technical skill is really needed to do so. The difficult part comes when you have to maintain your work. Detecting which parts did change and need to be updated is very difficult, error-prone and highly unpleasant. I guess that this explains why so much translated documentation out there are outdated.
fr: La traduction des documentations n'est pas une tâche difficile en elle-même. Les textes sont bien plus longs que les messages des programmes ce qui rend leur traduction plus longue, mais il n'y a aucune difficulté technique à faire ceci. La difficulté vient en fait de la maintenance de la traduction. La détection des parties ayant été modifiées et nécessitant une mise à jour est une tâche très difficile, ce qui explique que tant de traductions ne correspondent plus à la version originale.

source: The po4a answers
fr: La réponse de po4a

source: So, the whole point of po4a is to make the documentation translation I<maintainable>. The idea is to reuse the gettext methodology to this new field. Like in gettext, texts are extracted from their original locations in order to be presented in a uniform format to the translators. The classical gettext tools help them updating their works when a new release of the original comes out. But to the difference of the classical gettext model, the translations are then re-injected in the structure of the original document so that they can be processed and distributed just like the English version.
fr: La I<maintenance> de la traduction est donc la raison première de po4a. La façon de faire de gettext a été réutilisée dans ce but. Comme avec gettext, des chaînes de texte sont extraites de leur emplacement d'origine de façon à être présentées de façon standardisée aux traducteurs. Les outils pour gettext sont ensuite utilisés pour aider le traducteur à faire son travail lorsqu'une nouvelle version du document est disponible. Mais, à la différence de l'utilisation classique de gettext, les traductions sont réinjectée dans la structure du document d'origine de façon à pouvoir les utiliser ou les distribuer comme les documents de la version anglaise.

source: Thanks to this, discovering which parts of the document were changed and need an update becomes very easy. Another good point is that the tools will make almost all the work when the structure of the original document gets fundamentally reorganized and when some chapters are moved around, merged or split. By extracting the text to translate from the document structure, it also keeps you away from the text formatting complexity and reduces your chances to get a broken document (even if it does not completely prevent you to do so).
fr: Grâce à ceci, la détection des parties du document qui nécessitent une mise à jour est très facile. Un autre avantage est que l'outil va faire une bonne partie du travail lorsque seule la structure du document à été modifiée et que des chapitres ont été déplacés, rassemblés ou redécoupés. En extrayant le texte à traduire de la structure du document, il permet également de masquer la complexité de la mise en page et réduit les chances d'avoir un document défectueux (même s'il reste un risque).

source: Please also see the L<FAQ> below in this document for a more complete list of the advantages and disadvantages of this approach.
fr: Veuillez également consulter la L<FAQ> plus bas dans ce document pour une liste plus complète des avantages et inconvénients de cette approche.

source: Supported formats
fr: Formats supportés

source: Currently, this approach has been successfully implemented to several kinds of text formatting formats:
fr: Actuellement, cette approche a été implémentée avec succès pour un certain nombre de formats de mise en page de texte.

source: The good old manual pages' format, used by so much programs out there. The po4a support is very welcome here since this format is somewhat difficult to use and not really friendly to the newbies. The L<Locale::Po4a::Man(3pm)|Man> module also supports the mdoc format, used by the BSD man pages (they are also quite common on Linux).
fr: Le bon vieux format des pages de manuel, utilisé par beaucoup de programmes. Le support de po4a pour ce format est très utile parce que ce format est assez compliqué, surtout pour les débutants. Le module L<Locale::Po4a::Man(3pm)|Man> supporte également le format mdoc, utilisé par les pages de manuel BSD (elles sont également assez fréquentes sous Linux).

source: This is the Perl Online Documentation format. The language and extensions themselves are documented that way, as well as most of the existing Perl scripts. It makes easy to keep the documentation close to the actual code by embedding them both in the same file. It makes programmer life easier, but unfortunately, not the translator one.
fr: C'est le format pour la documentation en ligne de Perl (S<« Perl> Online S<Documentation »>). Le langage et ses documentations sont documentés de cette façon, ainsi que la plupart des scripts Perl existants. Il permet de garder la documentation plus fidèle au code en les intégrant tous deux au même fichier. Il rend la vie du programmeur plus simple, mais malheureusement pas celle du traducteur.

source: Even if somewhat superseded by XML nowadays, this format is still used rather often for documents which are more than a few screens long. It allows you to make complete books. Updating the translation of so long documents can reveal to be a real nightmare. diff reveals often useless when the original text was re-indented after update. Fortunately, po4a can help you in that process.
fr: Même s'il est de plus en plus remplacé par le XML, ce format est encore assez utilisé pour les documents dont la taille dépasse plusieurs écrans. Il permet de faire des livres complets. La mise à jours de documents aussi longs est un vrai cauchemar. diff se montre souvent inutile quand le document original a été réindenté après une mise à jour. Heureusement, po4a vous aide dans cette tâche.

source: Currently, only the debiandoc and docbook DTD are supported, but adding support to a new one is really easy. It is even possible to use po4a on an unknown sgml dtd without changing the code by providing the needed information on the command line. See L<Locale::Po4a::Sgml(3pm)> for details.
fr: Actuellement, seuls les DTD debiandoc et docbook sont supportés, mais l'ajout d'un nouveau est très facile. Il est même possible d'utiliser po4a avec un DTD sgml inconnu sans modifier le code en fournissant les informations nécessaires sur la ligne de commande. Veuillez consulter L<Locale::Po4a::Sgml(3pm)> pour plus de détails.

source: The LaTeX format is a major documentation format used in the Free Software world and for publications. The L<Locale::Po4a::LaTeX(3pm)|LaTeX> module was tested with the Python documentation, a book and some presentations.
fr: Le format LaTeX est un format majeur utilisé pour les documentations dans le monde du logiciel libre ou pour des publications. Le module L<Locale::Po4a::LaTeX(3pm)|LaTeX> a été testé avec la documentation de Python, un livre et avec quelques présentations.

source: All the GNU documentation is written in this format (that's even one of the requirement to become an official GNU project). The support for L<Locale::Po4a::Texinfo(3pm)|Texinfo> in po4a is still at the beginning. Please report bugs and feature requests.
fr: Toutes les documentations du projet GNU sont écrites dans ce format (c'est même une des exigences pour devenir un projet officiel du projet GNU). Le support pour L<Locale::Po4a::Texinfo(3pm)|Texinfo> dans po4a en est encore à ses début. Veuillez nous envoyer des rapports de bogue ou des demandes de nouvelle fonctionnalité.

source: The XML format is a base format for many documentation formats.
fr: Le format XML est à la base de beaucoup de formats pour la documentation.

source: Currently, the docbook DTD is supported by po4a. See L<Locale::Po4a::Docbook(3pm)> for details.
fr: À ce jour, la DTD docbook est supportée par po4a. Veuillez consulter L<Locale::Po4a::Docbook(3pm)> pour plus de détails.

source: others
fr: autres

source: Po4a can also handle some more rare or specialized formats, such as the documentation of compilation options for the 2.4.x kernels or the diagrams produced by the dia tool. Adding a new one is often very easy and the main task is to come up with a parser of your target format. See L<Locale::Po4a::TransTractor(3pm)> for more information about this.
fr: Po4a peut également gérer des formats plus rares et plus spécifiques, tels que celui de la documentation des options de compilation des noyaux 2.4.x ou les diagrammes produits par l'outil dia. L'ajout d'un nouveau format est souvent très simple, et consiste principalement à fournir un interpréteur pour le format voulu. Veuillez consulter L<Locale::Po4a::TransTractor(3pm)> pour plus d'informations à ce sujet.

source: Unsupported formats
fr: Formats non supportés

source: Unfortunately, po4a still lacks support for several documentation formats.
fr: Malheureusement, po4a ne supporte pas encore certains formats utilisés pour les documentations.

source: There is a whole bunch of other formats we would like to support in po4a, and not only documentation ones. Indeed, we aim at plugging all "market holes" left by the classical gettext tools. It encompass package descriptions (deb and rpm), package installation scripts questions, package changelogs, and all specialized file formats used by the programs such as game scenarios or wine resource files.
fr: Il y a une quantité d'autres formats que nous aimerions supporter avec po4a, et pas seulement des formats de documentation. En fait, nous visons toutes les S<« niches »> laissées par les outils gettext classiques. Cela va de la traduction de la documentation des descriptions des paquets Debian et paquetages rpm, aux les questions posées par les scripts d'installation, ex passant par les fichiers changelog, et de tous les formats spécifiques tels que les scénarios de jeux ou les fichiers de ressource pour wine.

source: How to use po4a?
fr: Comment utiliser S<po4a ?>

source: Graphical overview
fr: Résumé graphique

source: The following schema gives an overview of the process of translating documentation using po4a. Do not be afraid by its apparent complexity, it comes from the fact that the I<whole> process is represented here. Once you converted your project to po4a, only the right part of the graphic is relevant. Note that sgml is taken as example here, but the same remains true for all modules. Each part of the picture will be detailed in the next sections.
fr: Le schéma suivant donne un aperçu du processus mis en oeuvre pour la traduction de documents avec po4a. Ne soyez pas effrayé par son apparente complexité, qui est due au fait que le processus I<complet> y est présenté. Une fois que vous avez converti votre projet à po4a, seule la partie de droite du graphique est utilisée. Remarquez que l'exemple considère le format sgml, mais que tout reste identique avec les autres modules. Chaque partie de la figure sera détaillée dans les sections suivantes.

source: fr.sgml original.sgml ---->--------+------>----------->-------+ | | | | V V { update of original } | | | | | +--<---<--+ V | | | original.new.sgml----->------->----+ V V | | [po4a-gettextize] +--->---->---+ | | | | V | | | | [po4a-updatepo] | | V ^ | V V original.pot | V | | | | fr.po | | | | (fuzzy) | | { translation } | | | | | ^ V V | | | {manual editing} | V V | | | | | | V V | | +--<--- fr.po addendum original.sgml +---->----+---->------->---> (up-to-date) (optional) (up-to-date) | | | v v v +------>-----+------<------+ | v [po4a-translate] | V fr.sgml (up-to-date)
fr: fr.sgml original.sgml ---->--------+------>----------->-------+ | | | | V V { mise à jour de l'original } | | | | | +--<---<--+ V | | | original.new.sgml----->------->----+ V V | | [po4a-gettextize] +--->---->---+ | | | | V | | | | [po4a-updatepo] | | V ^ | V V original.pot | V | | | | fr.po | | | | (approximé) | | { traduction } | | | | | ^ V V | | | {édition manuelle} | V V | | | | | | V V | | +--<--- fr.po addendum original.sgml +---->----+---->------->---> (à jour) (optionnel) (à jour) | | | v v v +------>-----+------<------+ | v [po4a-translate] | V fr.sgml (à jour)

source: On the left part, the conversion of a translation not using po4a to this system is shown. On the top of the right part, the action of the original author is depicted (updating the documentation). The middle of the right part is where the automatic actions of po4a are depicted. The new material are extracted, and compared against the exiting translation. Parts which didn't change are found, and previous translation is used. Parts which where partially modified are also connected to the previous translation, but with a specific marker indicating that the translation must be updated. The bottom of the figure shows how a formatted document is built.
fr: La partie gauche illustre la conversion d'une traduction n'utilisant pas po4a. En haut de la partie droite est présenté ce qui est du ressort de l'auteur du document d'origine (la mise à jour de la documentation). Au milieu de la partie de droite se trouve la partie automatisée par po4a. Les nouvelles chaînes sont extraites et comparées avec la traduction existante. Pour celles qui n'ont pas changé, la traduction précédente est utilisée. Celles qui ont été en partie modifiées sont également associées à leur ancienne traduction, mais avec un marquage spécifique indiquant que la traduction doit être mise à jour. La partie du bas indique comment le document formaté est construit.

source: Actually, as a translator, the only manual operation you have to do is the part marked {manual editing}. Yeah, I'm sorry, but po4a helps you translate. It does not translate anything for you...
fr: En fait, en tant que traducteur, la seule opération manuelle consiste en l'étape indiquée par {édition manuelle}. En effet, nous nous en excusons, po4a aide à la traduction, mais il ne traduit rien pour vous...

source: This section presents the needed steps required to begin a new translation with po4a. The refinements involved in converting an existing project to this system are detailed in the relevant section.
fr: Cette section présente les étapes nécessaires pour débuter une nouvelle traduction avec po4a. Les modifications à appliquer pour la conversion d'un projet existant sont détaillées dans la section correspondante.

source: To begin a new translation using po4a, you have to do the following steps:
fr: Voici les étapes permettant de commencer une traduction avec S<po4a :>

source: Extract the text which have to be translated from the original document into a new pot file (the gettext format). For that, use the I<po4a-gettextize> program that way:
fr: Extraction du texte du document d'origine qui doit être traduit dans un nouveau fichier pot (le format utilisé par gettext). Pour ceci, utilisez I<po4a-gettextize> de cette S<façon :>
