Repository: TheShellLand/crossover-source
Catalog: po4a/po/pod/*.po
Languages: fr

source: In theory, it would be possible to detect the problem, and resynchronize the files afterward (just like diff does). But what we should do of the few strings before desynchronizations is not clear, and it would produce bad results some times. That's why the current implementation don't try to resynchronize anything and verbosely fail when something goes wrong, requiring manual modification of files to fix the problem.
fr: En théorie, il devrait être possible de détecter le problème, puis de resynchroniser les fichiers par la suite (comme le fait diff). Mais il est alors difficile de savoir quoi faire des chaînes précédant la désynchronisation, et le résultat pourrait parfois ne pas être bon. C'est pourquoi l'implémentation actuelle ne resynchronise rien et échoue avec un message d'erreur complet quand quelque chose se passe mal, indiquant qu'une modification manuelle des fichiers est nécessaire pour corriger le problème.

source: Even with these precautions, things can go wrong very easily here. That's why all translations guessed this way are marked fuzzy to make sure that the translator review and check them.
fr: Même avec ces précautions, des erreurs peuvent survenir. C'est la raison pour laquelle toutes les traductions trouvées de cette façon sont marquées S<« fuzzy »>, pour s'assurer que le traducteur les relira et vérifiera.

source: Addendum: How does it work?
fr: Fonctionnement d'un Addendum

source: Well, that's pretty easy here. The translated document is not written directly to disk, but kept in memory until all the addenda are applied. The algorithms involved here are rather straightforward. We look for a line matching the position regexp, and insert the addendum before it if we're in mode=before. If not, we search for the next line matching the boundary and insert the addendum after this line if it's an C<endboundary> or before this line if it's a C<beginboundary>.
fr: Bien, il n'y a rien de bien compliqué ici. La traduction n'est pas directement écrite sur le disque, mais est conservée en mémoire jusqu'à ce que tous les addenda soient ajoutés. Les algorithmes utilisés sont assez simples. Une ligne correspondant à l'expression rationnelle de la position est recherchée, et l'addendum est ajouté juste avant si mode=before. Sinon, la première ligne trouvée à partir de cette position correspondant à l'expression rationnelle donnée par le champ boundary est recherchée et l'addendum est inséré juste après cette ligne s'il s'agit d'un C<endboundary> ou juste avant s'il s'agit d'un C<beginboundary>.

source: Why to translate each paragraph separately?
fr: Pourquoi traduire chaque paragraphe S<séparément ?>

source: Yes, in po4a, each paragraph is translated separately (in fact, each module decides this, but all existing modules do so, and yours should also). There are two main advantages to this approach:
fr: En effet, avec po4a, tous les paragraphes sont traduits séparément (en fait, c'est au choix de chaque module, mais tous les modules existants font ainsi, et les vôtres devraient également). Il y a deux avantages principaux à cette S<approche :>

source: When the technical parts of the document are hidden from the scene, the translator can't mess with them. The fewer markers we present to the translator the less error he can do.
fr: Quand les parties techniques du document sont masquées, le traducteur ne peut pas faire de bêtises avec. Moins nous présentons de marqueurs au traducteur, moins il pourra faire d'erreurs.

source: Cutting the document helps in isolating the changes to the original document. When the original is modified, finding what parts of the translation need to be updated is eased by this process.
fr: Découper le document aide à isoler les changements apparaissant dans le document original. Lorsque l'original est modifié, la mise à jour des parties modifiées est plus facile.

source: Even with these advantages, some people don't like the idea of translating each paragraph separately. Here are some of the answers I can give to their fear:
fr: Même avec ces avantages, certains n'aiment pas l'idée de traduire chaque paragraphe séparément. Voici quelques réponses à leurs S<inquiétudes :>

source: This approach proved successfully in the KDE project and allows people there to produce the biggest corpus of translated and up to date documentation I know.
fr: Cette approche a été couronnée de succès dans le cadre du projet KDE et a permis de produire la plus grosse documentation traduite et mise à jour à notre connaissance.

source: The translators can still use the context to translate, since the strings in the po file are in the same order than in the original document. Translating sequentially is thus rather comparable whether you use po4a or not. And in any case, the best way to get the context remains to convert the document to a printable format since the text formatting ones are not really readable, IMHO.
fr: Les traducteurs peuvent toujours utiliser le contexte pour traduire, puisque les chaînes du fichier po se trouvent dans le même ordre que dans le document original. La traduction séquentielle est donc relativement comparable qu'elle soit faite avec ou sans po4a. Et dans tous les cas, la meilleure façon reste de convertir le document dans un format imprimable puisque les indications de formatage ne sont pas vraiment lisibles.

source: This approach is the one used by professional translators. I agree, that they have somewhat different goals than open-source translators. The maintenance is for example often less critical to them since the content changes rarely.
fr: C'est l'approche utilisée par les traducteurs professionnels. Même si je l'admets, leurs buts peuvent être différents des traducteurs de logiciels à source ouvert. La maintenance étant par exemple souvent moins critique puisque le contenu change rarement.

source: Why not to split on sentence level (or smaller)?
fr: Pourquoi ne pas découper au niveau des phrases (ou à un niveau plus S<petit) ?>

source: Professional translator tools sometimes split the document at the sentence level in order to maximize the reusability of previous translations and speed up their process. The problem is that the same sentence may have several translations, depending on the context.
fr: Les outils des traducteurs professionnels découpent parfois les documents au niveau des phrases, de façon à maximiser la réutilisation de traductions précédentes et à accélérer leur travail. Le problème est qu'une même phrase peut avoir plusieurs traductions en fonction du contexte.

source: Paragraphs are by definition longer than sentences. It will hopefully ensure that having the same paragraph in two documents will have the same meaning (and translation), regardless of the context in each case.
fr: Les paragraphes sont par définition plus longs que les phrases. Cela permet la plupart du temps d'assurer que deux paragraphes dans deux documents différents auront le même sens (et la même traduction), indépendamment du contexte.

source: Splitting on smaller parts than the sentence would be B<very bad>. It would be a bit long to explain why here, but interested reader can refer to the L<Locale::Maketext::TPJ13(3pm)|Locale::Maketext::TPJ13(3pm)> man page (which comes with the Perl documentation), for example. To make short, each language has its specific syntactic rules, and there is no way to build sentences by aggregating parts of sentences working for all existing languages (or even for the 5 of the 10 most spoken ones, or even less).
fr: Un découpage à un niveau encore plus petit qu'une phrase pourrait être B<très gênant>. Ce serait un peu long d'expliquer pourquoi ici, mais les lecteurs intéressés pourront par exemple consulter la page de manuel L<Locale::Maketext::TPJ13(3pm)|Locale::Maketext::TPJ13(3pm)> (qui est fournie avec la documentation de Perl). Pour faire court, chaque langue a ses propres règles syntaxiques, et il n'y a aucun moyen de construire des phrases à partir de morceaux de phrases pour toutes les langues existantes (ou pour les 5 à 10 langues les plus parlées, et même moins).

source: Why not put the original as comment along with translation (or other way)?
fr: Pourquoi ne pas mettre la version originelle en commentaire avec la S<traduction ?>

source: At the first glance, gettext don't seem to be adapted to all kind of translations. For example, it didn't seemed adapted to debconf, the interface all Debian packages use for their interaction with the user during installation. In that case, the texts to translate were pretty short (a dozen of line for each package), and it was difficult to put the translation in a specialized file since it has to be available before the package installation.
fr: À première vue, gettext ne semble pas adapté à tous les types de traduction. Par exemple, il ne semblait pas adapté à debconf, l'interface que tous les paquets Debian utilisent pour l'interaction avec l'utilisateur pendant l'installation. Dans ce cas, les textes à traduire étaient assez courts (une dizaine de lignes pour chaque fichier), et il était difficile de placer la traduction dans un fichier séparé parce qu'il doit être disponible avant l'installation du paquet.

source: That's why the debconf developer decided to implement another solution, where translations are be placed in the same file than the original. This is rather appealing. One would even want to do this for xml, for example. It would look like that:
fr: C'est pourquoi les concepteurs de debconf ont décidé d'implémenter une autre solution, plaçant les traductions dans le même fichier que l'original. C'est une solution plutôt séduisante. Certains voudront également faire ainsi pour les fichiers xml, par exemple. Voici à quoi cela S<ressemblerait :>

source: But it was so problematic that a po-based approach is now used. Only the original can be edited in the file, and the translations must take place in po files extracted from the master template (and placed back at package compilation time). The old system was deprecated because of several issues:
fr: Mais cette solution a été si problématique que l'approche basée sur po est désormais utilisée. Seul l'original peut être édité dans le fichier, et les traductions sont placées dans des fichiers po générés à partir du modèle maître (et replacés au cours de la compilation). L'ancien système a été abandonné à cause de plusieurs S<problèmes :>

source: * maintenance problems
fr: * problèmes de maintenance

source: If several translators provide a patch at the same time, it gets hard to merge them together.
fr: Si plusieurs traducteurs fournissent une rustine (patch) au même moment, il est difficile de les appliquer ensemble.

source: How will you detect changes to the original, which need to be applied to the translations? In order to use diff, you have to note which version of the original you translated. I.e., you need a po file in your file ;)
fr: Comment détecter les modifications dans l'original qui doivent être appliquées à une S<traduction ?> Pour pouvoir utiliser diff, il faut noter la version du document original traduit. C'est-à-dire qu'il faut un fichier po dans le S<fichier ;)>

source: * encoding problems
fr: * problèmes d'encodage

source: This solution is viable when only European languages are involved, but the introduction of Korean, Russian and/or Arab really complicate the picture. UTF could be a solution, but there are still some problems with it.
fr: Cette solution n'est envisageable que quand seules des langues européennes sont impliquées, mais la traduction pour le coréen, le russe ou l'arabe peuvent compliquer la situation. UTF peut être une solution, mais il y a également des problèmes avec.

source: Moreover, such problems are hard to detect (i.e., only Korean readers will detect that the encoding of Korean is broken [because of the Russian translator])
fr: De plus, ces problèmes sont difficiles à détecter (c.-à-d. que seules les personnes capables de lire le coréen pourront s'apercevoir que l'encodage pour le coréen est défectueux [ce qui aurait été causé par un traducteur russe]).

source: gettext solves all those problems together.
fr: gettext résout tous ces problèmes.

source: But gettext wasn't designed for that use!
fr: Mais gettext n'a pas été conçu pour faire S<ça !>

source: That's true, but until now nobody came with a better solution. The only known alternative is manual translation, will all the maintenance issues.
fr: C'est vrai, mais à ce jour, personne n'a apporté de meilleure solution. La seule solution alternative est la traduction manuelle, avec tous les problèmes de maintenance qu'elle comporte.

source: What about the other translation tools for documentation using gettext?
fr: Quant est-il des autres outils de traduction de documentation utilisant S<gettext ?>

source: As far as I know, there are only two of them:
fr: Il n'y en à notre connaissance que S<deux :>

source: This is the tool developed by KDE people to handle DocBook XML. AFAIK, it was the first program to extract strings to translate from documentation to po files, and inject them back after translation.
fr: C'est l'outil développé au sein du projet KDE pour gérer les XML DocBook. C'est à notre connaissance le premier programme qui a extrait des chaînes à traduire d'une documentation pour les mettre dans un fichier po, et les réinjecter ensuite dans le document après la traduction.

source: It can only handle XML, and only a particular DTD. I'm quite unhappy with the handling of lists, which end in one big msgid. When the list become big, the chunk becomes harder to shallow.
fr: Il ne peut gérer que le format XML, avec un DTD particulier. Je n'aime pas beaucoup la façon dont les listes sont S<gérées :> elles sont rassemblées en un seul gros msgid. Lorsque la liste est de taille importante, les éléments sont assez durs à gérer.

source: This program done by Denis Barbier is a sort of precursor of the po4a sgml module, which more or less deprecates it. As the name says, it handles only the debiandoc dtd, which is more or less a deprecated dtd.
fr: Ce programme écrit par Denis Barbier est un précurseur du module sgml de po4a, qui le remplace plus ou moins. Comme son nom l'indique, il ne gère que le DTD debiandoc, qui est en voie d'extinction.

source: The main advantages of po4a over them are the ease of extra content addition (which is even worse there) and the ability to achieve gettextization.
fr: Le principal avantage de po4a par rapport à eux est la facilité d'ajouter du contenu additionnel (ce qui est encore plus difficile avec ces outils) et la possibilité de faire une gettextization.

source: Educating developers about translation
fr: Éduquer les développeurs au problème des traductions

source: When you try to translate documentation or programs, you face three kinds of problems; linguistics (not everybody speaks two languages), technical (that's why po4a exists) and relational/human. Not all developers understand the necessity of translating stuff. Even when good willed, they may ignore how to ease the work of translators. To help with that, po4a comes with lot of documentation which can be referred to.
fr: Lors de la traduction de documentations ou de programmes, trois types de difficultés sont S<rencontrés ;> des problèmes linguistiques (tout le monde ne parle pas deux langues), des problèmes techniques (la raison d'être de po4a) et des problèmes de type relationnel et humain. Tous les développeurs ne voient pas la nécessité de réaliser des traductions. Même avec la meilleure volonté, ils peuvent aussi ignorer comment faciliter le travail des traducteurs. C'est pour cela que po4a fournit une bonne quantité de documentation que vous pouvez leur indiquer.

source: Another important point is that each translated file begins with a short comment indicating what the file is, how to use it. This should help the poor developers flooded with tons of files in different languages they hardly speak, and help them dealing correctly with it.
fr: Un autre point important est que chaque fichier traduit contient un petit commentaire indiquant ce qu'est le fichier et comment l'utiliser. Ceci devrait aider les pauvres développeurs inondés de tonnes de fichiers contenant les traductions pour des langues qu'ils ne parlent quasiment pas, et qui devrait les aider à gérer ces fichiers correctement.

source: In the po4a project, translated documents are not source files anymore. Since sgml files are habitually source files, it's an easy mistake. That's why all files present this header:
fr: Dans le projet po4a, les fichiers traduits ne sont plus des fichiers source. Comme les fichiers sgml sont d'habitude des fichiers source, ceci peut être déroutant. C'est pourquoi tous les fichiers contiennent un en-tête similaire à S<celui-ci :>

source: Likewise, gettext's regular po files only need to be copied to the po/ directory. But B<this is not the case of the ones manipulated by po4a>. The major risk here is that a developer erases the existing translation of his program with the translation of his documentation. (Both of them can't be stored in the same po file, because the program needs to install its translation as an mo file while the documentation only uses its translation at compile time). That's why the po files produced by the po-debiandoc module contain the following header:
fr: De la même façon, les fichiers po usuels n'ont qu'à être copiés dans le répertoire po/. Mais B<ce n'est pas le cas de ceux manipulés par po4a>. Le principal risque étant que le développeur écrase la traduction existante de son programme avec la traduction de sa documentation. (Les deux ne peuvent pas être stockées dans le même fichier po parce que le programme doit installer sa traduction en tant que fichier mo et que la documentation n'a besoin de la traduction qu'au moment de la compilation). C'est pourquoi les fichiers po créés par le module po-debiandoc contient l'en-tête S<suivant :>

source: SUMMARY of the advantages of the gettext based approach
fr: RÉSUMÉ des avantages de l'approche basée sur gettext

source: The translations are not stored along with the original, which makes it possible to detect if translations become out of date.
fr: Les traductions ne sont pas stockées indépendamment de l'original, ce qui rend possible la détection des parties à mettre à jour.

source: The translations are stored in separate files from each other, which prevents translators of different languages from interfering, both when submitting their patch and at the file encoding level.
fr: Les traductions sont stockées dans des fichiers différents pour chaque langue, ce qui évite les interférences entre traducteurs. Que ce soit pour la soumission de rustines ou pour le choix d'un encodage.

source: It is based internally on C<gettext> (but C<po4a> offers a very simple interface so that you don't need to understand the internals to use it). That way, we don't have to re-implement the wheel, and because of their wide use, we can think that these tools are more or less bug free.
fr: En interne, tout est basé sur C<gettext> (mais C<po4a> offre une interface simple qui ne nécessite pas de comprendre comment ça marche en interne pour pouvoir l'utiliser). Ce qui permet de ne pas réinventer la roue, et du fait de leur utilisation importante, nous pouvons supposer qu'ils ont peu ou pas de bogue.

source: Nothing changed for the end-user (beside the fact translations will hopefully be better maintained :). The resulting documentation file distributed is exactly the same.
fr: Pour l'utilisateur final, rien ne change (à part que les documentations seront probablement mieux S<maintenues :)>. La documentation distribuée reste la même.

source: No need for translators to learn a new file syntax and their favorite po file editor (like emacs' po mode, kbabel or gtranslator) will work just fine.
fr: Il n'est pas nécessaire pour les traducteurs d'apprendre une nouvelle syntaxe et leur éditeur de fichier po préféré (qui peut être le mode po d'emacs, kbabel ou gtranslator) sera parfait.

source: Gettext offers a simple way to get statistics about what is done, what should be reviewed and updated, and what is still to do. Some example can be found at those addresses:
fr: Gettext permet d'obtenir facilement des statistiques sur ce qui a été fait, ce qui doit être revu et mis à jour, et sur ce qu'il reste à faire. Vous trouverez des exemples à ces S<adresses :>

source: But everything isn't green, and this approach also has some disadvantages we have to deal with.
fr: Mais tout n'est pas rose, et cette approche a aussi quelques désavantages que nous devons gérer.

source: Addenda are... strange at the first glance.
fr: Les addenda sont ... surprenants au premier abord.

source: You can't adapt the translated text to your preferences, like splitting a paragraph here, and joining two other ones there. But in some sense, if there is an issue with the original, it should be reported as a bug anyway.
fr: Il n'est pas possible d'adapter le texte traduit à votre goût, comme de décomposer ou recomposer des paragraphes. Mais d'un autre côté, s'il s'agit d'un problème dans le document original, celui-ci doit être signalé de toute façon.

source: Even with an easy interface, it remains a new tool people have to learn.
fr: Même s'il a une interface simple, il reste un nouvel outil qu'il faudra apprendre à maîtriser.

source: One of my dreams would be to integrate somehow po4a to gtranslator or kbabel. When an sgml file is opened, the strings are automatically extracted. When it's saved a translated sgml file can be written to disk. If we manage to do an MS Word (TM) module (or at least RTF) professional translators may even use it.
fr: Un de mes rêves serait d'intégrer po4a à gtranslator ou kbabel. Lorsqu'un fichier serait ouvert, ses chaînes seraient extraites automatiquement. Lors de l'enregistrement, le fichier sgml traduit serait écrit sur le disque. Si nous arrivons à faire un module pour MS Word (TM) (ou au moins pour le format RTF), des traducteurs professionnels pourraient même l'utiliser.

source: Known bugs and feature requests
fr: Bogues connus et demandes d'évolutions

source: The biggest issue (besides missing modules) is the encoding handling. Adding a UTF8 perl pragma and then recoding the strings on output is the way to go, but it's not done yet.
fr: Le plus gros problème (à part les modules manquants) est la gestion de l'encodage. Ajouter un pragma perl UTF8, puis recoder les chaînes en sortie est le chemin envisagé, mais ce n'est pas encore fait.

source: We would also like to factorise some code (about file insertion) of the sgml module back into the TransTractor so that all modules can benefit from this, but this is not user visible.
fr: Nous aimerions également factoriser certaines parties de code (concernant l'injection de fichier) du module sgml dans le TransTractor de façon à ce que tous les modules puissent en profiter. Mais ceci n'est pas visible pour les utilisateurs.

source: AUTHORS
fr: AUTEURS

source: Locale::Po4a::BibTeX - Convert BibTeX documents from/to PO files
fr: Locale::Po4a::BibTeX - Convertit les bibliographies BibTeX depuis/vers des fichiers PO

source: Locale::Po4a::BibTeX is a module to help the translation of bibliographies in the BibTeX format into other [human] languages.
fr: Locale::Po4a::BibTeX est un module permettant d'aider la traduction de bibliographies BibTeX dans d'autres langues.

source: OPTIONS ACCEPTED BY THIS MODULE
fr: OPTIONS ACCEPTÉES PAR CE MODULE

source: NONE.
fr: AUCUNE.

source: STATUS OF THIS MODULE
fr: ÉTAT DE CE MODULE

source: It is a very simple module, but still young.
fr: C'est un module très simple, mais encore jeune.

source: COPYRIGHT AND LICENSE
fr: COPYRIGHT ET LICENCE
