Repository: TheShellLand/crossover-source
Catalog: po4a/po/pod/*.po
Languages: fr

source: Comments in this files are noted by the char '#'. It comments everything until the end of the line. Lines can be continued by escaping the end of line. All non blank lines must begin with a [] command, followed by its arguments. (sound difficult said that way, but it is rather easy, I hope ;)
fr: Des commentaires peuvent être ajoutés à ce fichier avec le caractère S<« # »>. Tout ce qui suit ce caractère sur une ligne est considéré comme un commentaire. Les lignes peuvent se poursuivre en ajoutant un caractère d'échappement à la fin de la ligne. Toute ligne non vide doit débuter par une commande entre crochets, suivie de ses paramètres. (Ça peut paraître difficile à première vue, mais c'est en fait assez simple, enfin je S<l'espère ;)>

source: Specifying the template languages
fr: Spécifier un modèle pour les différentes langues

source: This is an optional command that can simplify the whole config file, and will make it more scalable. You have to specify a list of the languages in which you want to translate the documents. This is as simple as:
fr: C'est une commande optionnelle qui permet de simplifier le fichier de configuration lorsqu'il est utilisé pour de nombreux langages. Il vous suffit de spécifier les langues vers lesquelles vous voulez traduire les documents, ce qui se fait aussi simplement S<que :>

source: This will enable you to expand $lang to all the specified languages in the rest of the config file.
fr: Ceci vous permettra de développer $lang dans toutes les langues spécifiées pour le reste du fichier de configuration.

source: Specifying the paths to translator inputs
fr: Spécifier les chemins des fichiers des traducteurs

source: First, you have to specify where the translator input files (ie, the files used by translators to do their job) are located. It can be done by such a line:
fr: D'abord, vous devez spécifier où se trouvent les fichiers fournis aux traducteurs. Ceci peut être fait de la façon S<suivante :>

source: The command is thus 'po4a_paths'. The first argument is the path to the pot file to use. All subsequent arguments are of the self-explanationary form:
fr: La commande est donc S<« po4a_paths »>. Le premier paramètre est le chemin du fichier pot à utiliser. Les autres paramètres se comprennent par S<eux-mêmes :>

source: <lang>:<path to the po file for this lang>
fr: <langue>:<chemin vers le fichier po de cette langue>

source: If you've defined the template languages, you can rewrite the line above this way:
fr: Si vous avez défini un modèle pour les langues, vous pouvez écrire la ligne précédente de cette S<façon :>

source: You can also use $master to refer to the document basename. In this case, po4a will use a splitted mode: one POT and one PO (for each language) will be created for each document specified in the po4a configuration file. See the B<Splitted mode> section.
fr: Vous pouvez également utiliser $master pour faire référence au nom (sans le chemin) du document. Dans ce cas, po4a utilisera un mode réparti : un POT et un PO (par langue) sera créé pour chaque document présent dans le fichier de configuration de po4a. Consultez la section B<Mode réparti>.

source: Specifying the documents to translate
fr: Spécification des documents à traduire

source: You now naturally have to specify which documents are translated, their format, and where to put the translations. It can be made by such lines:
fr: Vous devez maintenant spécifier quels documents doivent être traduits, leur format et où placer leurs traductions. Ceci peut être fait par ces S<lignes :>

source: This should be rather self-explanatory also. Note that in the second case, doc/l10n/script.fr.add is an addendum to add to the French version of this document. Please refer to po4a(7) for more information about the addenda.
fr: Ceci est plutôt explicite. Notez que dans le second cas, doc/l10n/script.fr.add est un addendum à ajouter à la version française du document. Veuillez vous référer à po4a(7) pour plus d'informations à propos des addenda.

source: More formally, the format is:
fr: Plus formellement, le format est le S<suivant :>

source: [type: <format>] <master_doc> <lang>:<localized_doc>* add_<lang>:<addendum>*
fr: [type: <format>] <doc_maître> <lang>:<doc_traduit>* add_<lang>:<addendum>*

source: If all the languages had addenda with similar paths, you could also write something like:
fr: Si toutes les langues ont des addenda situés dans des chemins similaires, vous pourriez également écrire quelque chose S<comme :>

source: Specifying options for the modules
fr: Fournir des options aux modules

source: po4a accepts options that will be passed to the module. These options are module specific and are specified with the -o switch.
fr: po4a accepte des options qui seront passées au module. Ces options sont spécifiques au module et sont spécifiées avec l'option -o.

source: If you need a specific option for one of the document you want to translate, you can also specify it in the configuration file. Options are introduced the I<opt> keyword. The argument of the I<opt> keyword must be quoted with double quotes if it contains a space (e.g. if you specify multiple options, or an option with an argument). You can also specify options that will only apply to a specific language by using the opt_I<lang> keyword.
fr: Si vous voulez fournir une option spécifique pour un des documents que vous voulez traduire, vous pouvez la préciser dans le fichier de configuration. Les options sont introduites par le mot clé I<opt>. Les paramètres du mot clé I<opt> doivent être placés entre guillemets s'ils contiennent un espace (par exemple si vous précisez plusieurs options, ou une option avec un paramètre). Vous pouvez également spécifier des options qui ne s'appliqueront qu'à une seule langue en utilisant le mot clé opt_I<lang>.

source: There are some known limitations: you can't specify an argument with a space or a double quote to a module option.
fr: Il y a des limitations S<connues :> vous ne pouvez pas spécifier de paramètre contenant un espace ou des guillemets pour une option d'un module.

source: Here is an example: [type:man] data-05/test2_man.1 $lang:tmp/test2_man.$lang.1 \ opt:"-k 75" opt_it:"-L UTF-8" opt_fr:-v
fr: Voici un exemple : [type:man] data-05/test2_man.1 $lang:tmp/test2_man.$lang.1 \ opt:"-k 75" opt_it:"-L UTF-8" opt_fr:-v

source: Specifying aliases
fr: Spécifier des alias

source: If you must specify the same options for multiple files, you may be interested in defining a module alias. This can be done this way:
fr: Si vous devez fournir les mêmes options pour plusieurs fichiers, vous avez intérêt à définir un alias de module. Ceci se fait de cette S<façon :>

source: This define a module alias named I<test>, based on the I<man> module, with the I<-k 21> apply to all the languages and with I<-o debug=splitargs> applied to the Spanish translation.
fr: Ceci définit un alias de module nommé I<test>, basé sur le module I<man>. L'option I<-k 21> s'appliquera à tous les langues et l'option I<-o debug=splitargs> uniquement à l'espagnol.

source: This module alias can then be use like a regular module:
fr: Cet alias de module peut ensuite être utilisé comme un module S<normal :>

source: Note that you can specify additional options on a per file basis.
fr: Notez que vous pouvez encore ajouter des options fichier par fichier.

source: Splitted mode
fr: Mode réparti

source: The splitted mode is used when $master is used in the [po4a_paths] line.
fr: Le mode réparti est utilisé quand $master est utilisé dans la ligne [po4a_paths].

source: When the splitted mode is used, a temporary big POT and temporary big POs are used. This permits to share the translations between all the POs.
fr: Quand le mode réparti est utilisé, un gros POT et de gros POs sont créés temporairement. Ceci permet de partager les traductions entre tous les POs.

source: If two POs have different translations for the same string, po4a will mark this string as fuzzy and will submit both translations in all the POs which contain this string. Then, when a translator updates the translation and removes the fuzzy tag in one PO, the translation of this string will be updated in every POs automatically.
fr: Si deux POs ont deux traductions différentes pour la même chaîne, po4a marquera cette chaîne comme étant fuzzy et proposera les deux traductions dans tous les POs qui contiennent cette chaîne. Ensuite, lorsqu'un traducteur mettra à jour la chaîne dans un PO et retirera l'étiquette fuzzy, la traduction de cette chaîne sera mise à jour dans tous les POs automatiquement.

source: Minimal threshold for translation percentage to keep (ie, write) the resulting file (default: 80). Ie, by default, files have to be translated at at least 80% to get written.
fr: Seuil à dépasser afin que le fichier généré soit conservé et écrit sur disque (80 par défaut). C'est-à-dire que par défaut, les fichiers générés doivent être traduits à plus de 80% pour être écrits.

source: Show a short help message.
fr: Affiche un message d'aide.

source: Charset of the files containing the documents to translate. Note that all master documents must use the same charset for now. This is a known limitation, and we are working on solving this.
fr: Jeu de caractères des fichiers contenant les documents à traduire. Notez que tous les documents maîtres doivent partager le même jeu de caractères pour l'instant. C'est une limitation S<connue ;> nous travaillons à sa résolution.

source: Charset of the files containing the localized documents. Note that all translated documents will use the same charset for now. This is a known limitation, and we are working on solving this.
fr: Jeu de caractères des fichiers contenant les documents traduits. Notez que tous les documents traduits doivent partager le même jeu de caractères pour l'instant. C'est une limitation S<connue ;> nous travaillons à sa résolution.

source: Charset of the addenda. Note that all the addenda should be in the same charset.
fr: Jeu de caractères des addenda. Notez que tous les ajouts doivent partager le même jeu de caractères.

source: Display the version of the script and exit.
fr: Affiche la version du script et quitte.

source: Increase the verbosity of the program.
fr: Rend le programme plus bavard.

source: Decrease the verbosity of the program.
fr: Rend le programme moins bavard.

source: Output some debugging information.
fr: Affiche quelques informations de débogage.

source: Always generate the POT and PO files, even if po4a considers it is not necessary.
fr: Génère toujours les fichiers POT et PO, même si po4a considère que ce n'est pas nécessaire.

source: The default behavior (when --force is not specified) is the following:
fr: Le comportement par défaut (quand l'option --force n'est pas utilisée) est le S<suivant :>

source: If the POT file already exists, it is regenerated if a master document is more recent. The POT file is also written in a temporary document and po4a verifies that the changes are really needed.
fr: Si le fichier POT existe déjà, il est regénéré si un document maître est plus récent. De plus, le fichier POT est écrit dans un document temporaire, et po4a vérifie que les modifications valent le coût.

source: The PO files are always re-generated based on the POT with B<msgmerge -U>.
fr: Les fichiers PO sont toujours regénéré en fonction du POT avec B<msgmerge -U>.

source: Do not generate the translated documents, only update the POT and PO files.
fr: Ne génère pas les documents traduits, ne met à jour que les fichiers POT et PO.

source: Remove the translated files (implies --no-translations).
fr: Supprime les documents traduits (implique --no-translations).

source: Do not generate the .po~ backup files.
fr: Ne génère pas les fichiers .po~ de sauvegarde.

source: Remove the .po~ backup files (implies --no-backups).
fr: Supprime les fichiers .po~ de sauvegarde (implique --no-backups).

source: --variable I<var>=I<value>
fr: --variable I<var>=I<valeur>

source: Define a variable that will be expanded in the po4a configuration file. Every occurrence of I<$(var)> will be replaced by I<value>. This option can be used multiple times.
fr: Définit une variable dont toutes les occurrences seront remplacées dans le fichier de configuration de po4a. Les occurrences de I<$(var)> seront remplacées par I<valeur>. Cette option peut être utilisée plusieurs fois.

source: SHORTCOMINGS
fr: DÉFAUTS

source: Duplicates some code with the po4a-* programs.
fr: Duplique du code des autres programmes de la suite po4a.

source: Patch welcome ;)
fr: Toute rustine est la bien S<venue ;)>

source: Copyright 2002, 2003, 2004 by SPI, inc.
fr: Copyright 2002, 2003, 2004 par SPI, inc.

source: po4a-gettextize - convert an original file (and its translation) to a po file
fr: po4a-gettextize - convertit un fichier original (et sa traduction) en fichier PO

source: po4a-gettextize -f E<lt>fmtE<gt> -m E<lt>master.docE<gt> [-l E<lt>XX.docE<gt>] -p E<lt>XX.poE<gt>
fr: po4a-gettextize -f E<lt>formatE<gt> -m E<lt>maitre.docE<gt> [-l E<lt>traduction.docE<gt>] -p E<lt>fichier.poE<gt>

source: (XX.po is the output, all others are inputs)
fr: (traduction.doc est le fichier de sortie, tous les autres sont des entrées)

source: The C<po4a-gettextize> script is in charge of converting documentation files to po files. If you start a new translation, C<po4a-gettextize> will extract the translatable strings from the documentation file and write a pot file from it.
fr: Le script C<po4a-gettextize> sert à convertir des fichiers de documentation depuis leur format d'origine vers le format po. Si vous débutez une nouvelle traduction, C<po4a-gettextize> extraira du fichier de documentation les chaînes devant être traduites et les écrira dans un fichier pot.

source: If you already have a translated file, C<po4a-gettextize> will try to extract the translations it contains and put them in place in the written po file. Be warned that very few intelligence is used in this process: the Nth string of the translated file is supposed to be the translation of the Nth string in the original. If it's not the case, you're dead. That's why it is very important that both files share exactly the same structure.
fr: Si vous disposez d'ores et déjà d'une traduction dans le même format que l'original, C<po4a-gettextize> va essayer d'en extraire le contenu pour le placer comme traduction dans le fichier po. Attention, C<po4a-gettextize> ne remplit pas cette tâche très S<intelligemment :> il suppose que la Nième chaîne du fichier traduit est la traduction de la Nième chaîne du fichier original. Si ce n'est pas le cas, vous êtes mort. C'est pourquoi il est très important que les deux fichiers aient exactement la même structure.

source: However, C<po4a-gettextize> will diagnose your death by detecting any desynchronisation between files, and reporting where they occur. In that case, you should edit manually the files to solve the reported disparity. Even if no error were reported, you should check carefully that the generated po file is correct (ie, that each msgstr is the translation of the associated msgid, and not the one before or after).
fr: Cependant, C<po4a-gettextize> détectera sans doute toute désynchronisation entre les fichiers. Si le cas se produit, vous devez éditer les fichiers manuellement afin de corriger le problème. Même si aucune erreur n'a été signalée, vous devriez soigneusement vérifier que le fichier po généré est valide (c'est-à-dire que chaque msgstr est bien la traduction du msgid auquel il est associé, et non du précédent ou du suivant).

source: Even if the script manages to do its job without any apparent problem, it still marks all extracted translations as fuzzy, to make sure that the translator will have a look at them, and detect any remaining problem.
fr: Même si le script parvient à remplir sa tâche sans problème apparent, il marque toutes les chaînes extraites comme S<« fuzzy »> (approximatives), pour s'assurer que le traducteur les vérifiera et détectera les éventuels problèmes restants.

source: If the master document has non-ascii characters, the new generated po file will be in utf-8, in order to allow non-standard characters in a culture independent way. Else (if the master document is completely in ascii), the generated po will use the encoding of the translated input document.
fr: Si le document maître contient des caractères non ASCII, il convertit les fichiers po en utf-8 (si ce n'est pas déjà le cas), de façon à autoriser les caractères non standard en fonction des paramètres régionaux. Sinon (si le document maître ne contient que des caractères ASCII), le fichier po généré utilisera l'encodage du document traduit donné en entrée.

source: Format of the documentation you want to handle. Use the --help-format option to see the list of available formats.
fr: Type de format de la documentation que vous souhaitez traiter. Utilisez l'option --help-format pour afficher la liste des formats disponibles.

source: File containing the master document to translate. You can use this option multiple times if you want to gettextize multiple documents.
fr: Fichier contenant le document maître à traduire. Vous pouvez utiliser cette option plusieurs fois si vous voulez gettextizer plusieurs documents.

source: Charset of the file containing the document to translate.
fr: Jeu de caractères du fichier contenant les documents à traduire.

source: File containing the localized (translated) document. If you provided multiple master files, you may wish to provide multiple localized file by using this option more than once.
fr: Fichier contenant le document traduit. Si vous fournissez plusieurs fichiers maîtres, vous voudrez sûrement fournir également plusieurs documents traduits en utilisant cette option plusieurs fois.

source: Charset of the file containing the localized document.
fr: Jeu de caractères du fichier contenant le document traduit.

source: File where the message catalog should be written. If not given, the message catalog will be written to the standard output.
fr: Fichier où le catalogue de messages sera écrit. S'il n'est pas spécifié, le catalogue de messages sera écrit sur la sortie standard.

source: Extra option(s) to pass to the format plugin. Specify each option in the 'name=value' format. See the documentation of each plugin for more information about the valid options and their meanings.
fr: Passe une ou des options supplémentaires au greffon de format. Spécifiez chaque option en utilisant le format S<« nom=valeur »>. Veuillez vous référer à la documentation de chaque greffon pour la liste des options valides et leurs significations.

source: List the documentation format understood by po4a.
fr: Énumère les formats de documentations connus de po4a.

source: po4a-normalize - normalize a documentation file by parsing it in po4a, and writing it back
fr: po4a-normalize - Normalise un fichier de documentation en le faisant analyser puis réécrire par po4a

source: po4a-normalize -f E<lt>fmtE<gt> E<lt>master.docE<gt>
fr: po4a-normalize -f E<lt>formatE<gt> E<lt>original.docE<gt>

source: The C<po4a-normalize> script is a debugging tool used to make sure that po4a don't change the document when it's not supposed to. Only use it if you're developing a new module, or if you doubt the sanity of the tools.
fr: Le script C<po4a-normalize> est un outil de débogage permettant de s'assurer que po4a ne modifie pas les documents plus que de raison. Il ne devrait être utile que lors du développement d'un nouveau module ou si vous doutez de la qualité d'un module.

source: The generated document will be written to po4a-normalize.output while the generated po file will be written to po4a-normalize.po. No way to change that ;)
fr: Le document généré est écrit dans po4a-normalize.output tandis que le fichier po généré est écrit dans po4a-normalize.po. Impossible de changer S<ça ;)>

source: po4a-translate - convert a po file back to documentation format
fr: po4a-translate - reconvertit un fichier PO en fichier de documentation

source: po4a-translate -f E<lt>fmtE<gt> -m E<lt>master.docE<gt> -p E<lt>XX.poE<gt> -l E<lt>XX.docE<gt>
fr: po4a-translate -f E<lt>formatE<gt> -m E<lt>maitre.docE<gt> -p E<lt>fichier.poE<gt> -l E<lt>traduction.docE<gt>

source: (XX.doc is the output, all others are inputs)
fr: (traduction.doc est le fichier de sortie, les autres sont des entrées)

source: The C<po4a-translate> script is in charge of converting the translation (which was done in a po file) under the documentation format back. The provided C<po> file should be the translation of the C<pot> file which were produced by po4a-gettextize(1).
fr: Le script C<po4a-translate> sert à reconvertir la traduction (faite dans un fichier po) dans le format d'origine. Le fichier C<po> fourni devrait être la traduction du fichier C<pot> produit par po4a-gettextize(1).

source: Add a file to the resulting file (to put translator's name or a section "About this translation", for example). The first line of the file to insert should be a PO4A header indicating where it should be added (see section I<HOWTO add extra text to translations> in po4a(7)).
fr: Ajoute le contenu d'un fichier dans le résultat (pour ajouter le nom du traducteur ou une section nommée S<« À> propos de cette S<traduction »>, par exemple). La première ligne du fichier à ajouter (l'S<« addendum »>) doit être un en-tête valable indiquant où l'ajout doit avoir lieu (voir la section I<Comment ajouter des choses n'étant pas des traductions> dans po4a(7)).

source: File containing the master document to translate.
fr: Fichier contenant les documents maîtres à traduire.

source: File where the localized (translated) document should be written.
fr: Fichier où sera écrit le document traduit.

source: File from which the message catalog should be read.
fr: Fichier contenant le catalogue de messages à lire.

source: Column at which we should wrap the resulting file.
fr: Nombre de colonnes dans le fichier de sortie.

source: Adding content (beside translations) to generated files
fr: Ajouter du contenu (en plus de la traduction) aux fichiers générés

source: To add some extra content to the generated document beside what you translated (like the name of the translator, or a "about this translation" section), you should use the C<--addendum> option.
fr: Pour ajouter du contenu autre que la traduction aux fichiers générés (comme le nom du traducteur ou une section à propos de la traduction), vous devez utiliser l'option C<--addendum>.

source: The first line of the addendum must be a header indicating where to put it in the document (it can be before or after a given part of the document). The rest of the file will be added verbatim to the resulting file without further processing.
fr: La première ligne de l'addendum doit être un en-tête indiquant où l'ajout doit avoir lieu dans le fichier généré (cela peut être après ou avant une partie donnée du document). Le reste du fichier sera ajouté sans modification dans le fichier généré.

source: Note that if po4a-translate fails to add one of the given files, it discards the whole translation (because the missing file could be the one indicating the author, what would prevent the users to contact him to report bugs in the translation).
fr: Remarquez que si l'ajout de l'un des fichiers échoue, la traduction complète est abandonnée (car le fichier manquant peut être celui indiquant le nom de l'auteur, ce qui empêcherait les utilisateurs de le contacter pour lui signaler des erreurs de traduction)

source: The header has a pretty rigid syntax. For more information on how to use this feature and how it works, please refer to the po4a(7) man page.
fr: Les en-têtes ont une syntaxe relativement rigide. Pour plus d'informations à ce sujet, veuillez vous reporter à la page de manuel po4a(7).
