Repository: TheShellLand/crossover-source
Catalog: po4a/po/pod/*.po
Languages: fr

source: It selects a stricter support of the mdoc format by telling po4a not to translate the 'NAME' section. mdoc pages whose 'NAME' section is translated won't generate any header of footer.
fr: Elle permet de sélectionner une gestion du format mdoc plus stricte, en demandant à po4a de ne pas traduire la section « NAME ». En effet, les pages mdoc dont la section « NAME » est traduite n'auront ni en-tête ni pied de page.

source: According to the groff_mdoc page, the NAME, SYNOPSIS and DESCRIPTION sections are mandatory. There are no known issues with translated SYNOPSIS or DESCRIPTION section, but you can also specify these sections this way: -o mdoc=NAME,SYNOPSIS,DESCRIPTION
fr: D'après la page de manuel groff_mdoc, les sections NAME, SYNOPSIS et DESCRIPTION sont obligatoires. Aucun symptome n'est connu pour les sections SYNOPSIS ou DESCRIPTION traduites, mais vous pouvez les indiquer de cette façon : -o mdoc=NAME,SYNOPSIS,DESCRIPTION

source: This mdoc issue can also be solved with an addendum like this one: PO4A-HEADER:mode=before;position=^.Dd .TH DOCUMENT_TITLE 1 "Month day, year" OS "Section Name"
fr: Ce problème avec les pages mdoc peut aussi être résolu avec un addendum du même type que le suivant : PO4A-HEADER:mode=before;position=^.Dd .TH DOCUMENT_TITLE 1 "Month day, year" OS "Section Name"

source: The following options permit to specify the behavior of a new macro (defined with a .de request), or of a macro not supported by po4a. They take in argument a coma separated list of macros. For example:
fr: Les options suivantes permettent de spécifier le comportement d'une nouvelle macro (définie par une requête .de), ou d'une macro non supportée par po4a. Elles prennent en paramètre une liste de macros séparées par des virgules. Par S<exemple :>

source: Note: if a macro is not supported by po4a and if you consider that it is a standard roff macro, you should submit it to the po4a development team.
fr: S<Note :> si une macro n'est pas supportée par po4a, et si vous considérez qu'il s'agit d'une macro groff standard, vous devriez la soumettre à l'équipe de développement de po4a.

source: B<untranslated> indicates that this macro (at its arguments) don't have to be translated.
fr: B<untranslated> indique que cette macro (et ses paramètres) ne doivent pas être traduits.

source: B<noarg> is like B<untranslated>, except that po4a will verify that no argument is added to this macro.
fr: B<noarg> est comme B<untranslated>, à l'exception que po4a vérifiera qu'aucun paramètre n'est fourni à la macro.

source: B<translate_joined> indicates that po4a must propose to translate the arguments of the macro.
fr: B<translate_joined> indique que po4a doit proposer de traduire les paramètres de la macro.

source: With B<translate_each>, the arguments will also be proposed for the translation, except that each one will be translated separately.
fr: Avec B<translate_each>, les paramètres de po4a seront également proposés à la traduction, mais chacun d'entre eux sera traduit séparément.

source: This option takes in argument a list of coma-separated couples I<begin>:I<end>, where I<begin> and I<end> are commands that delimit the begin and end of a section that should not be rewrapped.
fr: Cette option prend en paramètre une liste de couples I<début>:I<fin> séparés par des virgules, dans lesquels I<début> et I<fin> sont des commandes qui délimitent le début et la fin d'une section qui ne doit pas être remise en forme.

source: Note: no test is done to ensure that an I<end> command matches its I<begin> command; any ending command stop the no_wrap mode. If you have a I<begin> (respectively I<end>) macro that has no I<end> (respectively I<begin>), you can specify an existing I<end> (like fi) or I<begin> (like nf) as a counterpart. These macros (and their arguments) wont be translated.
fr: S<Note :> aucun test n'est effectué pour s'assurer que la commande I<fin> correspond à sa commande I<début>. Toute commande de fin finit le mode d'absence de mise en forme. Si vous avez une macro I<début> (respectivement I<fin>), vous pouvez spécifier une I<fin> existante (comme fi), ou un I<début> existant (comme nf) en contrepartie. Ces macros (et leurs paramètres) ne seront pas traduites.

source: This option specifies a list of coma-separated macros that must not split the current paragraph. The string to translate will then contain I<foo E<lt>.bar baz quxE<gt> quux>, where I<bar> is the command that should be inlined, and I<baz qux> its arguments.
fr: Cette option permet de spécifier une liste de macros séparées par des virgules qui ne doivent pas couper le paragraphe en cours. La chaîne à traduire contiendra alors I<tata E<lt>.tete titi totoE<gt> tutu>, où I<tete> est la commande qui ne doit pas provoquer de coupure.

source: AUTHORING MAN PAGES COMPLIANT WITH PO4A::MAN
fr: ÉCRITURE DE PAGES DE MANUEL COMPATIBLES AVEC PO4A::MAN

source: This module is still very limited, and will always be, because it's not a real nroff interpreter. It would be possible to do a real nroff interpreter, to allow authors to use all the existing macros, or even to define new ones in their pages, but we didn't want to. It would be too difficult, and we thought it wasn't necessary. We do think that if manpages' authors want to see their productions translated, they may have to adapt to ease the work of translators.
fr: Ce module est encore très limité, et le sera probablement toujours, parce qu'il n'est pas un véritable interpréteur nroff. Il devrait être possible de faire un vrai interpréteur nroff, qui permettrait aux auteurs d'utiliser toutes les macros existantes ou même d'en définir de nouvelle dans leurs pages, mais nous n'en avons pas envie. Ce serait trop difficile, et nous ne pensons pas que cela soit nécessaire. Nous pensons que si les auteurs de pages de manuel veulent voir leurs travaux traduits, ils doivent s'adapter pour faciliter le travail des traducteurs.

source: So, the man parser implemented in po4a have some known limitations we are not really inclined to correct, and which will constitute some pitfalls you'll have to avoid if you want to see translators taking care of your documentation.
fr: Il y a donc des limitations connues de l'analyseur de pages de manuel implémenté dans po4a, que nous ne sommes pas prêts à corriger, et qui resteront des difficultés qu'il vous faudra éviter si vous voulez que des traducteurs s'occupent de votre documentation.

source: Don't program in nroff
fr: Ne programmez pas en nroff

source: nroff is a complete programming language, with macro definition, conditionals and so on. Since this parser isn't a fully featured nroff interpreter, it will fail on pages using these facilities (There are about 200 such pages on my box).
fr: nroff est un langage de programmation complet, avec des définitions de macros, des opérations conditionnées, etc. Comme cet analyseur n'est pas un analyseur complet pour nroff, il ne pourra pas gérer les pages utilisant ces possibilités (il y en a environ 200 sur ma machine).

source: Use the plain macro set
fr: Utilisez un jeu de macros simple

source: There are still some macros which are not supported by po4a::man. This is only because I failed to find any documentation about them. Here is the list of unsupported macros used on my box. Note that this list isn't exhaustive since the program fails on the first encountered unsupported macro. If you have any information about some of these macros, I'll happily add support for them. Because of these macros, about 250 pages on my box are inaccessible to po4a::man.
fr: Il y a encore quelques macros qui ne sont pas supportées par po4a::man. La raison à cela est que nous n'arrivons pas à trouver leur documentation. Voici la liste des macros non supportées mais tout de même utilisées sur ma machine. Notez que cette liste n'est pas exhaustive puisque le programme échoue lorsque la première macro non supportée est rencontrée. Si vous trouvez des informations à propos de ces macros, nous ajouterons leur support avec plaisir. Ces macros rendent environ 250 pages non utilisables avec po4a::man.

source: To summarise this section, keep simple, and don't try to be clever while authoring your man pages. A lot of things are possible in nroff, and not supported by this parser. For example, don't try to mess with \c to interrupt the text processing (like 40 pages on my box do). Or, be sure to put the macro arguments on the same line that the macro itself. I know that it's valid in nroff, but would complicate too much the parser to be handled.
fr: Pour résumer cette section, faites simple et n'essayez pas d'être trop astucieux lors de l'écriture de vos pages de manuel. Beaucoup de choses sont possibles en nroff et ne sont pas supportées par cet analyseur. Par exemple, n'essayez pas de jouer avec des \c pour interrompre le traitement du texte (c'est le cas de 40 pages sur ma machine). Aussi, assurez-vous de spécifier les paramètres des macros sur la même ligne que la macro. Même si c'est valable en nroff, cela compliquerait trop l'analyseur pour être géré.

source: Of course, another possibility is to use another format, more translator friendly (like pod using po4a::pod, or one of the xml familly like sgml), but thanks to po4a::man it isn't needed anymore. That being said, if the source format of your documentation is pod, or xml, it may be clever to translate the source format and not this generated one. In most cases, po4a::man will detect generated pages and issue a warning. It will even refuse to process Pod generated pages, because those pages are perfectly handled by po4a::pod, and because their nroff counterpart defines a lot of new macros I didn't want to write support for. On my box, 1432 of the 4323 pages are generated from pod and will be ignored by po4a::man.
fr: Bien sûr, une autre possibilité est d'utiliser un autre format, plus pratique pour les traducteurs (comme pod en utilisant po4a::pod ou un format de la famille XML comme le sgml), mais grâce à po4a::man, ce n'est plus nécessaire. Cela étant dit, si la documentation provient d'une source au format pod ou xml, il serait préférable de traduire le format source et non pas celui généré. Dans la plupart des cas, po4a::man détectera les pages de manuel générées et affichera un avertissement. Il refusera même de traiter les pages générées depuis un format Pod, parce que ces pages sont parfaitement traitées par po4a::pod et parce que leur contrepartie nroff définit beaucoup de nouvelles macros pour lesquelles je ne veux pas écrire de support. Sur ma machine, 1432 des 4323 pages sont générées depuis le format pod et seront ignorées par po4a::man.

source: In most cases, po4a::man will detect the problem and refuse to process the page, issuing an adapted message. In some rare cases, the program will complete without warning, but the output will be wrong. Such cases are called "bugs" ;) If you encounter such case, be sure to report this, along with a fix when possible...
fr: Dans la plupart des cas, po4a::man détectera le problème et refusera de traiter la page, en affichant un message d'avertissement. Dans quelques rares cas, le programme se terminera sans avertissement, mais la sortie sera erronée. Ces cas sont des S<« bogues » ;)> Si vous rencontrez un de ces cas, assurez-vous de le signaler, avec un correctif si possible...

source: This module can be used for most of the existing man pages.
fr: Ce module peut être utilisé avec presque toutes les pages de manuel existantes

source: Some tests are regularly run on Linux boxes:
fr: Des tests sont régulièrement effectués sur une machine Linux :

source: one third of the pages are refused because they were generated from another format supported by po4a (e.g. pod or SGML).
fr: un tiers des pages est refusé parce qu'elles ont été générées à partir d'un autre format supporté par po4a (par exemple pod ou SGML).

source: 10% of the remaining pages are rejected with an error (e.g. a groff macro is not supported).
fr: 10% des pages restantes sont rejetés avec une erreur (par exemple lorsqu'une macro groff n'est pas supportée).

source: Then, less than 1% of the pages are accepted silently by po4a, but with significant issues (i.e. missing words, or new words inserted)
fr: Ensuite, moins d'1% des pages est accepté par po4a, mais présente des erreurs significatives (c'est-à-dire certains mots disparaissent ou des mots sont ajoutés).

source: The other pages are usually handled without differences more important than spacing differences or line rewrapped (font issues in less than 10% of the processed pages).
fr: Les autres pages sont généralement supportées sans problème plus important que des différences d'espacement ou de remise en forme des lignes (également des problèmes de police dans moins de 10% des pages sur lesquelles po4a opère).

source: Copyright 2002, 2003, 2004, 2005, 2006 by SPI, inc.
fr: Copyright 2002, 2003, 2004, 2005, 2006 par SPI, inc.

source: Locale::Po4a::NewsDebian - Convert NEWS.Debian documents from/to PO files
fr: Locale::Po4a::NewsDebian - convertit les documents NEWS.Debian depuis/vers des fichiers PO

source: Locale::Po4a::NewsDebian is a module to help the translation of the NEWS.Debian files into other [human] languages. Those files are where maintainer are supposed to write the important news about their package.
fr: Locale::Po4a::NewsDebian est un module qui permet d'aider à traduire des fichiers NEWS.Debian dans d'autres langues. Les responsables sont supposés écrire dans ces fichiers les nouvelles importantes concernant leur paquet.

source: A finer split of the entries may be preferable (search for /^ */, for example), but this version is more robust and NEWS.Debian entries are not supposed to change that often.
fr: Un découpage plus fin des entrées pourrait être préférable (recherche de /^ */, par exemple), mais cette version est plus robuste et les entrées des fichiers NEWS.Debian ne sont pas supposées changer si souvent.

source: This module is loosely inspired from /usr/lib/dpkg/parsechangelog/debian, which is:
fr: Ce module est vaguement inspiré de /usr/lib/dpkg/parsechangelog/debian, qui est soumis au copyright S<suivant :>

source: Copyright (C) 1996 Ian Jackson. This is free software; see the GNU General Public Licence version 2 or later for copying conditions. There is NO warranty.
fr: Copyright (C) 1996 par Ian Jackson. Ce programme est un logiciel S<libre ;> veuillez consulter la licence publique générale GNU version 2 ou ultérieure pour les conditions de copie. Il n'y a AUCUNE garantie.

source: The adaptation for po4a was done by:
fr: L'adaptation de po4a a été faite S<par :>

source: Copyright (c) 1996 by Ian Jackson. Copyright 2005 by SPI, inc.
fr: Copyright (c) 1996 par Ian Jackson. Copyright 2005 par SPI, inc.

source: Locale::Po4a::Po - po file manipulation module
fr: Locale::Po4a::Po - module de manipulation des fichiers po

source: # Read po file $pofile->read('file.po');
fr: # Lit un fichier po $pofile->read('fichier.po');

source: # Add an entry $pofile->push('msgid' => 'Hello', 'msgstr' => 'bonjour', 'flags' => "wrap", 'reference'=>'file.c:46');
fr: # Ajoute une entrée $pofile->push('msgid' => 'Hello', 'msgstr' => 'bonjour', 'flags' => "wrap", 'reference'=>'file.c:46');

source: # Extract a translation $pofile->gettext("Hello"); # returns 'bonjour'
fr: # Extrait la traduction $pofile->gettext("Hello"); # retourne 'bonjour'

source: # Write back to a file $pofile->write('otherfile.po');
fr: # Écrit le résultat dans un fichier $pofile->write('autrefichier.po');

source: Locale::Po4a::Po is a module that allows you to manipulate message catalogs. You can load and write from/to a file (which extension is often I<po>), you can build new entries on the fly or request for the translation of a string.
fr: Locale::Po4a::Po est un module qui permet de manipuler des catalogues de messages. Vous pouvez lire et écrire dans/depuis un fichier (dont l'extension classique est I<po>), vous pouvez construire de nouvelles entrées ou demander la traduction d'une chaîne.

source: For a more complete description of message catalogs in the po format and their use, please refer to the documentation of the gettext program.
fr: Pour une description plus complète des catalogues de messages dans le format po et leur utilisation, veuillez vous référer à la documentation du programme gettext.

source: This module is part of the PO4A project, which objective is to use po files (designed at origin to ease the translation of program messages) to translate everything, including documentation (man page, info manual), package description, debconf templates, and everything which may benefit from this.
fr: Ce module fait partie du projet po4a, dont l'objectif est d'utiliser les fichiers po (conçus à l'origine pour la traduction des programmes) pour la traduction d'autres formats tels que la documentation (pages de manuel, manuels info), la description des paquets, les questionnaires debconf et toute chose pouvant bénéficier de ces mécanismes.

source: This specifies the reference format. It can be one of 'none' to not produce any reference, 'noline' to not specify the line number, and 'full' to include complete references.
fr: Ceci précise le format des références. Les valeurs valables sont S<« none »> pour ne pas produire de référence, S<« noline »> pour ne pas préciser les numéros de ligne et S<« full »> pour inclure des références complètes.

source: Functions about whole message catalogs
fr: Fonctions à propos du catalogue entier

source: Creates a new message catalog. If an argument is provided, it's the name of a po file we should load.
fr: Crée un nouveau catalogue. Si un paramètre est fourni, il s'agit du nom du fichier po à lire.

source: Reads a po file (which name is given as argument). Previously existing entries in self are not removed, the new ones are added to the end of the catalog.
fr: Lit un fichier po (dont le nom est fourni en paramètre). Les entrées pré-existantes dans self ne sont pas oubliées, et les nouvelles sont ajoutées à la fin du catalogue.

source: Writes the current catalog to the given file.
fr: Écrit le catalogue courant dans le fichier spécifié.

source: Like write, but if the PO or POT file already exists, the object will be written in a temporary file which will be compared with the existing file to check that the update is needed (this avoids to change a POT just to update a line reference or the POT-Creation-Date field).
fr: Comme write, mais si le fichier PO ou POT existe déjà, l'objet sera écrit dans un fichier temporaire qui sera ensuite comparé avec le fichier existant pour vérifier que la mise à jour est nécessaire (ceci permet d'éviter à changer le fichier POT juste pour mettre à jour une référence de ligne ou le champ POT-Creation-Date).

source: This function produces one translated message catalog from two catalogs, an original and a translation. This process is described in L<po4a(7)|po4a.7>, section I<Gettextization: how does it work?>.
fr: Cette fonction produit un catalogue de messages traduits à partir de deux catalogues, l'original et la traduction. Ce processus est décrit dans L<po4a(7)|po4a.7> à la section I<S<Gettextization :> Comment ça S<marche ?>>.

source: This function extracts a catalog from an existing one. Only the entries having a reference in the given file will be placed in the resulting catalog.
fr: Cette fonction extrait un catalogue d'un autre. Seules les entrées ayant une référence dans le fichier donné seront placées dans le catalogue résultant.

source: This function parses its argument, converts it to a perl function definition, eval this definition and filter the fields for which this function returns true.
fr: Cette fonction analyse son paramètre, le convertit en une définition de fonction Perl, évalue cette définition et filtre les champs pour lesquels cette fonction retourne S<« true »>.

source: I love perl sometimes ;)
fr: J'aime Perl par S<moments ;)>

source: Recodes to utf-8 the po's msgstrs. Does nothing if the charset is not specified in the po file ("CHARSET" value), or if it's already utf-8 or ascii.
fr: Ré-encode les chaînes msgstr du po en UTF-8. Ne fait rien si le jeu de caractères n'est pas spécifié dans le fichier po (la valeur du champ S<« CHARSET »>) ou s'il est déjà en UTF-8 ou ASCII.

source: Functions to use a message catalog for translations
fr: Fonctions pour utiliser un catalogue de messages pour les traductions

source: Request the translation of the string given as argument in the current catalog. The function returns the original (untranslated) string if the string was not found.
fr: Recherche la traduction de la chaîne, fournie en paramètre, dans le catalogue courant. Cette fonction retourne la chaîne originelle (non traduite) si la chaîne cherchée est introuvable.

source: After the string to translate, you can pass a hash of extra arguments. Here are the valid entries:
fr: Après la chaîne à traduire, vous pouvez passer un hachage de paramètres supplémentaires. Voici la liste des valeurs S<valables :>

source: boolean indicating whether we can consider that whitespaces in string are not important. If yes, the function canonizes the string before looking for a translation, and wraps the result.
fr: booléen indiquant si les espaces et retours chariot de la chaîne peuvent être modifiés. Si oui, la fonction utilise une forme canonique de la chaîne lors de la recherche d'une traduction, et ajoute des retours à la ligne.

source: The column at which we should wrap (default: 76).
fr: La colonne à laquelle les retours à la ligne doivent avoir lieu (76 par défaut).

source: Returns statistics about the hit ratio of gettext since the last time that stats_clear() was called. Please note that it's not the same statistics than the one printed by msgfmt --statistic. Here, it's statistics about recent usage of the po file, while msgfmt reports the status of the file. Example of use:
fr: Retourne les statistiques sur le taux de réussite des requêtes de traduction depuis la dernière fois que stats_clear() a été appelé. Notez qu'il ne s'agit pas des statistiques obtenues avec l'option --statistic de msgfmt. Ici, ce sont les statistiques de l'usage récent du fichier tandis que msgfmt indique l'état du fichier. Exemple S<d'utilisation :>

source: [some use of the po file to translate stuff]
fr: [une utilisation quelconque du fichier po pour des traductions]

source: ($percent,$hit,$queries) = $pofile->stats_get(); print "So far, we found translations for $percent\% ($hit of $queries) of strings.\n";
fr: ($percent,$hit,$queries) = $pofile->stats_get(); print "Pour l'instant, $percent\% des traductions cherchées ont été trouvées ($hit parmi $queries).\n";

source: Clears the statistics about gettext hits.
fr: Oublie les statistiques sur la réussite de gettext.

source: Functions to build a message catalog
fr: Fonctions pour construire un catalogue de messages

source: Push a new entry at the end of the current catalog. The arguments should form a hash table. The valid keys are:
fr: Ajoute une nouvelle entrée dans le catalogue courant. Les paramètres doivent être un hachage. Les valeurs de clé valides S<sont :>

source: the string in original language.
fr: la chaîne dans la langue originale.

source: the translation.
fr: la traduction.

source: an indication of where this string was found. Example: file.c:46 (meaning in 'file.c' at line 46). It can be a space-separated list in case of multiple occurrences.
fr: une indication de la localisation de cette chaîne. Par S<exemple :> file.c:46 (ce qui désigne la ligne 46 du fichier file.c). Il peut s'agir d'une liste séparée par des espaces dans le cas d'occurrences multiples.

source: a comment added here manually (by the translators). The format here is free.
fr: un commentaire ajouté manuellement (par le traducteur). Le format est libre.
