Repository: TheShellLand/crossover-source
Catalog: po4a/po/pod/*.po
Languages: fr

source: a comment which was automatically added by the string extraction program. See the I<--add-comments> option of the B<xgettext> program for more information.
fr: un commentaire ajouté automatiquement par le programme d'extraction des chaînes. Veuillez vous référer à l'option I<--add-comments> du programme B<xgettext> pour plus d'informations.

source: space-separated list of all defined flags for this entry.
fr: liste de tous les drapeaux utilisés pour cette entrée (séparés par des espaces).

source: Valid flags are: c-text, python-text, lisp-text, elisp-text, librep-text, smalltalk-text, java-text, awk-text, object-pascal-text, ycp-text, tcl-text, wrap, no-wrap and fuzzy.
fr: Les valeurs valides S<sont :> c-text, python-text, lisp-text, elisp-text, librep-text, smalltalk-text, java-text, awk-text, object-pascal-text, ycp-text, tcl-text, wrap, no-wrap et fuzzy.

source: See the gettext documentation for their meaning.
fr: Voir la documentation de gettext pour leur signification.

source: This is mostly an internal argument: it is used while gettextizing documents. The idea here is to parse both the original and the translation into a po object, and merge them, using one's msgid as msgid and the other's msgid as msgstr. To make sure that things get ok, each msgid in po objects are given a type, based on their structure (like "chapt", "sect1", "p" and so on in docbook). If the types of strings are not the same, that means that both files do not share the same structure, and the process reports an error.
fr: Il s'agit principalement d'un paramètre interne utilisé lors de la gettextisation des documents. Le but est d'analyser à la fois le document d'origine et la traduction sous la forme d'objet po, et de les combiner en utilisant les msgid de l'un comme msgid et les msgid de l'autre comme msgstr. Afin de s'assurer que les choses se déroulent correctement, un type dépendant de son rôle syntaxique dans le document (comme S<« chapt »>, S<« sect1 »>, S<« p »> pour un docbook) est attribué à chaque chaîne. Si deux chaînes sur le point d'être appariées sont de types différents, cela signifie que les deux fichiers ne partagent pas la même structure, et le processus se termine par une erreur.

source: This information is written as automatic comment in the po file since this gives to translators some context about the strings to translate.
fr: Cette information est également reportée dans le fichier po sous forme de commentaire automatique car elle indique le contexte des chaînes à traduire.

source: boolean indicating whether whitespaces can be mangled in cosmetic reformattings. If true, the string is canonized before use.
fr: booléen indiquant si les espaces peuvent être modifiés lors de remises en forme esthétiques. Si vrai, les chaînes sont mises sous forme canonique avant usage.

source: This information is written to the po file using the 'wrap' or 'no-wrap' flag.
fr: Cette information est reportée dans le fichier po grâce aux drapeaux S<« wrap »> (si vrai) et S<« no-wrap »> (sinon).

source: This information is not written to the po file.
fr: Cette information n'est pas reportée dans le fichier po.

source: Miscellaneous functions
fr: Fonctions diverses

source: Returns the number of entries in the catalog (without the header).
fr: Retourne le nombre d'entrées dans le catalogue (sans compter l'en-tête).

source: Returns the number of entries in document. If a string appears multiple times in the document, it will be counted multiple times
fr: Retourne le nombre d'entrées dans le document. Si une chaîne apparaît plusieurs fois dans le document, elle sera comptée plusieurs fois.

source: Returns the msgid of the given number.
fr: Retourne le msgid du numéro fourni.

source: Returns the msgid with the given position in the document.
fr: Retourne le msgid qui a la position donnée dans le document.

source: Returns the character set specified in the po header. If it hasn't been set, it will return "CHARSET".
fr: Retourne le jeu de caractères spécifié dans l'en-tête du po. S'il n'a pas été défini, il retourne S<« CHARSET »>.

source: This sets the character set of the po header to the value specified in its first argument. If you never call this function (and no file with a specified character set is read), the default value is left to "CHARSET". This value doesn't change the behavior of this module, it's just used to fill that field in the header, and to return it in get_charset().
fr: Permet de fixer le jeu de caractères de l'en-tête du po à la valeur fournie dans son premier paramètre. Si vous n'appelez jamais cette fonction (et qu'aucun fichier dont le jeu de caractères est spécifié n'est lu), la valeur par défaut est laissée à S<« CHARSET »>. Cette valeur ne change pas le comportement du module, elle ne sert qu'à remplir la valeur de ce champ dans l'en-tête, et à la retourner avec get_charset().

source: Locale::Po4a::Pod - Convert POD data from/to PO files
fr: Locale::Po4a::Pod - convertit des données POD depuis/vers des fichiers PO

source: # Read POD from STDIN and write to STDOUT. $parser->parse_from_filehandle;
fr: # Lecture dans STDIN et écriture dans STDOUT. $parser->parse_from_filehandle;

source: # Read POD from file.pod and write to file.txt. $parser->parse_from_file ('file.pod', 'file.txt');
fr: # Lecture d'un POD dans file.pod, et écriture dans file.txt. $parser->parse_from_file ('file.pod', 'file.txt');

source: Locale::Po4a::Pod is a module to help the translation of documentation in the POD format (the preferred language for documenting Perl) into other [human] languages.
fr: Locale::Po4a::Pod est un module qui permet d'aider la traduction de documentation au format POD (le langage de préférence pour la documentation Perl) vers d'autres langues.

source: I think that this module is rock stable, and there is only one known bug:
fr: Je pense que ce module est extrêmement stable, et il n'y a qu'un seul problème S<connu :>

source: I have another problem with /usr/lib/perl5/Tk/MainWindow.pod (and some other pages, see below) which contains:
fr: Je rencontre un autre problème avec /usr/lib/perl5/Tk/MainWindow.pod (et certaines autres pages, voir ci-dessous), qui S<contient :>

source: Lack of luck, in the po4a version, this was splited on the space by the wrapping. As result, in the original version, the man contain
fr: Manque de chance, dans la version créée par po4a, c'est découpé par les retours à la ligne. Comme résultat, dans la version d'origine, le manuel S<contenait :>

source: and mine contain
fr: et le mien S<contient :>

source: which is logic since C<foobar> is rewritten "foobar"
fr: Ce qui est logique puisque C<blabla> est converti en S<« blabla »>

source: Complete list of pages having this problem on my box (from 564 pages ; note that it depends on the chosen wrapping column): /usr/lib/perl5/Tk/MainWindow.pod /usr/share/perl/5.8.0/overload.pod /usr/share/perl/5.8.0/pod/perlapi.pod /usr/share/perl/5.8.0/pod/perldelta.pod /usr/share/perl/5.8.0/pod/perlfaq5.pod /usr/share/perl/5.8.0/pod/perlpod.pod /usr/share/perl/5.8.0/pod/perlre.pod /usr/share/perl/5.8.0/pod/perlretut.pod
fr: Voici la liste complète des pages présentant ce problème sur ma machine (pour un total de 564 S<pages ;> notez également que ça dépend du signe de ponctuation S<choisi) :> /usr/lib/perl5/Tk/MainWindow.pod /usr/share/perl/5.8.0/overload.pod /usr/share/perl/5.8.0/pod/perlapi.pod /usr/share/perl/5.8.0/pod/perldelta.pod /usr/share/perl/5.8.0/pod/perlfaq5.pod /usr/share/perl/5.8.0/pod/perlpod.pod /usr/share/perl/5.8.0/pod/perlre.pod /usr/share/perl/5.8.0/pod/perlretut.pod

source: INTERNALS
fr: FONCTIONNEMENT INTERNE

source: As a derived class from Pod::Parser, Locale::Po4a::Pod supports the same methods and interfaces. See L<Pod::Parser> for all the details; briefly, one creates a new parser with C<< Locale::Po4a::Pod->new() >> and then calls either parse_from_filehandle() or parse_from_file().
fr: En tant que classe dérivée de Pod::Parser, Locale::Po4a::Pod comprend les mêmes méthodes et interfaces. Consultez L<Pod::Parser> pour plus de S<détails ;> en bref, on crée un nouvel analyseur avec C<< Locale::Po4a::Pod->new() >> puis on appelle parse_from_filehandle() ou parse_from_file().

source: new() can take options, in the form of key/value pairs, that control the behavior of the parser. The recognized options common to all Pod::Parser children are:
fr: new() accepte des options sous la forme de paires clé/valeur, qui contrôlent le comportement de l'analyseur. Les options communes à tous les dérivés de Pod::Parser S<sont :>

source: If set to a true value, selects an alternate output format that, among other things, uses a different heading style and marks C<=item> entries with a colon in the left margin. Defaults to false.
fr: Lorsqu'elle prend une valeur vraie, elle permet de sélectionner un autre format de sortie qui, entre autres choses, utilise un autre style de titres et d'entrées C<=item> avec un signe deux-points dans la marge de gauche. La valeur par défaut est fausse.

source: If set to a true value, the non-POD parts of the input file will be included in the output. Useful for viewing code documented with POD blocks with the POD rendered and the code left intact.
fr: Lorsqu'elle prend une valeur vraie, elle permet d'inclure dans la sortie les parties non POD du fichier d'entrée. Ceci est utile pour visualiser du code documenté avec des blocs POD en faisant un rendu du POD et en conservant le code intact.

source: The number of spaces to indent regular text, and the default indentation for C<=over> blocks. Defaults to 4.
fr: Le nombre d'espaces à utiliser pour l'indentation du texte normal, et l'indentation pour les blocs C<=over>. La valeur par défaut est 4.

source: If set to a true value, a blank line is printed after a C<=head1> heading. If set to false (the default), no blank line is printed after C<=head1>, although one is still printed after C<=head2>. This is the default because it's the expected formatting for manual pages; if you're formatting arbitrary text documents, setting this to true may result in more pleasing output.
fr: Lorsqu'elle prend une valeur vraie, une ligne blanche est imprimée après les titres C<=head1>. Avec une valeur fausse (par défaut), aucune ligne blanche n'est imprimée après un C<=head1>, même s'il y en a une qui est imprimée après C<=head2>. La valeur par défaut correspond au format attendu pour les pages de S<manuel ;> si vous êtes en train de formater des documents texte arbitraires, une valeur S<« true »> (vrai) pourra résulter en un affichage plus agréable.

source: Sets the quote marks used to surround CE<lt>> text. If the value is a single character, it is used as both the left and right quote; if it is two characters, the first character is used as the left quote and the second as the right quoted; and if it is four characters, the first two are used as the left quote and the second two as the right quote.
fr: Indique la marque de guillemets à utiliser autour du texte entre CE<lt>>. Si cette valeur est un unique caractère, il est utilisé à la fois comme guillemet gauche et S<droit ;> s'il y a deux caractères, le premier est utilisé comme guillemet gauche et le second comme guillemet S<droit ;> s'il y a quatre caractères, les deux premiers sont utilisés comme guillemet gauche et les deux derniers comme guillemets droits.

source: This may also be set to the special value C<none>, in which case no quote marks are added around CE<lt>> text.
fr: Elle peut prendre la valeur spéciale C<none>, auquel cas aucun guillemet n'est ajouté autour du texte entre CE<lt>>.

source: If set to a true value, Locale::Po4a::Pod will assume that each sentence ends in two spaces, and will try to preserve that spacing. If set to false, all consecutive whitespace in non-verbatim paragraphs is compressed into a single space. Defaults to true.
fr: Lorsqu'elle prend la valeur vrai, Locale::Po4a::Pod suppose que chaque phrase se termine par deux espaces, et essayera de conserver ces espaces. Lorsqu'elle prend la valeur faux, tous les espaces consécutifs des paragraphes à ne pas considérer tel quel (S<« non-verbatim »>) sont rassemblés en un seul espace. Par défaut la valeur est vrai.

source: The column at which to wrap text on the right-hand side. Defaults to 76.
fr: La colonne vers laquelle les retours à la ligne sont insérés. La valeur par défaut est 76.

source: Locale::Po4a::Sgml - Convert sgml documents from/to PO files
fr: Locale::Po4a::Sgml - convertit des documents sgml depuis/vers des fichiers PO

source: Locale::Po4a::Sgml is a module to help the translation of documentation in the SGML format into other [human] languages.
fr: Locale::Po4a::Sgml est un module qui permet d'aider la traduction de documentations au format SGML vers d'autres langues.

source: Space separated list of keywords indicating which part you want to debug. Possible values are: tag, generic, entities and refs.
fr: Liste de mots clef séparés par des espaces et indiquant quelles parties vous voulez déboguer. Les valeurs possibles S<sont :> tag, generic, entities et refs.

source: Give more information about what's going on.
fr: Donne plus d'informations sur ce qu'il se passe.

source: Space separated list of extra tags (beside the dtd provided ones) whose content should form an extra msgid.
fr: Liste de balises supplémentaires (en plus de celles fournies par le DTD) séparées par des espaces dont le contenu doit former des msgid additionnels.

source: Space separated list of extra tags (beside the dtd provided ones) containing other tags, some of them being of category 'translate'.
fr: Liste de balises supplémentaires (en plus de celles fournies par le DTD) pouvant contenir d'autres balises, qui peuvent être à traduire (catégorie S<« translate »>).

source: Space separated list of tags which increase the indentation level.
fr: Liste de balises, séparées par des espaces, qui augmentent le niveau d'indentation.

source: The layout within those tags should not be changed. The paragraph won't get wrapped, and no extra indentation space or new line will be added for cosmetic purpose.
fr: Le formatage du texte contenu dans ces balises ne doit pas être modifié. Aucun retour à la ligne n'est ajouté dans les paragraphes et aucun espace pour l'indentation ou nouvelle ligne n'est ajouté pour des raisons cosmétiques.

source: Tags not needing to be closed.
fr: Balises n'ayant pas besoin d'être fermées.

source: Tags ignored and considered as plain char data by po4a. That is to say that they can be part of an msgid. For example, E<lt>bE<gt> is a good candidate for this category since putting it in the translate section would create msgids not being whole sentences, which is bad.
fr: Les balises ignorées et considérées comme étant du texte brut par po4a. C'est-à-dire qu'elles peuvent faire partie d'un msgid. Par exemple, E<lt>bE<gt> est un bon candidat pour cette catégorie puisqu'en les mettant dans la catégorie translate (à traduire), cela aurait eu pour conséquence que des msgid n'auraient pas été des phrases complètes, ce qui n'est pas bien.

source: A space separated list of attributes that need to be translated. You can specify the attributes by their name (for example, "lang"), but you can also prefix it with a tag hierarchy, to specify that this attribute will only be translated when it is into the specified tag. For example: E<lt>bbbE<gt>E<lt>aaaE<gt>lang specifies that the lang attribute will only be translated if it is in an E<lt>aaaE<gt> tag, which is in a E<lt>bbbE<gt> tag. The tag names are actually regular expressions so you can also write things like E<lt>aaa|bbbbE<gt>lang to only translate lang attributes that are in an E<lt>aaaE<gt> or a E<lt>bbbE<gt> tag.
fr: Une liste d'attributs de balises (séparés par des espaces) que vous voulez traduire. Vous pouvez spécifier les attributs par leur nom (par exemple, S<« lang »>), mais vous pouvez aussi les faire précéder d'une hiérarchie de balises pour indiquer que cet attribut ne sera traduit que quand il sera placé à l'intérieur d'une balise. Par S<exemple :> E<lt>bbbE<gt>E<lt>aaaE<gt>lang indique que l'attribut lang ne sera traduit que s'il se trouve dans une balise E<lt>aaaE<gt>, se trouvant elle-même dans une balise E<lt>bbbE<gt>. Le nom des balises est en fait une expression rationnelle, ce qui vous permet de spécifier E<lt>aaa|bbbbE<gt>lang si vous ne voulez traduire que les attributs lang qui se trouvent dans une balise E<lt>aaaE<gt> ou E<lt>bbbE<gt>.

source: A space separated list of attributes for which the translation must be qualified by the attribute name. Note that this setting automatically adds the given attribute into the 'attributes' list too.
fr: Une liste d'attributs séparés par des espaces pour lesquels la traduction doit être qualifiée par le nom d'attribut. Notez que cette option ajoute aussi automatiquement l'attribut donné à la liste d'attributs.

source: Proceed even if the DTD is unknown.
fr: Continue même si le DTD est inconnu.

source: By default, msgids containing only one entity (like '&version;') are skipped for the translator comfort. Activating this option prevents this optimisation. It can be useful if the document contains a construction like "<title>&Aacute;</title>", even if I doubt such things to ever happen...
fr: Par défaut, les msgid qui ne contiennent qu'une entité (comme S<« &version; »>) sont sautés pour le confort du traducteur. Activer cette option arrête cette optimisation. Ceci peut être utile si le document contient une construction telle que S<« <title>&Aacute;</title> »>, même si je doute que ça puisse arriver...

source: Space separated list of entities that won't be inlined. Use this option with caution: it may cause nsgmls (used internally) to add tags and render the output document invalid.
fr: Liste d'entités, séparées par des espaces, qui ne seront pas insérées. Utilisez cette option avec S<précaution :> elle peut forcer nsgmls (qui est utilisé en interne) à ajouter des tags et rendre le document généré non valable.

source: The result is perfect. I.e., the generated documents are exactly the same. But there are still some problems:
fr: Le résultat est parfait. C'est-à-dire que les documents générés sont rigoureusement identiques. Mais il y a encore quelques S<problèmes :>

source: the error output of nsgmls is redirected to /dev/null, which is clearly bad. I don't know how to avoid that.
fr: Les messages d'erreur de nsgmls sont redirigés vers /dev/null, ce qui n'est pas bien, mais je ne sais pas comment éviter cela.

source: The problem is that I have to "protect" the conditional inclusions (ie, the C<E<lt>! [ %foo [> and C<]]E<gt>> stuff) from nsgmls. Otherwise nsgmls eats them, and I don't know how to restore them in the final document. To prevent that, I rewrite them to C<{PO4A-beg-foo}> and C<{PO4A-end}>.
fr: Le problème est que j'ai à S<« protéger »> les inclusions conditionnées (utilisant S<« C<E<lt>! [ %blah [> »> et S<« C<]]E<gt>> »>) de nsgml, parce que dans certains cas, nsgmls les élimine, et je ne sais pas les rétablir dans le document final. Pour empêcher cela, je les récrit dans C<{PO4A-beg-blah}> et C<{PO4A-end}>.

source: The problem with this is that the C<{PO4A-end}> and such I add are valid in the document (not in a E<lt>pE<gt> tag or so).
fr: Le problème avec cela est les C<{PO4A-end}> et autres sont valides dans le document (pas dans une balise E<lt>pE<gt> ou autre).

source: Everything works well with nsgmls's output redirected that way, but it will prevent us from detecting that the document is badly formatted.
fr: Tout marche bien avec cette redirection des messages de nsgmls, mais ceci empêchera de détecter que le document est mal formaté.

source: It does work only with the debiandoc and docbook dtd. Adding support for a new dtd should be very easy. The mechanism is the same for every dtd, you just have to give a list of the existing tags and some of their characteristics.
fr: Ceci ne marche qu'avec les dtd debiandoc et docbook. L'ajout d'un support pour un nouveau dtd doit être très facile. Le mécanisme est le même pour chaque dtd, vous n'avez qu'à donner la liste des balises existantes et certaines de leurs caractéristiques.

source: I agree, this needs some more documentation, but it is still considered as beta, and I hate to document stuff which may/will change.
fr: Je comprend que ceci nécessiterait plus de documentation, mais c'est toujours considéré comme à l'état bêta, et je déteste documenter ce qui risque de/va changer.

source: Warning, support for dtds is quite experimental. I did not read any reference manual to find the definition of every tag. I did add tag definition to the module 'till it works for some documents I found on the net. If your document use more tags than mine, it won't work. But as I said above, fixing that should be quite easy.
fr: Attention, le support des dtd est plutôt expérimental. Je n'ai lu aucun manuel de référence pour trouver la définition de toutes ces balises. J'ai ajouté des définitions de balises au module jusqu'à ce que ça marche pour certains documents trouvés sur internet. Si votre document utilise plus de balises que les miens, ça ne marchera pas. Mais, comme je l'ai dit plus haut, corriger cela doit être assez facile.

source: I did test docbook against the SAG (System Administrator Guide) only, but this document is quite big, and should use most of the docbook specificities.
fr: J'ai testé le format docbook avec le SAG (System Administrator Guide -- Guide de l'Administrateur Système) uniquement, mais comme ce document est assez important, il doit utiliser la plupart des spécificités de docbook.

source: For debiandoc, I tested some of the manuals from the DDP, but not all yet.
fr: Pour le format debiandoc, je l'ai testé avec certains des manuels du DDP, mais pas encore avec tous.

source: In case of file inclusion, string reference of messages in po files (ie, lines like C<#: en/titletoc.sgml:9460>) will be wrong.
fr: En cas d'inclusion d'un fichier, les références des messages du po (c.-à-d., les lignes de la forme C<#: en/titletoc.sgml:9460>) seront erronées.

source: This is because I preprocess the file to protect the conditional inclusion (ie, the C<E<lt>! [ %foo [> and C<]]E<gt>> stuff) and some entities (like &version;) from nsgmls because I want them verbatim to the generated document. For that, I make a temp copy of the input file and do all the changes I want to this before passing it to nsgmls for parsing.
fr: Ceci est dû au fait que j'applique un prétraitement au fichier pour protéger les inclusions conditionnelles (utilisant S<« C<E<lt>! [ %blah [>> et S<« C<]]E<gt>> »>) et quelques entités (comme &version;) de nsgmls parce que je les veux telles quelles dans le document généré. Pour cela, je fait une copie temporaire du fichier d'entrée et effectue toutes les modifications que je veux lui appliquer avant de le passer à nsgmls pour son analyse.

source: So that it works, I replace the entities asking for a file inclusion by the content of the given file (so that I can protect what needs to in subfile also). But nothing is done so far to correct the references (i.e., filename and line number) afterward. I'm not sure what the best thing to do is.
fr: Pour que ça fonctionne, je remplace les entités demandant l'inclusion d'un fichier par le contenu du fichier donné (comme ceci je peux également protéger ce qui doit être dans le sous-fichier). Mais rien n'est fait à présent pour corriger les références (c.-à-d. les noms des fichiers et les numéros de ligne) par la suite. Je ne sais pas ce qui est préférable.

source: This module is an adapted version of sgmlspl (SGML postprocessor for the SGMLS and NSGMLS parsers) which was:
fr: Ce module est une adaptation de sgmlspl (postprocesseur SGML pour les analyseurs SGMLS et NSGMLS), avec le copyright S<suivant :>
