Repository: TheShellLand/crossover-source
Catalog: po4a/po/pod/*.po
Languages: fr

source: Their goal is to allow the translator to add extra content to the document which is not translated from the original document. The most common usage is to add a section about the translation itself, listing contributors and explaining how to report bug against the translation.
fr: Leur but est de permettre au traducteur d'ajouter au document du texte qui ne soit pas une traduction, mais quelque chose de spécifique à la version traduite. De cette façon, ils peuvent ajouter une section indiquant qui a participé à cette traduction ou expliquer comment rapporter des bogues de traduction.

source: Addendum must be provided as a separate file. The first line constitutes a header indicating where in the produced document they should be placed. The rest of the addendum file will be added verbatim at the determined position of the resulting document.
fr: Un addendum est fourni dans un fichier séparé. La première ligne constitue un en-tête indiquant où le texte qu'il contient doit être placé dans le document. Le reste du fichier est ajouté tel quel à cette position dans le document résultant.

source: The header have a pretty rigid syntax: It must begin with the string "PO4A-HEADER:", followed by a semi-colon (;) separated list of "key=value" fields. White spaces ARE important. Note that you cannot use the semi-colon char (;) in the value, and that quoting it doesn't help.
fr: Les en-têtes ont une syntaxe relativement S<rigide :> ils doivent commencer par la chaîne S<« PO4A-HEADER: »>, suivie par une liste de champs de la forme S<« clef=valeur »> séparés par des points-virgules. Les espaces ONT leur importance. Notez qu'il n'est pas possible d'utiliser de point-virgule dans la valeur, même en la plaçant entre des guillemets.

source: Again, it sounds scary, but the examples given below should help you to find how to write the header line you need. To illustrate the discussion, assume we want to add a section called "About this translation" after the "About this document" one.
fr: Encore une fois, ça paraît peut-être effrayant, mais les exemples ci-dessous devraient vous aider à écrire les en-têtes dont vous avez besoin. Supposons que nous voulons ajouter une section S<« À> propos de cette S<traduction »> après la section S<« À> propos de ce S<document »>.

source: Here are the possible header keys:
fr: Voici les différentes clefs d'en-tête S<existantes :>

source: position (mandatory)
fr: position (obligatoire)

source: a regexp. The addendum will be placed near the line matching this regexp. Note that we're speaking about the translated document here, not the original. If more than a line match this expression (or none), the addition will fail. It is indeed better to report an error than inserting the addendum at the wrong location.
fr: une expression rationnelle. L'addendum sera placé près de la ligne correspondant à cette expression rationnelle. Notez qu'il s'agit ici du document traduit, et non pas du document original. Si plus d'une ligne correspond à cette expression (ou si aucune ne correspond), l'ajout échouera. Il est préférable de donner un message d'erreur que d'ajouter l'addendum au mauvais endroit.

source: This line is called I<position point> in the following. The point where the addendum is added is called I<insertion point>. Those two points are near one from another, but not equal. For example, if you want to insert a new section, it is easier to put the I<position point> on the title of the preceding section and explain po4a where the section ends (remember that I<position point> is given by a regexp which should match a unique line).
fr: La ligne est appelée I<point de position> par la suite. L'endroit où est ajouté l'addendum est appelé I<point d'insertion>. Ces deux points sont proches, mais pas identiques. Par exemple, si vous voulez insérer une nouvelle section, il est plus simple de placer le I<point de position> au niveau du titre de la section précédente, et d'expliquer à po4a où se termine la section (souvenez-vous que le I<point de position> doit être donné par une expression rationnelle ne correspondant qu'à une seule ligne.

source: The localization of the I<insertion point> with regard to the I<position point> is controlled by the C<mode>, C<beginboundary> and C<endboundary> fields, as explained below.
fr: La localisation du I<point d'insertion> par rapport au I<point de position> est contrôlée par les champs C<mode>, C<beginboundary> et C<endboundary>, comme expliqué par la suite.

source: In our case, we would have:
fr: Dans notre cas, nous S<aurons :>

source: position=<title>About this document</title>
fr: position=<title>À propos de ce document</title>

source: mode (mandatory)
fr: mode (obligatoire)

source: It can be either the string "before" or "after", specifying the position of the addendum, relative to the I<position point>.
fr: Le mode est soit S<« before »> (avant) soit S<« after »> (après). Il permet de préciser la position de l'addendum par rapport au point d'ancrage.

source: Since we want the new section to be placed below the one we are matching, we have:
fr: Comme nous voulons placer la nouvelle section sous celle qui correspond, nous S<utilisons :>

source: beginboundary (used only when mode=after, and mandatory in that case)
fr: beginboundary (utilisé uniquement avec mode=after, et obligatoire dans ce cas)

source: regexp matching the end of the section after which the addendum goes.
fr: expression rationnelle correspondant à la fin de la section après laquelle l'addendum doit être placé.

source: When mode=after, the I<insertion point> is after the I<position point>, but not directly after! It is placed at the end of the section beginning at the I<position point>, ie after or before the line matched by the C<???boundary> argument, depending on whether you used C<beginboundary> or C<endboundary>.
fr: Lorsque le mode vaut S<« after »> (après), le I<point d'insertion> se trouvera après le I<point de position>, mais pas juste S<après !> Il est placé à la fin de la section qui débute par le I<point de position>, c'est-à-dire après la ligne correspondant à l'expression rationnelle donnée par le champ C<beginboundary> ou avant la ligne correspondant à l'expression rationnelle donnée par le champ C<endboundary>.

source: In our case, we can choose to indicate the end of the section we match by adding:
fr: Dans notre cas, nous pouvons choisir d'indiquer la fin de la section qui doit correspondre en S<ajoutant :>

source: or to indicate the beginning of the next section by indicating:
fr: ou en indiquant le début de la section suivante en S<indiquant :>

source: In both case, our addendum will be placed after the E<lt>/sectionE<gt> and before the E<lt>sectionE<gt>. The first one is better since it will work even if the document gets reorganized.
fr: Dans les deux cas, notre addendum sera placé après S<« E<lt>/sectionE<gt> »> et avant S<« E<lt>sectionE<gt> »>. La première solution est meilleure puisqu'elle fonctionnera toujours, même si le document est réorganisé.

source: Both forms exist because documentation formats are different. In some of them, there is a way to mark the end of a section (just like the C<E<lt>/sectionE<gt>> we just used), while some other don't explicitly mark the end of section (like in nroff). In the former case, you want to make a I<boundary> matching the I<end of a section>, so that the I<insertion point> comes after it. In the latter case, you want to make a I<boundary> matching the I<beginning of next section>, so that the I<insertion point> comes just before it.
fr: Les deux existent parce que les formats des documentations sont différents. Dans certains d'entre eux, il est possible d'indiquer la fin d'une section comme S<« C<E<lt>/sectionE<gt>> »> que nous avons utilisé), et dans d'autres les fins de section ne sont pas spécifiées explicitement (c'est le cas du format nroff). Dans le premier cas, la S<« frontière »> (boundary) est la I<fin de section>, et le I<point d'insertion> vient après. Dans le second cas, la I<frontière> correspond au I<début de la section suivante>, et le I<point d'insertion> vient juste avant.

source: This can seem obscure, but hopefully, the next examples will enlighten you.
fr: Tout ceci peut sembler confus, mais l'exemple suivant devrait vous éclairer.

source: To sum up the example we used so far, in order to add a section called "About this translation" after the "About this document" one in a sgml document, you can use either of those header lines:
fr: Pour résumer l'exemple utilisé, pour ajouter une section appelée S<« À> propos de cette S<traduction »> après la section S<« À> propos de ce S<document »> dans un document sgml, vous pouvez utiliser une de ces lignes d'en-tête.

source: PO4A-HEADER: mode=after; position=About this document; endboundary=</section> PO4A-HEADER: mode=after; position=About this document; beginboundary=<section>
fr: PO4A-HEADER: mode=after; position=À propos de ce document; endboundary=</section> PO4A-HEADER: mode=after; position=À propos de ce document; beginboundary=<section>

source: If you want to add something after the following nroff section:
fr: Si vous voulez ajouter quelque chose après la section nroff S<suivante :>

source: .SH "AUTHORS"
fr: .SH "AUTEURS"

source: you should put a C<position> matching this line, and a C<beginboundary> matching the beginning of the next section (ie C<^\.SH>). The addendum will then be added B<after> the I<position point> and immediately B<before> the first line matching the C<beginboundary>. That is to say:
fr: vous devez utiliser un champ C<position> correspondant à cette ligne, et un champ C<beginboundary> correspondant au début de la section suivante (c'est-à-dire C<^\.SH>). L'addendum sera placé B<après> le I<point de position> et immédiatement B<avant> la première ligne correspondant au champ C<beginboundary>. S<C'est-à-dire :>

source: PO4A-HEADER:mode=after;position=AUTHORS;beginboundary=\.SH
fr: PO4A-HEADER:mode=after;position=AUTEURS;beginboundary=\.SH

source: If you want to add something into a section (like after "Copyright Big Dude") instead of adding a whole section, give a C<position> matching this line, and give a C<beginboundary> matching any line.
fr: Si vous voulez ajouter quelque chose à une section (par exemple après S<« Copyright> S<Tralala »>) au lieu d'ajouter une section entière, vous pouvez fournir une C<position> correspondant à cette ligne, et un champ C<beginboundary> correspondant à n'importe quelle ligne.

source: PO4A-HEADER:mode=after;position=Copyright Big Dude, 2004;beginboundary=^
fr: PO4A-HEADER:mode=afterposition=Copyright Tralala, 2004;beginboundary=^

source: If you want to add something at the end of the document, give a C<position> matching any line of your document (but only one line. Po4a won't proceed if it's not unique), and give an C<endboundary> matching nothing. Don't use simple strings here like "C<EOF>", but prefer which have less chance to be in your document.
fr: Si vous voulez ajouter quelque chose à la fin du document, donnez une position correspondant à n'importe quelle ligne du document (mais à une seule ligne, puisque po4a n'acceptera pas que la position ne corresponde pas à une ligne unique), et donnez un champ C<endboundary> ne correspondant à aucune ligne. N'utilisez pas de chaîne simple, comme S<« FIN »>, mais préférez-en une qui a une chance moindre de se trouver dans votre document.

source: PO4A-HEADER:mode=after;position=<title>About</title>;beginboundary=FakePo4aBoundary
fr: PO4A-HEADER:mode=after;position=<title>Au sujet de...</title>;beginboundary=FausseLimitePo4a

source: In any case, remember that these are regexp. For example, if you want to match the end of a nroff section ending with the line
fr: Dans tous les cas, rappelez-vous qu'il s'agit d'une expression rationnelle. Par exemple, si vous voulez pointer la fin d'une section nroff qui se termine par la S<ligne :>

source: don't use C<.fi> as endboundary, because it will match with "the[ fi]le", which is obviously not what you expect. The correct endboundary in that case is: C<^\.fi$>.
fr: N'utilisez pas C<.fi> comme valeur pour endboundary, parce que cette expression rationnelle correspond également à S<« ce[ fi]chier »>, ce qui n'est évidemment pas ce que vous voulez. La valeur du champ endboundary dans ce cas est C<^\.fi$>.

source: If the addendum doesn't go where you expected, try to pass the -vv argument to the tools, so that they explain you what they do while placing the addendum.
fr: Si l'addendum n'est pas positionné là où vous l'escomptiez, essayez en fournissant l'option -vv aux outils, ce qui vous donnera des indications sur ce qui est fait pour le placement de l'addendum.

source: More detailed example
fr: Voici un exemple plus détaillé.

source: Original document (pod formatted):
fr: Document original (au format S<pod) :>

source: Then, the following addendum will ensure that a section (in French) about the translator is added at the end of the file. (in French, "TRADUCTEUR" means "TRANSLATOR", and "moi" means "me")
fr: Voici maintenant un addendum qui s'assure qu'une section est ajoutée à la fin du fichier pour indiquer le traducteur.

source: In order to put your addendum before the AUTHOR, use the following header:
fr: De façon à placer l'addendum avant l'AUTEUR (section nommée AUTHOR dans le document original), utilisez l'en-tête S<suivant :>

source: This works because the next line matching the beginboundary /^=head1/ after the section "NAME" (translated to "NOM" in French), is the one declaring the authors. So, the addendum will be put between both sections.
fr: Ceci fonctionne parce que la première ligne correspondant à l'expression rationnelle donnée dans le champ beginboundary (/^=head1/) après la section S<« NOM »> (correspondant à la section S<« NAME »> dans le document original), est celle indiquant les auteurs. De cette façon, l'addendum est placé entre les deux sections.

source: The use of po4a proved to be a bit error prone for the users since you have to call two different programs in the right order (po4a-updatepo and then po4a-translate), each of them needing more than 3 arguments. Moreover, it was difficult with this system to use only one po file for all your documents when more than one format was used.
fr: L'utilisation de po4a s'est montrée propice aux erreurs pour les utilisateurs parce que deux programmes doivent être appelés dans le bon ordre (po4a-updatepo puis po4a-translate), chacun d'eux prenant au moins 3 paramètres. De plus, il était difficile avec ce système d'utiliser un seul fichier po pour tous les documents quand plusieurs formats étaient utilisés.

source: The L<po4a(1)> program was designed to solve those difficulties. Once your project is converted to the system, you write a simple configuration file explaining where your translation files are (po and pot), where the original documents are, their formats and where their translations should be placed.
fr: Le programme L<po4a(1)> a été conçu pour répondre à ces difficultés. Une fois que votre projet a été converti à po4a, vous écrivez un petit fichier de configuration indiquant où se trouvent vos fichiers de traduction (les fichiers po et pot), où se trouvent les documents originaux, leurs formats, et où doivent être placées leur traduction.

source: Then, calling po4a(1) on this file ensure that the po files are synchronized against the original document, and that the translated document are generated properly. Of course, you will want to call this program twice: once before editing the po file to update them and once afterward to get completely updated translated document. But you only need to remember one command line.
fr: Ensuite, l'appel de po4a(1) avec ce fichier vérifie que les fichiers po sont synchronisés avec le document original, et que les documents traduits sont générés correctement. Bien sûr, il vous faudra appeler ce programme deux S<fois :> une fois avant l'édition des fichiers po pour les mettre à jour et une autre fois après pour mettre à jour les documents traduits. Mais vous n'aurez qu'à vous rappeler cette commande.

source: How does it work?
fr: Comment ça S<marche ?>

source: What's the big picture here?
fr: Quel est le plan général S<ici ?>

source: The po4a architecture is object oriented (in Perl. Isn't that neat?). The common ancestor to all parser classes is called TransTractor. This strange name comes from the fact that it is at the same time in charge of translating document and extracting strings.
fr: L'architecture po4a est orientée objet (en Perl, n'est-ce pas S<formidable ?>). L'ancêtre commun de tous les classes d'analyseur est appelé Transtractor. Ce nom étrange provient du fait qu'il est à la fois chargé de la traduction et de l'extraction des chaînes du document.

source: More formally, it takes a document to translate plus a po file containing the translations to use as input while producing two separate outputs: Another po file (resulting of the extraction of translatable strings from the input document), and a translated document (with the same structure than the input one, but with all translatable strings replaced with content of the input po). Here is a graphical representation of this:
fr: Plus formellement, il prend un document à traduire et un fichier po contenant les traductions en entrée et produit en sortie deux autres S<fichiers :> un autre fichier po (résultant de l'extraction des chaînes à traduire du document d'entrée), et un document traduit (avec la même structure que le document d'entrée, mais dont toutes les chaînes à traduire ont été remplacées par leur traduction donnée par le po fournit en entrée). Voici une représentation graphique de tout S<ceci :>

source: Input document --\ /---> Output document \ TransTractor:: / (translated) +-->-- parse() --------+ / \ Input po --------/ \---> Output po (extracted)
fr: document entrée --\ /---> document sortie \ TransTractor:: / (traduit) +-->-- parse() --------+ / \ po entrée --------/ \---> po sortie (extrait)

source: This little bone is the core of all the po4a architecture. If you omit the input po and the output document, you get po4a-gettextize. If you provide both input and disregard the output po, you get po4a-translate.
fr: Cette forme d'os est le coeur de l'architecture de po4a. Sans le fichier po en entrée et le document en sortie, cela donne po4a-gettextize. Si vous fournissez les deux entrées et ignorez le po de sortie, vous aurez po4a-translate.

source: TransTractor::parse() is a virtual function implemented by each module. Here is a little example to show you how it works. It parses a list of paragraphs, each of them beginning with <p>.
fr: TransTractor::parse() est une fonction virtuelle implémentée dans chaque module. Voici un petit exemple pour montrer comment elle marche. Cet exemple analyse une liste de paragraphes qui débutent tous par <p>.

source: On line 6, we encounter E<lt>pE<gt> for the second time. That's the signal of the next paragraph. We should thus put the just obtained line back into the original document (line 7) and push the paragraph built so far into the outputs. After removing the leading E<lt>pE<gt> of it on line 9, we push the concatenation of this tag with the translation of the rest of the paragraph.
fr: À la ligne 6, E<lt>pE<gt> est rencontré pour la seconde fois. Cela indique le passage un paragraphe suivant. Nous replaçons donc la ligne, qui vient juste d'être obtenue, dans le document d'origine (ligne 7) et envoyons le paragraphe ainsi construit dans les sorties. Après avoir retiré le E<lt>pE<gt> de tête en ligne 9, nous envoyons la concaténation de cette balise avec la traduction du reste du paragraphe.

source: This translate() function is very cool. It pushes its argument into the output po file (extraction) and returns its translation as found in the input po file (translation). Since it's used as part of the argument of pushline(), this translation lands into the output document.
fr: Cette fonction translate() est très pratique. Elle envoie son paramètre dans le fichier po de sortie (l'extraction) et renvoie sa traduction telle qu'elle a été trouvée dans le fichier po d'entrée (la traduction). Comme elle est utilisée dans le paramètre de pushline(), cette traduction se retrouve dans le document de sortie.

source: Isn't that cool? It is possible to build a complete po4a module in less than 20 lines when the format is simple enough...
fr: N'est-ce pas S<génial ?> Il est possible de construire un module complet pour po4a en moins de 20 lignes, si le format est suffisamment simple...

source: You can learn more about this in L<Locale::Po4a::TransTractor(3pm)|Locale::Po4a::TransTractor(3pm)>.
fr: Vous trouverez plus de détails à ce sujet dans L<Locale::Po4a::TransTractor(3pm)|Locale::Po4a::TransTractor(3pm)>.

source: Gettextization: how does it work?
fr: S<Gettextization :> Comment ça S<marche ?>

source: The idea here is to take the original document and its translation, and to say that the Nth extracted string from the translation is the translation of the Nth extracted string from the original. In order to work, both files must share exactly the same structure. For example, if the files have the following structure, it is very unlikely that the 4th string in translation (of type 'chapter') is the translation of the 4th string in original (of type 'paragraph').
fr: L'idée ici est de prendre à la fois le document d'origine et sa traduction, et de supposer que la Nième chaîne extraite du document traduit correspond à la traduction de la Nième chaîne du document original. Pour que cela fonctionne, il faut donc que les deux documents aient exactement la même structure. Par exemple, si les fichiers ont la structure suivante, il y a très peu de chance pour que la quatrième chaîne de la traduction (qui est de type S<« chapter »>) soit la traduction de la quatrième chaîne du document original (de type S<« paragraph »>).

source: Original Translation
fr: Original Traduction

source: chapter chapter paragraph paragraph paragraph paragraph paragraph chapter chapter paragraph paragraph paragraph
fr: chapitre chapitre paragraphe paragraphe paragraphe paragraphe paragraphe chapitre chapitre paragraphe paragraphe paragraphe

source: For that, po4a parsers are used on both the original and the translation files to extract po files, and then a third po file is built from them taking strings from the second as translation of strings from the first. In order to check that the strings we put together are actually the translations of each other, document parsers in po4a should put information about the syntactical type of extracted strings in the document (all existing ones do so, yours should also). Then, this information is used to make sure that both documents have the same syntax. In the previous example, it would allow us to detect that string 4 is a paragraph in one case, and a chapter title in another case and to report the problem.
fr: Pour cela, les analyseurs po4a sont utilisés à la fois sur l'original et sur la traduction pour extraire des fichiers po, et un troisième fichier po est construit à partir d'eux en utilisant les chaînes du second comme traductions des chaînes du premier. Pour s'assurer que les chaînes ainsi associées sont bien les traductions, les analyseurs de po4a doivent ajouter des informations sur le type syntaxique des chaînes extraites du document (les analyseurs existants le font, les vôtres devraient également). Ensuite, ces informations sont utilisées pour s'assurer que les deux documents ont la même syntaxe. Dans l'exemple précédent, cela permet de détecter que la quatrième chaîne est dans un cas un paragraphe et dans l'autre un titre de chapitre, et le problème est affiché.
