Repository: TheShellLand/crossover-source
Catalog: po4a/po/pod/*.po
Languages: fr

source: If a paragraph contains a line starting by a space (or tabulation), this paragraph won't be rewrapped.
fr: Si un paragraphe contient une ligne commençant par un espace (ou une tabulation), ce paragraphe ne sera pas remis en forme.

source: Still to be implemented.
fr: Doit encore être implémenté.

source: Copyright 2005 by Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.
fr: Copyright 2005 par Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.

source: Po4a TransTractor - Generic trans(lator ex)tractor.
fr: Po4a TransTractor - Traducteur/extracteur générique.

source: This class is the ancestor of every po4a parsers used to parse a document to search translatable strings, extract them to a po file and replace them by their translation in the output document.
fr: Cette classe est l'ancêtre de tous les analyseurs po4a utilisés pour lire un document, y chercher les chaînes traduisibles, les extraire dans un fichier po, et les remplacer par leur traduction dans le document généré.

source: More formally, it takes the following arguments as input:
fr: Plus formellement, elle prend les paramètres d'entrée S<suivants :>

source: a document to translate ;
fr: un document à S<traduire ;>

source: a po file containing the translations to use.
fr: un fichier po contenant les traductions à utiliser.

source: As output, it produces:
fr: En sortie, elle S<produit :>

source: another po file, resulting of the extraction of translatable strings from the input document ;
fr: un autre fichier po, résultat de l'extraction des chaînes traduisibles du document en S<entrée ;>

source: a translated document, with the same structure than the one in input, but with all translatable strings replaced with the translations found in the po file provided in input.
fr: un document traduit, partageant la même structure que celui en entrée, mais dont toutes les chaînes traduisibles ont été remplacées par les traductions trouvées dans le fichier po fourni en entrée.

source: Here is a graphical representation of this:
fr: Voici une représentation graphique de tout S<cela :>

source: Input document --\ /---> Output document \ / (translated) +-> parse() function -----+ / \ Input po --------/ \---> Output po (extracted)
fr: document entrée --\ /---> document sortie \ / (traduit) +-> parse() function -----+ / \ po entrée --------/ \---> po sortie (extrait)

source: FUNCTIONS YOUR PARSER SHOULD OVERRIDE
fr: FONCTIONS QUE VOTRE ANALYSEUR DOIT SURCHARGER

source: This is where all the work takes place: the parsing of input documents, the generation of output, and the extraction of the translatable strings. This is pretty simple using the provided functions presented in the section "INTERNAL FUNCTIONS" below. See also the synopsis, which present an example.
fr: Il s'agit de la fonction principale où tout le travail a S<lieu :> la lecture des documents en entrée, la génération des documents en sortie et l'extraction des chaînes traduisibles. Tout ceci est assez simple avec les fonctions fournies et présentées dans la section S<« FONCTIONS> S<INTERNES »> ci-dessous. Veuillez aussi vous reporter à la section SYNOPSIS, qui présente un exemple.

source: This function is called by the process() function bellow, but if you choose to use the new() function, and to add content manually to your document, you will have to call this function yourself.
fr: Cette fonction est appelée par la fonction process() ci-dessous, mais si vous choisissez d'utiliser la fonction new(), et d'ajouter le contenu manuellement, vous devrez appeler cette fonction vous-même.

source: This function returns the header we should add to the produced document, quoted properly to be a comment in the target language. See the section "Educating developers about translations", from L<po4a(7)|po4a.7>, for what it is good for.
fr: Cette fonction renvoie l'en-tête que nous devons ajouter au document produit, formaté comme il faut pour qu'il soit un commentaire pour le langage cible. Reportez-vous à la section S<« Éduquer> les développeurs au problème des S<traductions »>, dans L<po4a(7)|po4a.7>.

source: The following example parses a list of paragraphs beginning with "<p>". For the sake of simplicity, we assume that the document is well formatted, i.e. that '<p>' tags are the only tags present, and that this tag is at the very beginning of each paragraph.
fr: L'exemple suivant analyse une liste de paragraphes commençant par S<« <p> »>. Pour simplifier, nous supposons que le document est bien formaté, c'est-à-dire que la balise <p> est la seule présente et que cette balise se trouve au début de chaque paragraphe.

source: PARAGRAPH: while (1) { my ($paragraph,$pararef)=("",""); my $first=1; my ($line,$lref)=$self->shiftline(); while (defined($line)) { if ($line =~ m/<p>/ && !$first--; ) { # Not the first time we see <p>. # Reput the current line in input, # and put the built paragraph to output $self->unshiftline($line,$lref);
fr: PARAGRAPHE: while (1) { my ($paragraphe,$pararef)=("",""); my $premier=1; ($ligne,$lref)=$self->shiftline(); while (defined($ligne)) { if ($ligne =~ m/<p>/ && !$premier--; ) { # Ce n'est pas la première balise <p>. # Remet la ligne actuelle dans le document d'entrée, # et met le paragraphe dans la sortie $self->unshiftline($line,$lref);

source: # Now that the document is formed, translate it: # - Remove the leading tag $paragraph =~ s/^<p>//s;
fr: # Maintenant que le document est formé, il faut le traduire : # - Retirons les balises de tête $paragraphe =~ s/^<p>//s;

source: # - push to output the leading tag (untranslated) and the # rest of the paragraph (translated) $self->pushline( "<p>" . $document->translate($paragraph,$pararef) );
fr: # - Poussons la balise de tête (à ne pas traduire) et le # reste du paragraphe (à traduire) dans le document de # sortie $self->pushline( "<p>" . $document->translate($paragraphe,$pararef) );

source: next PARAGRAPH; } else { # Append to the paragraph $paragraph .= $line; $pararef = $lref unless(length($pararef)); }
fr: next PARAGRAPHE; } else { # Ajout à la fin du paragraphe $paragraphe .= $ligne; $pararef = $lref unless(length($pararef)); }

source: # Reinit the loop ($line,$lref)=$self->shiftline(); } # Did not get a defined line? End of input file. return; } }
fr: # Re-initialise la boucle ($ligne,$lref)=$self->shiftline(); } # Aucune nouvelle ligne ? C'est la fin du fichier d'entrée. return; } }

source: Once you've implemented the parse function, you can use your document class, using the public interface presented in the next section.
fr: Une fois que vous avez implémenté la fonction parse, vous pouvez utiliser cette nouvelle classe en utilisant l'interface publique présentée dans la section suivante.

source: PUBLIC INTERFACE for scripts using your parser
fr: INTERFACE PUBLIQUE pour les scripts utilisant votre analyseur

source: Constructor
fr: Constructeur

source: This function can do all you need to do with a po4a document in one invocation. Its arguments must be packed as a hash. ACTIONS:
fr: Cette fonction peut faire tout ce dont vous avez besoin avec un document po4a en une seule invocation. Ses paramètres doivent être fournis sous forme de table de hachage. Voici les différentes actions S<possibles :>

source: Reads all the po files specified in po_in_name
fr: Lit tous les fichiers po spécifiés dans po_in_name

source: Reads all original documents specified in file_in_name
fr: Lit tous les documents originaux spécifiés dans file_in_name

source: Parses the document
fr: Analyse le document

source: Reads and applies all the addenda specified
fr: Lit et applique tous les addenda spécifiés

source: Writes the translated document to file_out_name (if given)
fr: Écrit le document traduit dans file_out_name (si spécifié)

source: Writes the extracted po file to po_out_name (if given)
fr: Écrit le fichier po extrait dans po_out_name (si spécifié)

source: ARGUMENTS, beside the ones accepted by new() (with expected type):
fr: PARAMÈTRES, en plus de ceux acceptés par new(), ainsi que leur S<type :>

source: List of filenames where we should read the input document.
fr: Liste de noms de fichiers d'où lire les documents en entrée.

source: Charset used in the input document (if it isn't specified, it will try to detect it from the input document).
fr: Le jeu de caractères du document d'entrée (s'il n'est pas spécifié, il essayera de le détecter à partir du document).

source: Filename where we should write the output document.
fr: Nom de fichier où écrire le document en sortie.

source: Charset used in the output document (if it isn't specified, it will use the po file charset).
fr: Le jeu de caractères du document de sortie (s'il n'est pas spécifié, le jeu de caractères du fichier po sera utilisé).

source: List of filenames where we should read the input po files from, containing the translation which will be used to translate the document.
fr: Liste de noms de fichiers d'où lire les fichiers po d'entrée (ceux contenant les traductions à utiliser pour la traduction du document).

source: Filename where we should write the output po file, containing the strings extracted from the input document.
fr: Nom de fichier où écrire le fichier po de sortie (celui contenant les chaînes extraites du document d'entrée).

source: List of filenames where we should read the addenda from.
fr: Liste de noms de fichiers d'où lire les addenda à appliquer.

source: Charset for the addenda.
fr: Jeu de caractères des addenda.

source: Create a new Po4a document. Accepted options (but be in a hash):
fr: Créer un nouveau document Po4a. Options acceptées (sous forme de S<hachage) :>

source: Sets the verbosity.
fr: Règle le niveau de bavardage.

source: Sets the debugging.
fr: Règle le niveau de débogage.

source: Manipulating document files
fr: Manipuler les documents

source: Add another input document at the end of the existing one. The argument is the filename to read.
fr: Ajouter un nouveau document d'entrée après ceux déjà ajoutés. Le paramètre est le nom du fichier à lire.

source: Please note that it does not parse anything. You should use the parse() function when you're done with packing input files into the document.
fr: Notez que cette fonction n'analyse pas le fichier donné. Il faut utiliser parse() pour cela une fois que vous avez ajouté au document tous les fichiers que vous souhaitez analyser.

source: Write the translated document to the given filename.
fr: Écrire le document traduit dans le fichier dont le nom est passé en paramètre.

source: Manipulating po files
fr: Manipuler les fichiers po

source: Add the content of a file (which name is passed in argument) to the existing input po. The old content is not discarded.
fr: Ajouter le contenu du fichier dont le nom est passé en paramètre au po d'entrée. Notez que l'ancien contenu du po d'entrée n'est pas effacé.

source: Write the extracted po file to the given filename.
fr: Écrire le po extrait dans le fichier dont le nom est passé en paramètre.

source: Returns some statistics about the translation done so far. Please note that it's not the same statistics than the one printed by msgfmt --statistic. Here, it's stats about recent usage of the po file, while msgfmt reports the status of the file. It is a wrapper to the Locale::Po4a::Po::stats_get function applied to the input po file. Example of use:
fr: Renvoie des statistiques à propos de la traduction. Veuillez noter que ce ne sont pas les statistiques affichées par msgfmt --statistic. Dans ce cas, il s'agit des statistiques concernant l'utilisation récente du fichier po, tandis que msgfmt renseigne sur le statut du fichier po. Il s'agit d'une encapsulation autour de la fonction Locale::Po4a::Po::stats_get en utilisant le fichier po en entrée. Voici un exemple S<d'utilisation :>

source: [normal use of the po4a document...]
fr: [utilisation normal d'un document po4a...]

source: ($percent,$hit,$queries) = $document->stats(); print "We found translations for $percent\% ($hit from $queries) of strings.\n";
fr: ($pourcent,$traduit,$total) = $document->stats(); print "Des traductions ont été trouvées pour $pourcent\% ($traduit sur $total) des chaînes.\n";

source: Manipulating addenda
fr: Manipuler les addenda

source: Please refer to L<po4a(7)|po4a.7> for more information on what addenda are, and how translators should write them. To apply an addendum to the translated document, simply pass its filename to this function and you are done ;)
fr: Veuillez vous reporter à L<po4a(7)|po4a.7> pour plus d'informations sur ce que sont les addenda et comment les traducteurs doivent les écrire. Pour appliquer un addendum au document traduit, vous n'avez qu'à fournir le nom du fichier à cette fonction, et c'est S<fini ;)>

source: This function returns a non-null integer on error.
fr: Cette fonction retourne un entier non nul en cas d'erreur.

source: Getting input, providing output
fr: Récupération de l'entrée, génération de la sortie

source: Four functions are provided to get input and return output. They are very similar to shift/unshift and push/pop. The first pair is about input, while the second is about output. Mnemonic: in input, you are interested in the first line, what shift gives, and in output you want to add your result at the end, like push does.
fr: Quatre fonctions sont fournies pour récupérer l'entrée et renvoyer la sortie. Elles sont très similaires aux couples shift/unshift et push/pop. La première paire concerne l'entrée, et la seconde la sortie. Moyen S<mnémotechnique :> en entrée, on veut récupérer la première ligne, ce que shift S<permet ;> en sortie on veut ajouter le résultat à la fin, ce que fait push.

source: This function returns the next line of the doc_in to be parsed and its reference (packed as an array).
fr: Cette fonction renvoie le ligne suivante du document d'entrée qui est analysé, ainsi que sa référence (les deux étant placées dans un tableau).

source: Unshifts a line of the input document and its reference.
fr: Récupère une ligne du document d'entrée, ainsi que sa référence.

source: Push a new line to the doc_out.
fr: Ajoute une nouvelle ligne dans le document de sortie.

source: Pop the last pushed line from the doc_out.
fr: Récupère (pop) la dernière ligne poussée dans le document de sortie.

source: Marking strings as translatable
fr: Marquage des chaînes à traduire

source: One function is provided to handle the text which should be translated.
fr: Une fonction est fournie pour gérer le texte qui doit être traduit.

source: Mandatory arguments:
fr: Paramètres S<obligatoires :>

source: A string to translate
fr: La chaîne à traduire

source: The reference of this string (ie, position in inputfile)
fr: La référence de cette chaîne (c.-à-d., sa position dans le fichier d'entrée)

source: The type of this string (ie, the textual description of its structural role ; used in Locale::Po4a::Po::gettextization() ; see also L<po4a(7)|po4a.7>, section I<Gettextization: how does it work?>)
fr: Le type de la chaîne (c.-à-d., la description textuelle de son rôle S<structurel ;> utilisé dans S<Locale::Po4a::Po::gettextization() ;> consultez également L<po4a(7)|po4a.7>, section I<S<Gettextization :> Comment ça S<marche ?>>)

source: This function can also take some extra arguments. They must be organized as a hash. For example:
fr: Cette fonction peut également prendre des paramètres supplémentaires. Ils doivent être organisés sous forme de table de hachage. Par S<exemple :>

source: $self->translate("string","ref","type", 'wrap' => 1);
fr: $self->translate("chaîne","référence","type", 'wrap' => 1);

source: boolean indicating whether we can consider that whitespaces in string are not important. If yes, the function canonizes the string before looking for a translation or extracting it, and wraps the translation.
fr: Booléen indiquant si on peut considérer que les espaces des chaînes ne sont pas importants. Dans ce cas, la fonction crée une forme canonique de la chaîne avant de rechercher une traduction ou de l'extraire et ajoute des retours à la ligne à la traduction.

source: An extra comment to add to the entry.
fr: Un commentaire additionnel à ajouter à l'entrée du po.

source: Actions:
fr: S<Action :>

source: Pushes the string, reference and type to po_out.
fr: Pousse la chaîne, la référence et le type dans le po de sortie.

source: Returns the translation of the string (as found in po_in) so that the parser can build the doc_out.
fr: Renvoie la traduction de la chaîne (trouvée dans po_in) de façon à ce que l'analyseur (parser) puisse construire doc_out.

source: Handles the charsets to recode the strings before sending them to po_out and before returning the translations.
fr: Gère les jeux de caractères pour recoder les chaînes avant de les envoyer à po_out et avant de renvoyer la traduction.

source: Misc functions
fr: Fonctions diverses

source: Returns if the verbose option was passed during the creation of the TransTractor.
fr: Indique si le mode bavard a été activé lors de la création du Transtractor.

source: Returns if the debug option was passed during the creation of the TransTractor.
fr: Indique si l'option de débogage a été fournie lors de la création du Transtractor.

source: This tells TransTractor that a new charset (the first argument) has been detected from the input document. It can usually be read from the document header. Only the first charset will remain, coming either from the process() arguments or detected from the document.
fr: Indique à TransTractor qu'un nouveau jeu de caractères (premier paramètre) a été détecté dans le document d'entrée. Il est en règle général lu dans l'en-tête du document. Seul le premier jeu de caractères restera, qu'il soit fourni par les paramètres de process() ou détecté dans le document.

source: This function will return the charset that should be used in the output document (usually useful to substitute the input document's detected charset where it has been found).
fr: Cette fonction retournera le jeu de caractères qui doit être utilisé dans le document de sortie (souvent utile pour substituer le jeu de caractères qui a été détecté dans le document d'entrée).

source: It will use the output charset specified in the command line. If it wasn't specified, it will use the input po's charset, and if the input po has the default "CHARSET", it will return the input document's charset, so that no encoding is performed.
fr: Il utilisera le jeu de caractères spécifié sur la ligne de commande. S'il n'a pas été spécifié, il utilisera le jeu de caractère du fichier po d'entrée, et si ce fichier po utilise la valeur par défaut S<« CHARSET »>, et aucun encodage n'est réalisé.

source: This function returns the recoded text passed as argument, from the input document's charset to the output document's one. This isn't needed when translating a string (translate() recodes everything itself), but it is when you skip a string from the input document and you want the output document to be consistent with the global encoding.
fr: Cette fonction réencode le texte donné en paramètre, du jeu de caractères du document d'entrée vers le jeu de caractères du document de sortie. Ce n'est pas nécessaire quand les chaînes sont traduites (translate() réencode tout d'elle-même), mais ça l'est lorsque vous sautez des chaînes du document d'entrée et que vous voulez que le document de sortie utilise un encodage uniforme.

source: FUTURE DIRECTIONS
fr: DIRECTIONS FUTURES

source: One shortcoming of the current TransTractor is that it can't handle translated document containing all languages, like debconf templates, or .desktop files.
fr: Une des imperfections du TransTractor actuel est qu'il ne peut pas gérer de documents traduits contenant toutes les langues, comme les modèles debconf ou les fichier .desktop.

source: To address this problem, the only interface changes needed are:
fr: Pour répondre à ce problème, les seules modifications d'interface nécessaires S<sont :>

source: take a hash as po_in_name (a list per language)
fr: utiliser une table de hachage pour po_in_name (une liste par langue)

source: add an argument to translate to indicate the target language
fr: ajouter un paramètre à traduire pour indiquer la langue cible

source: make a pushline_all function, which would make pushline of its content for all language, using a map-like syntax:
fr: créer une fonction pushline_all, qui utiliserait pushline pour le contenu de toutes ses langues, en utilisant S<map :>

source: $self->pushline_all({ "Description[".$langcode."]=". $self->translate($line,$ref,$langcode) });
fr: $self->pushline_all({ "Description[".$code_langue."]=". $self->translate($ligne,$réf,$code_langue) });

source: Will see if it's enough ;)
fr: Nous verrons si c'est S<suffisant ;)>

source: Locale::Po4a::Wml - Convert wml (web markup language) documents from/to PO files
fr: Locale::Po4a::Wml - convertit les documents wml (web markup language) depuis/vers des fichiers PO

source: Locale::Po4a::Wml is a module to help the translation of wml documents into other [human] languages. Do not mixup the WML we are speaking about here (web markup language) and the WAP crap used on cell phones.
fr: Locale::Po4a::Wml est un module qui permet d'aider à traduire des documents wml dans d'autres langues. Ne confondez pas le WML dont nous parlons ici (web markup language) avec cette connerie de WAP utilisée pour les téléphones mobiles.

source: TODO
fr: LISTE DES CHOSES À FAIRE

source: Dans le po, faut corriger les references pour pointer sur le fichier de depart, pas le temporaire
fr: Dans le PO, il faut corriger les références pour pointer sur le fichier de départ, pas le temporaire.

source: This module will be implemented by Martin Quinson (mquinson#debian.org), amonst other (I hope).
fr: Ce module sera implémenté par Martin Quinson (mquinson#debian.org), entre autres (enfin je l'espère).

source: Locale::Po4a::Xhtml - Convert Xhtml documents from/to PO files
fr: Locale::Po4a::Xhtml - convertit les documents xhtml depuis/vers des fichiers PO

source: The goal of the po4a (po for anything) project is to ease translations (and more interestingly, the maintenance of translations) using gettext tools on areas where they were not originally expected like documentation.
fr: L'objectif du projet po4a [po for anything -- po pour tout] est de simplifier la traduction (et de façon plus intéressante, la maintenance des traductions) en utilisant les outils gettext dans des domaines pour lesquels ils n'étaient pas destinés, comme la documentation.

source: Locale::Po4a::Xhtml is a module to help the translation of Xhtml documents into other [human] languages.
fr: Locale::Po4a::Xhtml est un module permettant d'aider à la traduction de documents Xhtml dans d'autres langues.

source: Please note that this module is still experimental. It is not distributed in the official po4a releases since we don't feel it to be mature enough. If you insist on trying, check the CVS out.
fr: Veuillez noter que ce module est encore en développement, et toujours pas distribué dans la livraison officielle de po4a parce que nous ne pensons pas qu'il soit suffisamment mature. Si vous insistez pour l'essayer, veuillez récupérer la version du CVS.

source: It is derived from Jordi's DocBook module.
fr: Il est dérivé du module DocBook de Jordi.

source: "It works for me", which means I use it successfully on my personal Web site. However, YMMV: please let me know if something doesn't work for you. In particular, tables are getting no testing whatsoever, as we don't use them.
fr: S<« Il fonctionne pour moi »>, ce qui veut dire que je l'ai utilisé avec succès pour mon site web personnel. Mais qui S<sait ?> Veuillez me faire savoir si quelque chose ne fonctionne pas pour vous. En particulier, les tables n'ont jamais été testées, parce que nous ne les utilisons pas.
