Repository: TheShellLand/crossover-source
Catalog: po4a/po/pod/*.po
Languages: fr

source: Copyright (c) 1995 by David Megginson <dmeggins@aix1.uottawa.ca>
fr: Copyright (c) 1995 par David Megginson <dmeggins@aix1.uottawa.ca>

source: Copyright (c) 1995 by David Megginson <dmeggins@aix1.uottawa.ca> Copyright 2002, 2003, 2004, 2005 by SPI, inc.
fr: Copyright (c) 1995 par David Megginson <dmeggins@aix1.uottawa.ca> Copyright 2002, 2003, 2004, 2005 par SPI, inc.

source: Locale::Po4a::TeX - Convert TeX documents and derivates from/to PO files
fr: Locale::Po4a::TeX - Convertit les documents TeX (ou dérivés) depuis/vers des fichiers PO

source: Locale::Po4a::TeX is a module to help the translation of TeX documents into other [human] languages. It can also be used as a base to build modules for TeX-based documents.
fr: Locale::Po4a::TeX est un module qui permet d'aider à traduire des documents TeX dans d'autres langues. Il peut aussi servir de base pour créer d'autres modules pour des documents basés sur le format TeX.

source: Users should probably use the LaTeX module, which inherite from the TeX module and contains the definitions of common LaTeX commands.
fr: Les utilisateurs devraient plutôt utiliser le module LaTeX, qui hérite du module TeX et contient les définitions des commandes LaTeX les plus courantes.

source: TRANSLATING WITH PO4A::TEX
fr: TRADUCTION AVEC PO4A::TEX

source: This module can be used directly to handle generic TeX documents. This will split your document in smaller blocks (paragraphs, verbatim blocks, or even smaller like titles or indexes).
fr: Ce module peut être utilisé directement pour traiter des documents dans un format générique TeX. Il découpera le document en blocs plus petits (paragraphes, blocs verbatim, ou des éléments encore plus petits comme les titres ou index).

source: There are some options (described in the next section) that can customize this behavior. If this doesn't fit to your document format you're encouraged to write your own module derived from this, to describe your format's details. See the section "Writing derivate modules" below, for the process description.
fr: Il y a quelques options (décrites dans la section suivante) qui peuvent permettre de paramétrer ce comportement. Si ça ne correspond pas au format de votre document, vous êtes encouragé à écrire votre propre module dérivé de celui-ci, pour décrire en détails votre format. Consultez la section S<« Writing> derivate S<modules »> plus bas, pour un descriptif de la procédure.

source: This module can also be customized by lines starting with "% po4a:" in the TeX file. These customizations are described in the B<INLINE CUSTOMIZATION> section.
fr: Ce module peut également être configuré à l'aide de lignes commençant par S<« % po4a: »> dans le fichier TeX. Ces personnalisations sont décrites dans la section B<PERSONNALISATION EN LIGNE>.

source: Coma-separated list of environments which should not be re-wrapped.
fr: Liste d'environnements, séparés par des virgules, dont les retours à la ligne ne doivent pas être modifiés.

source: Note that there is a difference between verbatim and no_wrap environments. There is no command and comments analysis in verbatim blocks.
fr: Notez qu'il y a une différence entre un environnement sans remise en forme et un environnement verbatim. Il n'y a pas d'analyse des commandes et des commentaires dans les blocs verbatim.

source: If this environment was not already registered, po4a will consider that this environment does not take any parameters.
fr: Si cet environnement n'était pas déjà enregistré, po4a considérera que cet environnement ne prend pas de paramètre.

source: Colon-separated list of files that should not be included by \input and \include.
fr: Liste de fichiers, séparés par des deux-points, qui ne doivent pas être inclus par les commandes \input et \include.

source: The name of a file containing definitions for po4a, as defined in the B<INLINE CUSTOMIZATION> section. You can use this option if it is not possible to put the definitions in the document being translated.
fr: Le nom d'un fichier contenant des définitions pour po4a, telles qu'elles sont décrites dans la section B<PERSONNALISATION EN LIGNE>. Vous pouvez utiliser cette option s'il n'est pas possible de placer les définitions dans le document à traduire.

source: Coma-separated list of environments which should be taken as verbatim.
fr: Liste d'environnements, séparés par des virgules, qui doivent être considérés comme verbatim.

source: Using these options permits to override the behaviour of the commands defined in the default lists.
fr: L'utilisation de ces options permet de modifier le comportement des commandes des listes par défaut.

source: INLINE CUSTOMIZATION
fr: PERSONNALISATION EN LIGNE

source: The TeX module can be customized with lines starting by "% po4a:". These lines are interpreted as commands to the parser. The following commands are recognized:
fr: Le module TeX peut être personnalisé à l'aide de lignes commençant par S<« % po4a: »>. Ces lignes sont interprétées comme des commandes pour l'analyseur. Les commandes suivantes sont S<reconnues :>

source: % po4a: command I<command1> alias I<command2>
fr: % po4a: command I<commande1> alias I<commande2>

source: Indicates that the arguments of the I<command1> command should be treated as the arguments of the I<command2> command.
fr: Indique que les paramètres de la commande I<commande1> doivent être traités de la même façon que les paramètres de la commande I<commande2>.

source: % po4a: command I<command1> I<parameters>
fr: % po4a: command I<commande1> I<paramètres>

source: This permit to describe in detail the parameters of the I<command1> command. This information will be used to check the number of arguments and their types.
fr: Ceci permet de décrire en détail les paramètres de la commande I<commande1>. Cette information est ensuite utilisée pour vérifier le nombre de paramètres et leurs types.

source: You can precede the I<command1> command by
fr: Vous pouvez précéder la commande I<commande1> <par :>

source: an asterisk (*)
fr: un astérisque (*)

source: po4a will extract this command from paragraphs (if it is located at the beginning or the end of a paragraph). The translators will then have to translate the parameters that are marked as translatable.
fr: po4a extraira cette commande des paragraphes (si elle est située à une extrémité du paragraphe). Les traducteurs auront alors à traduire les paramètres qui ont été marqués comme pouvant être traduits.

source: a plus (+)
fr: un plus (+)

source: As for an asterisk, the command will be extracted if it appear at an extremity of a block, but the parameters won't be translated separately. The translator will have to translate the command concatenated to all its parameters. This permits to keep more context, and is usefull for commands with small words in parameter, which can have multiple meanings (and translations).
fr: Comme pour un astérisque, la commande sera extraite si elle apparaît à une extrémité d'un bloc, mais ses paramètres ne seront pas traduits séparément. Le traducteur aura à traduire la commande concaténée à tous ses paramètres. Ceci permet de conserver plus de contexte, et est utile pour les commandes avec des mots courts en paramètre, qui peuvent avoir plusieurs significations (et traductions).

source: Note: In this case you don't have to specify which parameters are translatable, but po4a must know the type and number of parameters.
fr: S<Note :> dans ce cas, vous n'avez pas à préciser quels paramètres sont traduisibles, mais po4a doit connaître les types et le nombre de paramètres.

source: a minus (-)
fr: un moins (-)

source: In this case, the command won't be extracted from any block. But if it appear alone on a bloc, then only the parameters marked as translatable will be presented to the translator. This is usefull for font command. These commands should generally not be separated from their paragraph (to keep the context), but there is no reason to annoy the translator with them if a whole string is enclosed in such a command.
fr: Dans ce cas, la commande ne sera jamais extraite d'un bloc. Mais si elle apparaît seule dans un bloc, alors seuls les paramètres marqués comme traduisibles seront présentés au traducteur. C'est utile pour les commandes pour les polices. Ces commandes ne doivent généralement pas être séparées de leur paragraphe (pour conserver le contexte), mais il n'y a pas de raison de déranger le traducteur avec ces commandes si la chaîne entière est englobée dans cette commande.

source: The I<parameters> argument is a set of [] (to indicate an optional argument) or {} (to indicate a mandatory argument). You can place an underscore (_) between these brackets to indicate that the parameter must be translated. For example: % po4a: command *chapter [_]{_}
fr: Le paramètre I<paramètres> est une suite de [] (pour indiquer un paramètre optionnel) ou {} (pour indiquer un paramètre obligatoire). Vous pouvez placer un tiret-bas (_) entre ces crochets ou accolades pour indiquer que ce paramètre doit être traduit. Par exemple: % po4a: command *chapter [_]{_}

source: This indicates that the chapter command has two parameters: an optional (short title) and a mandatory one, which must both be translated. If you want to specify that the href command has two mandatory parameters, that you don't want to translate the URL (first parameter), and that you don't want this command to be separated from its paragraph (which allow the translator to move the link in the sentence), you can use: % po4a: command -href {}{_}
fr: Ceci indique que la commande chapter a deux S<paramètres :> un optionnel (titre court) et un obligatoire, qui doivent tous deux être traduits. Si vous voulez indiquer que la commande href a deux paramètres obligatoires, que vous ne voulez pas traduire l'URL (le premier paramètre), et que vous ne voulez pas que cette commande soit séparée d'un paragraphe (ce qui permet au traducteur de déplacer le lien dans une phrase), vous pouvez S<utiliser :> % po4a: command -href {}{_}

source: In this case, the information indicating which arguments must be translated is only used if a paragraph is only composed of this href command.
fr: Dans ce cas, l'information indiquant quels paramètres doivent être traduits n'est utilisée que si un paragraphe n'est composé que de cette commande.

source: % po4a: environment I<env> I<parameters>
fr: % po4a: environment I<env> I<paramètres>

source: This permits to define the parameters accepted by the I<env> environment. This information is latter used to check the number of arguments of the \begin command, and permit to specify which one must be translated. The syntax of the I<parameters> argument is the same as described for the commands. The first parameter of the \begin command is the name of the environment. This parameter must not be specified in the list of parameters. Here are some examples: % po4a: environment multicols {} % po4a: environment equation
fr: Ceci permet de définir les paramètres acceptés par l'environnement I<env>. Cette information sera ensuite utilisée pour vérifier le nombre de paramètres de la commande \begin, et permet de préciser quels paramètres doivent être traduits. La syntaxe du paramètre I<paramètres> est la même que celle décrite pour les commandes. Le premier paramètre de la commande \begin est le nom de l'environnement. Ce paramètre ne doit pas être spécifié dans la liste des paramètres. Voici quelques S<exemples :> % po4a: environment multicols {} % po4a: environment equation

source: As for the commands, I<env> can be preceded by a plus (+) to indicate that the \begin command must be translated with all its arguments.
fr: Comme pour les commandes, I<env> peut être précédé d'un plus (+) pour indiquer que la commande \begin doit être traduite avec tous ses paramètres.

source: Indicates that an environment should be split according to the given regular expression.
fr: Indique que l'environnement doit être découpé suivant l'expression rationnelle donnée.

source: The regular expression is delimited by quotes. It should not create any backreference. You should use (?:) if you need a group. It may also need some escapes.
fr: L'expression rationnelle doit être délimitée par des guillemets droits. Elle ne doit pas créer de référence arrière. Vous devez donc utiliser (?:) si vous avez besoin d'un groupe. Elle peut nécessiter des caractères d'échappement.

source: For example, the LaTeX module uses the "(?:&|\\\\)" regular expression to translate separately each cell of a table (lines are separated by '\\' and cells by '&').
fr: Par exemple, le module LaTeX utilise l'expression rationnelle "(?:&|\\\\)" pour traduire séparément chaque cellule d'un tableau (les lignes sont séparées par '\\' et les cellules par '&').

source: The notion of environment is expended to the type displayed in the PO file. This can be used to split on "\\\\" in the first mandatory argument of the title command. In this case, the environment is title{#1}.
fr: La notion d'environnement est étendue au type affiché dans le fichier PO. Ceci peut être utilisé pour réaliser un découpage suivant "\\\\" dans le premier paramètre obligatoire de la commande title. Dans ce cas, l'environnement à utiliser est title{#1}.

source: Indicate that I<env> is a verbatim environment. Comments and commands will be ignored in this environment.
fr: Indique que I<env> est un environnement verbatim. Les commentaires et les commandes seront ignorés dans cet environnement.

source: WRITING DERIVATE MODULES
fr: ÉCRITURE DE MODULES DÉRIVÉS

source: Wrapper around Transtractor's translate, with pre- and post-processing filters.
fr: Encapsulation de l'appel à la fonction translate du module Transtractor, en ajoutant des filtres avant et après la traduction.

source: Comments of a paragraph are inserted as a PO comment for the first translated string of this paragraph.
fr: Les commentaires d'un paragraphe sont insérés comme commentaires au fichier PO pour la première chaîne de ce paragraphe.

source: This function returns:
fr: Cette fonction S<retourne :>

source: A command name
fr: Un nom de commande

source: If no command is found at the beginning of the given buffer, this string will be empty. Only commands that can be separated are considered. The %separated_command hash contains the list of these commands.
fr: Si aucune commande n'est trouvée au début du buffer, cette chaîne sera vide. Seules les commandes qui peuvent être séparées sont prises en compte. La table de hachage %separated_command contient la liste de ces commandes.

source: A variant
fr: Une variante

source: This indicate if a variant is used. For example, an asterisk (*) can be added at the end of sections command to specify that they should not be numbered. In this case, this field will contain "*". If there is no variant, the field is an empty string.
fr: Indique si une variante est utilisée. Par exemple, un astérisque (*) peut être ajouté à la fin des commandes de section pour indiquer qu'elles ne doivent pas être numérotées. Dans ce cas, ce champ contiendra S<« * »>. S'il n'y a pas de variante, ce champ est une chaîne vide.

source: An array of tuples (type of argument, argument)
fr: Un tableau de couples (type de paramètre, paramètre)

source: The type of argument can be either '{' (for mandatory arguments) or '[' (for optional arguments).
fr: Le type de paramètre peut être soit S<« { »> (pour les paramètres obligatoires) ou S<« [ »> (pour les paramètres optionnels).

source: The remaining buffer
fr: Le reste du buffer

source: The rest of the buffer after the removal of this leading command and its arguments. If no command is found, the original buffer is not touched and returned in this field.
fr: Le reste du buffer après le retrait de la commande de tête et de ses paramètres. Si aucune commande n'est trouvée, le buffer original n'est pas modifié et est retourné dans ce champ.

source: The same as get_leading_command, but for commands at the end of a buffer.
fr: Comme get_leading_command, mais pour les commandes à la fin du buffer.

source: Recursively translate a buffer by separating leading and trailing commands (those which should be translated separately) from the buffer.
fr: Traduit récursivement un buffer en séparant du buffer les commandes de tête et de queue (pour celles qui peuvent être traduites séparément).

source: Overload Transtractor's read
fr: Surcharge la fonction read du module Transtractor.

source: Recursively read a file, appending included files which are not listed in the @exclude_include array. Included files are searched in the directory of the input document or in a directory listed in the TEXINPUTS environment variable.
fr: Lit récursivement un fichier, en insérant les fichiers inclus (s'ils ne sont pas listés dans le tableau @exclude_include. Les fichier inclus sont recherchés dans le document d'entrée ou dans un répertoire listé par la variable d'environnement TEXINPUTS.

source: Except from the file inclusion part, it is a cut and paste from Transtractor's read.
fr: Mis à part l'insertion des fichiers, c'est un simple copier-coller de la fonction read du Transtractor.

source: Subroutine for parsing a file with po4a directive (definitions for newcommands).
fr: Sous-routine permettant d'analyser un fichier contenant des directives pour po4a (par exemple pour les nouvelles commandes).

source: Parse a definition line of the form "% po4a: ".
fr: Analyse une ligne de configuration de la forme S<« %po4a : »>.

source: See the INLINE CUSTOMIZATION section for more details.
fr: Consultez la section B<PERSONNALISATION EN LIGNE> pour plus de détails.

source: INTERNAL FUNCTIONS used to write derivated parsers
fr: FONCTIONS INTERNES utiliser pour dériver un analyseur (parser)

source: Command and environment functions take the following arguments (in addition to the $self object):
fr: Les fonctions pour les commandes et les environnements prennent, en plus de l'objet $self, les paramètres S<suivants :>

source: An array of (type, argument) tuples
fr: Un tableau de couples (type, paramètre)

source: The current environment
fr: L'environnement actuel

source: The first 3 arguments are extracted by get_leading_command or get_trailing_command.
fr: Les 3 premiers paramètres sont extraits par get_leading_command ou get_trailing_command.

source: Command and environment functions return the translation of the command with its arguments and a new environment.
fr: Les fonctions pour les environnements ou les commandes retournent la traduction de la commande avec ses paramètres et le nouvel environnement.

source: Environment functions are called when a \begin command is found. They are called with the \begin command and its arguments.
fr: Les fonctions pour les environnements sont appelées lorsqu'une commande \begin est trouvée. Elles sont appelées avec la commande \begin et ses paramètres.

source: The TeX module only proposes one command function and one environment function: generic_command and generic_environment.
fr: Le module TeX ne fournit qu'une fonction pour les commandes et une fonction pour les S<environnements :> generic_command et generic_environment.

source: generic_command uses the information specified by register_generic_command or by adding definition to the TeX file: % po4a: command I<command1> I<parameters>
fr: generic_command utilise les informations spécifiées par register_generic_command ou par une définition dans le fichier S<TeX :> % po4a: command I<commande1> I<paramètres>

source: generic_environment uses the information specified by register_generic_environment or by adding definition to the TeX file: % po4a: environment I<env> I<parameters>
fr: generic_environment utilise les informations spécifiées par register_generic_environment ou par une définition dans le fichier S<TeX :> % po4a: command I<commande1> I<paramètres>

source: Both functions will only translate the parameters that were specified as translatable (with a '_'). generic_environment will append the name of the environment to the environment stack and generic_command will append the name of the command followed by an identifier of the parameter (like {#7} or [#2]).
fr: Ces deux fonctions ne traduisent que les paramètres qui ont été indiqués comme étant à traduire (avec un S<« _ »>). generic_environment ajoutera le nom de l'environnement à la pile des environnements et generic_command ajoutera le nom de la commande suivi par un identifiant du paramètre (comme {#7} ou [#2]).

source: This module needs more tests.
fr: Ce module a besoin de plus de tests.

source: It was tested on a book and with the Python documentation.
fr: Il a été testé avec un livre et la documentation Python.

source: TODO LIST
fr: LISTE DES CHOSES À FAIRE

source: Automatic detection of new commands
fr: Détection automatique des nouvelles commandes

source: The TeX module could parse the newcommand arguments and try to guess the number of arguments, their type and whether or not they should be translated.
fr: Le module TeX pourrait analyser les paramètres de la commande newcommand et essayer de trouver le nombre de paramètres, leurs types et si oui ou non ils doivent être traduits.

source: Tranlation of the environment separator
fr: Traduction des séparateurs dans les environnements

source: When \item is used as an environment separator, the item argument is attached to the following string.
fr: Quand \item est utilisé comme séparateur dans un environnement, le paramètre de item est attaché à la chaîne qui suit.

source: Some commands should be added to the environment stack
fr: Certaines commandes devraient être ajoutées à la pile des environnements

source: These commands should be specified by couples. This could allow to specify commands beginning or ending a verbatim environment.
fr: Ces commandes devraient être fournies par paires. Ceci permettrait de définir des commandes qui débutent ou terminent un environnement verbatim.

source: Others
fr: Autres

source: Various other points are tagged TODO in the source.
fr: Divers autres points sont marqués TODO dans les sources.

source: KNOWN BUGS
fr: BOGUES CONNUS

source: Various points are tagged FIXME in the source.
fr: Divers points sont marqués FIXME dans les sources.

source: Locale::Po4a::Texinfo - Convert Texinfo documents and derivates from/to PO files
fr: Locale::Po4a::Texinfo - convertit les documents Texinfo (ou dérivés) depuis/vers des fichiers PO

source: Locale::Po4a::Texinfo is a module to help the translation of Texinfo documents into other [human] languages.
fr: Locale::Po4a::Texinfo est un module permettant d'aider la traduction de documents Texinfo dans d'autres langues.

source: This module contains the definitions of common Texinfo commands and environments.
fr: Ce module contient les définitions de commandes et environnements couramment rencontrés dans des documents Texinfo.

source: This module is still beta. Please send feedback and feature requests.
fr: Ce module est encore à l'état béta. Nous sommes intéressé par tout retour ou par des demandes de nouvelles fonctionnalités.

source: Locale::Po4a::Text - Convert text documents from/to PO files
fr: Locale::Po4a::Text - Convertit les documents text depuis/vers des fichiers PO

source: Locale::Po4a::Text is a module to help the translation of text documents into other [human] languages.
fr: Locale::Po4a::Text est un module permettant d'aider la traduction de documents texte dans d'autres langues.

source: Paragraphs are splitted on empty lines (or lines containing only spaces or tabulations).
fr: Les paragraphes sont séparés par des lignes vides (ou des lignes ne contenant que des espaces ou tabulations).
