Repository: TheShellLand/crossover-source
Catalog: po4a/po/pod/*.po
Languages: fr

source: po4a-updatepo - update the translation (in po format) of documentation
fr: po4a-updatepo - met la traduction (au format po) de la documentation à jour.

source: po4a-updatepo -f E<lt>fmtE<gt> (-m E<lt>master.docE<gt>)+ (-p E<lt>XX.poE<gt>)+
fr: po4a-updatepo -f E<lt>formatE<gt> (-m E<lt>maitre.docE<gt>)+ (-p E<lt>traduction.poE<gt>)+

source: (XX.po are the outputs, all others are inputs)
fr: (traduction.po sont les fichiers de sortie, tous les autres sont des entrées)

source: The C<po4a-updatepo> script is in charge of updating po files to make them reflect the changes made to the original documentation file. For that, it converts the documentation file to a pot file, and call L<msgmerge(1)> on this new pot and on the provided po files.
fr: Le script C<po4a-updatepo> met à jour un fichier po afin qu'il reflète les changements apportés au fichier original. Pour cela, il convertit le fichier pod en fichier pot, puis invoque L<msgmerge(1)> sur ce nouveau pot et sur les fichiers po fournis.

source: It is possible to give more than one po file (if you want to update several languages at once), and several documentation files (if you want to store the translations of several documents in the same po file).
fr: Il est possible de donner plus d'un fichier po à la fois (si vous voulez mettre plusieurs langues à jour d'un coup), et plusieurs fichiers de documentation (si vous voulez stocker la traduction de plusieurs documents dans le même fichier po)

source: If the master document has non-ascii characters, it will convert the po files to utf-8 (if they weren't already), in order to allow non-standard characters in a culture independent way.
fr: Si le document maître contient des caractères non ASCII, il convertit les fichiers po en utf-8 (si ce n'est pas déjà le cas), de façon à autoriser les caractères non standard en fonction des paramètres régionaux.

source: COMMAND-LINE OPTIONS
fr: OPTIONS EN LIGNE DE COMMANDE

source: File(s) containing the master document to translate.
fr: Fichier(s) contenant les documents maîtres à traduire.

source: Charset of the files containing the document to translate. Note that all files must have the same charset.
fr: Jeu de caractères des fichiers contenant les documents à traduire. Notez que tous les fichiers doivent partager le même jeu de caractères.

source: Po file(s) to update. If these files do not exist, they are created by C<po4a-updatepo>.
fr: Fichier(s) po à mettre à jour. Si ces fichiers n'existent pas, ils sont créés par C<po4a-updatepo>.

source: Extra option(s) to pass to the format plugin and other po4a internal module. Specify each option in the 'name=value' format. See the documentation of each plugin for more information about the valid options and their meanings.
fr: Passe une ou des options supplémentaires au greffon de format. Spécifiez chaque option en utilisant le format S<« nom=valeur »>. Veuillez vous référer à la documentation de chaque greffon pour la liste des options valides et leur signification.

source: List the documentation format handled by po4a.
fr: Liste les formats de documentation connus de po4a.

source: Copyright 2002, 2003, 2004, 2005 by SPI, inc.
fr: Copyright 2002, 2003, 2004, 2005 par SPI, inc.

source: msguntypot - update po files when a typo is fixed in pot file
fr: msguntypot - Mettre à jour des fichiers PO quand une typo est corrigée dans un fichier POT

source: msguntypot -o E<lt>old_potE<gt> -n E<lt>new_potE<gt> pofiles...
fr: msguntypot -o E<lt>ancien_pot<gt> -n E<lt>nouveau_pot<gt> fichier_po...

source: When you fix a trivial error which surely doesn't affect translations (e.g. a typo) in a .pot file, you should unfuzzy the corresponding msgstr in the translated .po files to avoid so extra work to the translators.
fr: Lorsque vous corrigez une erreur triviale qui n'affectera pas les traductions (par exemple une faute d'orthographe) dans un fichier POT, vous devriez retirer l'étiquette fuzzy sur les msgstr correspondantes dans les fichier .po afin d'éviter du travail supplémentaire aux traducteurs.

source: This task is difficult and error prone when done manually, and this tool is there to help doing so correctly. You just need to provide the two versions of the pot file: before the edition and after as marked in the above synopsis, and it all becomes automatic.
fr: Cette tâche est difficile et peut générer des erreurs quand elle est faite manuellement. Cet outil est là pour vous aider à faire ceci correctement. Vous n'avez qu'à fournir les deux versions du fichier S<POT :> avant la correction et après, comme indiqué dans la synopsis ci-dessus. Tout le reste est fait automatiquement.

source: HOW TO USE IT
fr: COMMENT L'UTILISER

source: In short, when you discover a typo in one of your [english] message, do the following:
fr: En bref, quand vous découvrez une erreur dans un de vos message (en anglais), fait comme S<suit :>

source: - Regenerate your pot and po files.
fr: - Regénérez vos fichiers pot et po.

source: make -C po/ update-po # for message program translations debconf-updatepo # for debconf translations po4a po4a.conf # for po4a based documentation translations
fr: make -C po/ update-po # pour les traductions des messages d'un programme debconf-updatepo # pour les traductions debconf po4a po4a.conf # pour les traductions de documentation # utilisant po4a

source: or something else, depending on your project's building settings. You know how to make sure your pot an po files are uptodate, don't you??
fr: ou quelque chose d'autre en fonction de votre projet. Vous savez comment mettre à jour vos fichiers pot et po, n'est-ce S<pas ?>

source: - Make a copy of your pot file.
fr: - Faites une copie de votre fichier po.

source: cp myfile.pot myfile.pot.orig
fr: cp monfichier.pot monfichier.pot.orig

source: - Make a copy of all your files.
fr: - Faites une copie de tous vos fichiers.

source: mkdir po_fridge; cp *.po po_fridge
fr: mkdir po_orig; cp *.po po_orig

source: - Fix your typo
fr: - Corrigez l'erreur.

source: $EDITOR the_file_in_which_there_is_a_typo
fr: $EDITOR le_fichier_à_corriger

source: See above.
fr: Voir ci-dessus

source: At this point, the typo fix fuzzied all the translations, and this unfortunate change is the only one between the po files of your main directory and the one from the fridge. Here is how to solve this.
fr: À ce moment là, la correction a marqué certaines chaînes fuzzy, et c'est malheureusement la seule modification entre les fichiers po de votre répertoire et ceux de po_orig. Voici comment corriger cela.

source: - Discard fuzzy translation, restore the ones from the fridge.
fr: - Abandonner les traductions fuzzy, récupérer celles du répertoire originel.

source: - Manually merge the po files with the new pot file, but taking the useless fuzzy into account
fr: - Fusionner manuellement les fichiers PO avec le nouveau fichier pot, en prenant en compte le fait que les étiquettes fuzzy sont inutiles.

source: msguntypot -o myfile.pot.orig -n myfile.pot *.po
fr: msguntypot -o monfichier.pot.orig -n monfichier.pot *.po

source: - Cleanups.
fr: - Nettoyages.

source: rm -rf myfile.pot.orig po_fridge
fr: rm -rf monfichier.pot.orig po_orig

source: You're done. The typo was eradicated from msgstr of both your pot and po files, and the po files were not fuzzyied in the process. Your translators love you already.
fr: C'est fini. L'erreur a été supprimée des messages de vos fichiers pot et po, et les fichiers po n'ont pas été fuzzyfiés au passage. Vous êtes désormais aimé(e) de vos traducteurs.

source: Despite its name, this tool is not part of the gettext tool suite. It is instead part of po4a. More precisely, it's a random perl script using the fine po4a modules. For more information about po4a, please see:
fr: Contrairement à ce que son nom indique, cet outil ne fait pas partie de la suite d'outils gettext. Il fait partie de po4a. Plus précisément, il s'agit d'un script utilisant les modules de po4a. Pour plus d'informations sur po4a, veuillez S<consulter :>
