Repository: TheShellLand/crossover-source
Catalog: po4a/po/pod/*.po
Languages: fr

source: Copyright (c) 2004 by Yves Rütschlé <po4a@rutschle.net>
fr: Copyright (c) 2004 par Yves Rütschlé <po4a@rutschle.net>

source: Locale::Po4a::Xml - Convert XML documents and derivates from/to PO files
fr: Locale::Po4a::Xml - Convertit les documents XML (ou dérivés) depuis/vers des fichiers PO

source: Locale::Po4a::Xml is a module to help the translation of XML documents into other [human] languages. It can also be used as a base to build modules for XML-based documents.
fr: Locale::Po4a::Xml est un module qui permet d'aider à traduire des documents XML dans d'autres langues. Il peut aussi servir de base pour créer d'autres modules pour des documents basés sur le format XML.

source: TRANSLATING WITH PO4A::XML
fr: TRADUCTION AVEC PO4A::XML

source: This module can be used directly to handle generic XML documents. This will extract all tag's content, and no attributes, since it's where the text is written in most XML based documents.
fr: Ce module peut être utilisé directement pour traiter des documents dans un format générique XML. Le contenu des balises sera extrait, mais pas celui des attributs, parce que c'est ainsi que sont écrits la plupart des documents basés sur XML.

source: The global debug option causes this module to show the excluded strings, in order to see if it skips something important.
fr: L'option globale de débogage permet d'indiquer à ce module d'afficher les chaînes exclues, de façon à voir s'il saute quelque chose d'important.

source: Prevents it to strip the spaces around the extracted strings.
fr: Évite que les espaces autour de la chaîne extraite ne soient éliminées.

source: Canonizes the string to translate, considering that whitespaces are not important, and wraps the translated document. This option can be overridden by custom tag options. See the "tags" option below.
fr: Crée une forme canonique de la chaîne à traduire, en considérant que les espaces ne sont pas importants, et remet en forme le document traduit. Cette option peut être surchargée par l'option de personnalisation des balises. Veuillez voir l'option S<« tags »> qui suit.

source: It makes the tags and attributes searching to work in a case insensitive way. If it's defined, it will treat E<lt>BooKE<gt>laNG and E<lt>BOOKE<gt>Lang as E<lt>bookE<gt>lang.
fr: Rend la recherche des balises et attributs insensibles à la casse. Si elle n'est pas définie, E<lt>BooKE<gt>laNG et E<lt>BOOKE<gt>Lang seront traités comme E<lt>bookE<gt>lang.

source: Extracts only the specified tags in the "tags" option. Otherwise, it will extract all the tags except the ones specified.
fr: N'extrait que les balises spécifiées par l'option S<« tags »>. Sinon, toutes seront extraites, sauf celles spécifiées.

source: String that will try to match with the first line of the document's doctype (if defined). If it doesn't, the document will be considered of a bad type.
fr: Chaîne qui sera comparée à la première ligne du doctype du document (s'il est défini). Si elle ne correspond pas, le document sera considéré comme étant du mauvais type.

source: Space-separated list of the tags you want to translate or skip. By default, the specified tags will be excluded, but if you use the "tagsonly" option, the specified tags will be the only ones included. The tags must be in the form E<lt>aaaE<gt>, but you can join some (E<lt>bbbE<gt>E<lt>aaaE<gt>) to say that the content of the tag E<lt>aaaE<gt> will only be translated when it's into a E<lt>bbbE<gt> tag.
fr: Liste de balises (séparées par des espaces) que vous voulez traduire ou sauter. Par défaut, les balises spécifiées seront exclues, mais si vous utilisez l'option S<« tagsonly »>, les balises spécifiées seront les seules à être inclues. Les balises doivent être de la forme E<lt>aaaE<gt>, mais vous pouvez en joindre (E<lt>bbbE<gt>E<lt>aaaE<gt>) pour indiquer que le contenu de la balise E<lt>aaaE<gt> ne sera traduit que lorsqu'elle est comprise dans une balise E<lt>bbbE<gt>.

source: You can also specify some tag options putting some characters in front of the tag hierarchy. For example, you can put 'w' (wrap) or 'W' (don't wrap) to override the default behavior specified by the global "wrap" option.
fr: Vous pouvez également spécifier des options aux balises en précédant les hiérarchies de balises par des caractères. Par exemple, vous pouvez ajouter un S<« w »> (wrap - remise en forme) ou S<« W »> (pas de remise en forme) pour changer le comportement par défaut fourni par l'option S<« wrap »> globale.

source: Example: WE<lt>chapterE<gt>E<lt>titleE<gt>
fr: Par S<exemple :> WE<lt>chapitreE<gt>E<lt>titreE<gt>

source: Space-separated list of the tag's attributes you want to translate. You can specify the attributes by their name (for example, "lang"), but you can prefix it with a tag hierarchy, to specify that this attribute will only be translated when it's into the specified tag. For example: E<lt>bbbE<gt>E<lt>aaaE<gt>lang specifies that the lang attribute will only be translated if it's into an E<lt>aaaE<gt> tag, and it's into a E<lt>bbbE<gt> tag.
fr: Liste d'attributs de balises (séparés par des espaces) que vous voulez traduire. Vous pouvez spécifier les attributs par leur nom (par exemple, S<« lang »>), mais vous pouvez aussi les faire précéder d'une hiérarchie de balises pour indiquer que cet attribut ne sera traduit que quand il sera placé à l'intérieur d'une balise. Par S<exemple :> E<lt>bbbE<gt>E<lt>aaaE<gt>lang indique que l'attribut lang ne sera traduit que s'il se trouve dans une balise E<lt>aaaE<gt>, se trouvant elle-même dans une balise E<lt>bbbE<gt>.

source: Space-separated list of the tags you want to treat as inline. By default, all tags break the sequence. This follows the same syntax as the tags option.
fr: Liste de balises (séparées par des espaces) que vous voulez voir traitées en ligne. Par défaut, toutes les balises introduisent une césure. La même syntaxe que celle de l'option tags est utilisée.

source: Space separated list of tags that the module should not try to set by default in the "tags" or "inline" category.
fr: Liste de balises (séparées par des espaces) que le module ne doit pas placer, par défaut, dans les catégories S<« tags »> ou S<« inline »>.

source: DEFINE WHAT TAGS AND ATTRIBUTES TO TRANSLATE
fr: DÉFINITION DES BALISES ET ATTRIBUTS À TRADUIRE

source: The simplest customization is to define which tags and attributes you want the parser to translate. This should be done in the initialize function. First you should call the main initialize, to get the command-line options, and then, append your custom definitions to the options hash. If you want to treat some new options from command line, you should define them before calling the main initialize:
fr: La configuration la plus simple consiste à définir quelles balises et attributs vous voulez que l'analyseur traduise. Elle doit être faite dans la fonction initialize. Vous devez dans un premier temps appeler la fonction initialize principale, pour obtenir les options de la ligne de commande, puis ajouter vos propres configurations à la table de hachage options. Si vous voulez traiter de nouvelles options de la ligne de commande, vous devez les définir avant d'appeler la fonction initialize S<principale :>

source: OVERRIDING THE found_string FUNCTION
fr: SURCHARGE DE LA FONCTION found_string

source: Another simple step is to override the function "found_string", which receives the extracted strings from the parser, in order to translate them. There you can control which strings you want to translate, and perform transformations to them before or after the translation itself.
fr: Une autre étape simple consiste à surcharger la fonction S<« found_string »>, qui prend les chaînes extraites par l'analyseur en paramètre, pour les traduire. Elle vous permet de contrôler quelles chaînes vous voulez traduire, et d'effectuer des transformations avant ou après la traduction en elle-même.

source: It receives the extracted text, the reference on where it was, and a hash that contains extra information to control what strings to translate, how to translate them and to generate the comment.
fr: Elle reçoit le texte extrait, la référence où elle se trouve, et une table de hachage qui contient des informations additionnelles permettant de contrôler quelles sont les chaînes à traduire, comment les traduire et de générer le commentaire.

source: The content of these options depends on the kind of string it is (specified in an entry of this hash):
fr: Le contenu de ces options dépend du type de la chaîne (spécifié dans une entrée de la table de S<hachage) :>

source: The found string is the content of a translatable tag. The entry "tag_options" contains the option characters in front of the tag hierarchy in the module "tags" option.
fr: La chaîne trouvée est le contenu d'une balise à traduire. L'entrée S<« tag_options »> contient les caractères d'options se trouvant en tête de la hiérarchie de balise de l'option S<« tags »> du module.

source: Means that the found string is the value of a translatable attribute. The entry "attribute" has the name of the attribute.
fr: Signifie que la chaîne trouvée correspond à la valeur d'un attribut à traduire. L'entrée S<« attribute »> contient le nom de l'attribut.

source: It must return the text that will replace the original in the translated document. Here's a basic example of this function:
fr: Elle doit renvoyer le texte qui remplacera l'original dans le document traduit. Voici un exemple simple d'implémentation de cette S<fonction :>

source: There's another simple example in the new Dia module, which only filters some strings.
fr: Il y a également un exemple simple dans le module Dia, qui ne filtre que quelques chaînes.

source: MODIFYING TAG TYPES (TODO)
fr: MODIFIER LE TYPE DES BALISES (À FAIRE)

source: This is a more complex one, but it enables a (almost) total customization. It's based in a list of hashes, each one defining a tag type's behavior. The list should be sorted so that the most general tags are after the most concrete ones (sorted first by the beginning and then by the end keys). To define a tag type you'll have to make a hash with the following keys:
fr: Ceci est plus complexe, mais permet un contrôle (presque) total du paramétrage. C'est basé sur une liste de tables de hachage, chacune définissant le comportement d'un type de balise. La liste doit être triée de façon à ce que les balises les plus générales se trouvent après les plus concrètes (trié dans un premier temps par la clé S<« beginning »> puis par S<« end »>). Pour définir un type de balise, vous n'aurez qu'à créer une table de hachage avec les clés S<suivantes :>

source: Specifies the beginning of the tag, after the "E<lt>".
fr: Spécifie le début de la balise, suivi de S<« E<lt> »>.

source: Specifies the end of the tag, before the "E<gt>".
fr: Spécifie la fin de la balise, précédé de S<« E<gt> »>.

source: It says if this is a breaking tag class. A non-breaking (inline) tag is one that can be taken as part of the content of another tag. It can take the values false (0), true (1) or undefined. If you leave this undefined, you'll have to define the f_breaking function that will say whether a concrete tag of this class is a breaking tag or not.
fr: Indique s'il s'agit d'une balise de césure. Une balise n'étant pas de césure (en ligne) peut être incluse dans le contenu d'une autre. L'option peut prendre les valeurs fausse (0), vraie (1) ou non définie. Si vous la laissez non définie, vous devrez définir la fonction f_breaking qui indique si une balise d'une classe donnée est une balise de césure ou pas.

source: It's a function that will tell if the next tag is a breaking one or not. It should be defined if the "breaking" option is not.
fr: C'est une fonction qui indique si la balise suivante est une balise de césure ou pas. Elle devrait être définie si l'option S<« breaking »> ne l'est pas.

source: If you leave this key undefined, the generic extraction function will have to extract the tag itself. It's useful for tags that can have other tags or special structures in them, so that the main parser doesn't get mad. This function receives a boolean that says if the tag should be removed from the input stream or not.
fr: Si vous ne définissez pas cette clé, la fonction générique d'extraction devra extraire la balise elle-même. Elle est utile pour les balises qui peuvent contenir d'autres balises ou structures particulières, de façon à ce que l'analyseur ne devienne pas fou. Cette fonction prend en paramètre un booléen qui indique si la balise doit être retirée du flux d'entrée ou non.

source: This function receives the tag (in the get_string_until() format) and returns the translated tag (translated attributes or all needed transformations) as a single string.
fr: Cette fonction prend en paramètre une balise (dans le format de get_string_until()) et renvoie la balise traduite (avec les attributs traduits ou n'importe quelle transformation nécessaire) en une seule chaîne.

source: WORKING WITH TAGS
fr: TRAITEMENT DES BALISES

source: This function returns the path to the current tag from the document's root, in the form E<lt>htmlE<gt>E<lt>bodyE<gt>E<lt>pE<gt>.
fr: Cette fonction renvoie le chemin vers la balise actuelle à partir de la racine du document, sous la forme E<lt>htmlE<gt>E<lt>bodyE<gt>E<lt>pE<gt>.

source: This function returns the index from the tag_types list that fits to the next tag in the input stream, or -1 if it's at the end of the input file.
fr: Cette fonction renvoie l'index dans la liste tag_types qui correspond à la prochaine balise du flux d'entrée ou -1 s'il s'agit de la fin du fichier d'entrée.

source: This function returns the next tag from the input stream without the beginning and end, in an array form, to maintain the references from the input file. It has two parameters: the type of the tag (as returned by tag_type) and a boolean, that indicates if it should be removed from the input stream.
fr: Cette fonction renvoie la balise suivante du flux d'entrée sans son début ou sa fin, sous la forme d'un tableau, pour maintenir les références du fichier d'entrée. Elle prend deux S<paramètres :> le type de la balise (tel qu'il est renvoyé par tag_type) et un booléen indiquant s'il doit être retiré du flux d'entrée.

source: This function returns the name of the tag passed as an argument, in the array form returned by extract_tag.
fr: Cette fonction renvoie le nom de la balise passée en paramètre, dans la même forme que le tableau renvoyé par extract_tag.

source: This function returns a boolean that says if the next tag in the input stream is a breaking tag or not (inline tag). It leaves the input stream intact.
fr: Cette fonction renvoie un booléen qui indique si la prochaine balise est une balise de césure ou pas (balise en ligne). Le flux d'entrée n'est pas touché.

source: This function translates the next tag from the input stream. Using each tag type's custom translation functions.
fr: Cette fonction traduit la balise suivante du flux d'entrée, en utilisant les fonctions de traduction personnalisées pour chaque balise.

source: This function returns a string value that says if the first argument (a tag hierarchy) matches any of the tags from the second argument (a list of tags or tag hierarchies). If it doesn't match, it returns 0. Else, it returns the matched tag's options (the characters in front of the tag) or 1 (if that tag doesn't have options).
fr: Cette fonction renvoie une chaîne qui indique si son premier paramètre (une hiérarchie de balise) correspond à une des balises du second paramètre (une liste de balises ou une hiérarchie de balises). Si elle ne correspond pas, la valeur 0 est renvoyée. Sinon, elle renvoie les options de la balise qui correspond (les caractères qui la précèdent) ou 1 (si la balise n'a pas d'option).

source: WORKING WITH ATTRIBUTES
fr: TRAITEMENT DES ATTRIBUTS

source: This function handles the translation of the tags' attributes. It receives the tag without the beginning / end marks, and then it finds the attributes, and it translates the translatable ones (specified by the module option "attributes"). This returns a plain string with the translated tag.
fr: Cette fonction s'occupe de la traduction des attributs des balises. Elle reçoit les balises sans les marquer de début ou de fin, puis trouve les attributs, et traduit ceux qui doivent l'être (spécifiés par l'option S<« attributes »> du module). Elle renvoie une chaîne brute avec les balises traduites.

source: WORKING WITH THE MODULE OPTIONS
fr: TRAITEMENT DES OPTIONS DU MODULE

source: This function fills the internal structures that contain the tags, attributes and inline data with the options of the module (specified in the command-line or in the initialize function).
fr: Cette fonction remplit les structures internes qui contiennent les balises, les attributs et les données à mettre en ligne en fonction des options du module (spécifiées par la ligne de commande ou dans la fonction initialize).

source: GETTING TEXT FROM THE INPUT DOCUMENT
fr: RÉCUPÉRER DU TEXTE DU DOCUMENT D'ENTRÉE

source: This function returns an array with the lines (and references) from the input document until it finds the first argument. The second argument is an options hash. Value 0 means disabled (the default) and 1, enabled.
fr: Cette fonction renvoie un tableau des lignes (et leurs références) du document d'entrée de son début jusqu'à ce que soit trouvé son premier paramètre. Le second paramètre est une table de hachage d'options. La valeur 0 signifie que l'option est désactivée (par défaut) et 1, activée.

source: The valid options are:
fr: Les options valables S<sont :>

source: This makes the returned array to contain the searched text
fr: Fait en sorte que le tableau renvoyé contient le texte recherché

source: This removes the returned stream from the input
fr: Retire de l'entrée le flux renvoyé

source: This ensures that the searched text is outside any quotes
fr: Permet de s'assurer que le texte recherché ne se trouve pas entre guillemets

source: This function receives as argument the reference to a paragraph (in the format returned by get_string_until), skips his heading spaces and returns them as a simple string.
fr: Cette fonction reçoit en paramètre la référence à un paragraphe (dans le format renvoyé par get_string_until), retire les espaces de tête et les renvoie comme une simple chaîne.

source: This function returns a simple string with the text from the argument array (discarding the references).
fr: Cette fonction renvoie une simple chaîne à partir du texte fourni en paramètre sous la forme d'un tableau (en ignorant la référence).

source: This module can translate tags and attributes.
fr: Ce module peut traduire les balises et les attributs.

source: Support for entities and included files is in the TODO list.
fr: Le support des entités et des fichiers inclus est dans la liste des choses à faire.

source: The writing of derivate modules is rather limited.
fr: L'écriture de modules dérivés est plutôt limitée.

source: DOCTYPE (ENTITIES)
fr: DOCTYPE (ENTITÉS)

source: There is a minimal support for the translation of entities. They are translated as a whole, and tags are not taken into account. Multilines entities are not supported and entities are always rewrapped during the translation.
fr: La traduction des entités est à peine supportée. Les entités sont traduites telles quelles, et les balises qu'elles contiennent ne sont pas prises en compte. Les entités sur plusieurs lignes ne sont pas supportées. De plus, les entités sont remises en forme pendant la traduction.

source: INCLUDED FILES
fr: INCLUSIONS DE FICHIERS

source: MODIFY TAG TYPES FROM INHERITED MODULES (move the tag_types structure inside the $self hash?)
fr: MODIFIER LES BALISES DEPUIS LES MODULES DÉRIVÉS (déplacer la structure tag_types à l'intérieur de la table de hachage S<$self ?>)

source: breaking tag inside non-breaking tag (possible?) causes ugly comments
fr: Les balises de césure à l'intérieur d'autres balises n'étant pas de césure (est-ce possible ?) provoquent d'horribles commentaires

source: Copyright (c) 2004 by Jordi Vilalta E<lt>jvprat@gmail.comE<gt>
fr: Copyright (c) 2004 par Jordi Vilalta E<lt>jvprat@gmail.comE<gt>

source: po4a - update both the po files and translated documents in one shot
fr: po4a - met à jour à la fois les fichiers po et les documents traduits

source: po4a [-dhvV] E<lt>config_fileE<gt>
fr: po4a [-dhvV] E<lt>fichier_de_configurationE<gt>

source: The C<po4a> program is in charge of updating both the po files (to sync them to the original documents) and the translated documents (to sync them to the po files). The main point is to make the use of po4a easier without having to remember of the command line options.
fr: Le programme C<po4a> est chargé de mettre à jour à la fois les fichiers po (les synchroniser avec les documents originaux) et les documents traduits (les synchroniser avec les fichiers po). Le principal avantage est de faciliter l'utilisation de po4a sans avoir besoin de se souvenir des options en lignes de commande.

source: It also allows you to mix documents having different formats into the same pot file so that you can have only one such file per project.
fr: Il vous permet de mélanger des documents de différents formats dans le même fichier pot de façon à n'en avoir qu'un seul par projet.

source: This behaviour can be mimicked by the other tools of the po4a suite (for example with makefiles), but it is rather difficult to do, and exhausting to redo the same complicated makefiles for each project using po4a.
fr: Ce comportement peut être imité par les autres outils de la suite po4a (par exemple avec des makefiles), mais il est relativement difficile à faire, et fatiguant de toujours refaire les mêmes makefiles compliqués pour chaque projet utilisant po4a.

source: The dataflow can be summarized as follow. Any changes to the master document will be reflected in the po files, and all changes to the po files (either manual or caused by previous step) will be reflected in translation documents.
fr: Le flux des données peut se résumer de la façon suivante. Tout changement dans le document d'origine est reflété dans les fichiers po, et tout changement dans les fichiers po (qu'il soit manuel ou causé par une des étapes précédentes) sera reflété dans les documents traduits.

source: master document --> po files --> translations
fr: document maître --> fichiers po --> traductions

source: The dataflow cannot be inversed in this tool, and changes in translations are overwritten by the content of the po files. As a matter of fact, this tool cannot be used to convert existing translations to the po4a system. For that task, please refer to L<po4a-gettextize(1)>.
fr: Le flux de données ne peut pas être inversé dans cet outil, et les changements dans les traductions sont écrasés par le contenu des fichiers po. Cet outil ne peut donc pas être utilisé pour convertir les traductions existantes à po4a. Pour ceci, veuillez consulter L<po4a-gettextize(1)>.

source: CONFIGURATION FILE SYNTAX
fr: SYNTAXE DU FICHIER DE CONFIGURATION

source: The (mandatory) argument is the path to the configuration file to use. Its syntax aims at being simple and close to the configuration files used by the intl-tools projects.
fr: Le paramètre (obligatoire) indique le chemin du fichier de configuration à utiliser. Sa syntaxe a vocation d'être simple et proche des autres fichiers de configuration utilisés par les projets d'internationalisation.
